/*
 Navicat Premium Dump SQL

 Source Server         : 1
 Source Server Type    : MySQL
 Source Server Version : 50726 (5.7.26)
 Source Host           : localhost:3306
 Source Schema         : cl583636164

 Target Server Type    : MySQL
 Target Server Version : 50726 (5.7.26)
 File Encoding         : 65001

 Date: 03/02/2026 10:41:40
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for bisaibaoming
-- ----------------------------
DROP TABLE IF EXISTS `bisaibaoming`;
CREATE TABLE `bisaibaoming`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `saishimingcheng` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '赛事名称',
  `bisaishijian` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '比赛时间',
  `bisaichangdi` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '比赛场地',
  `cansaiduiyuan` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '参赛队员',
  `baomingshijian` datetime NULL DEFAULT NULL COMMENT '报名时间',
  `duizhangzhanghao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '队长账号',
  `duizhangxingming` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '队长姓名',
  `qiuduimingcheng` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '球队名称',
  `caipanzhanghao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '裁判账号',
  `caipanxingming` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '裁判姓名',
  `sfsh` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT '待审核' COMMENT '是否审核',
  `shhf` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '回复内容',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 65 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '比赛报名' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of bisaibaoming
-- ----------------------------
INSERT INTO `bisaibaoming` VALUES (1, '2026-01-29 08:15:50', 'A组第1轮：烈焰冲锋队vs极速闪电团', '2024年3月1日 14:00', '中心体育馆1号场', '张浩然、欧阳旭日、司马长空', '2026-03-01 10:00:00', '2022010010001', '张浩然', '烈焰冲锋队', 'CP2023001', '赵铁面', '是', '');
INSERT INTO `bisaibaoming` VALUES (2, '2026-01-29 08:15:50', 'A组第1轮：烈焰冲锋队vs极速闪电团', '2024年3月1日 14:00', '中心体育馆1号场', '李梓涵、上官云珠、诸葛亮亮', '2026-03-01 10:00:00', '2022010010004', '李梓涵', '极速闪电团', 'CP2023001', '赵铁面', '是', '');
INSERT INTO `bisaibaoming` VALUES (3, '2026-01-29 08:15:50', 'A组第1轮：无限火力队vs青春风暴', '2024年3月1日 15:30', '中心体育馆2号场', '王伟泽、欧阳震华、慕容冲', '2026-03-01 10:00:00', '2022010010007', '王伟泽', '无限火力队', 'CP2023002', '冯雷', '是', '');
INSERT INTO `bisaibaoming` VALUES (4, '2026-01-29 08:15:50', 'A组第1轮：无限火力队vs青春风暴', '2024年3月1日 15:30', '中心体育馆2号场', '刘诗诗、诸葛青云、独孤雨柔', '2026-03-01 10:00:00', '2022010010010', '刘诗诗', '青春风暴', 'CP2023002', '冯雷', '是', '');
INSERT INTO `bisaibaoming` VALUES (5, '2026-01-29 08:15:50', 'A组第2轮：烈焰冲锋队vs无限火力队', '2024年3月2日 14:00', '中心体育馆1号场', '张浩然、欧阳旭日、司马长空', '2026-03-02 10:00:00', '2022010010001', '张浩然', '烈焰冲锋队', 'CP2023003', '张明远', '是', '');
INSERT INTO `bisaibaoming` VALUES (6, '2026-01-29 08:15:50', 'A组第2轮：烈焰冲锋队vs无限火力队', '2024年3月2日 14:00', '中心体育馆1号场', '王伟泽、欧阳震华、慕容冲', '2026-03-02 10:00:00', '2022010010007', '王伟泽', '无限火力队', 'CP2023003', '张明远', '是', '');
INSERT INTO `bisaibaoming` VALUES (7, '2026-01-29 08:15:50', 'A组第2轮：极速闪电团vs青春风暴', '2024年3月2日 15:30', '中心体育馆2号场', '李梓涵、上官云珠、诸葛亮亮', '2026-03-02 10:00:00', '2022010010004', '李梓涵', '极速闪电团', 'CP2023004', '王志刚', '是', '');
INSERT INTO `bisaibaoming` VALUES (8, '2026-01-29 08:15:50', 'A组第2轮：极速闪电团vs青春风暴', '2024年3月2日 15:30', '中心体育馆2号场', '刘诗诗、诸葛青云、独孤雨柔', '2026-03-02 10:00:00', '2022010010010', '刘诗诗', '青春风暴', 'CP2023004', '王志刚', '是', '');
INSERT INTO `bisaibaoming` VALUES (9, '2026-01-29 08:15:50', 'A组第3轮：烈焰冲锋队vs青春风暴', '2024年3月3日 14:00', '中心体育馆1号场', '张浩然、欧阳旭日、司马长空', '2026-03-03 10:00:00', '2022010010001', '张浩然', '烈焰冲锋队', 'CP2023005', '孙公正', '是', '');
INSERT INTO `bisaibaoming` VALUES (10, '2026-01-29 08:15:50', 'A组第3轮：烈焰冲锋队vs青春风暴', '2024年3月3日 14:00', '中心体育馆1号场', '刘诗诗、诸葛青云、独孤雨柔', '2026-03-03 10:00:00', '2022010010010', '刘诗诗', '青春风暴', 'CP2023005', '孙公正', '是', '');
INSERT INTO `bisaibaoming` VALUES (11, '2026-01-29 08:15:50', 'A组第3轮：极速闪电团vs无限火力队', '2024年3月3日 15:30', '中心体育馆2号场', '李梓涵、上官云珠、诸葛亮亮', '2026-03-03 10:00:00', '2022010010004', '李梓涵', '极速闪电团', 'CP2023006', '吴浩然', '是', '');
INSERT INTO `bisaibaoming` VALUES (12, '2026-01-29 08:15:50', 'A组第3轮：极速闪电团vs无限火力队', '2024年3月3日 15:30', '中心体育馆2号场', '王伟泽、欧阳震华、慕容冲', '2026-03-03 10:00:00', '2022010010007', '王伟泽', '无限火力队', 'CP2023006', '吴浩然', '是', '');
INSERT INTO `bisaibaoming` VALUES (13, '2026-01-29 08:15:50', 'B组第1轮：快乐星球vs超能陆战队', '2024年3月1日 14:00', '体育中心3号场', '陈明轩、皇甫铁牛、令狐飞', '2026-03-01 10:00:00', '2022010010013', '陈明轩', '快乐星球', 'CP2023007', '郑直', '是', '');
INSERT INTO `bisaibaoming` VALUES (14, '2026-01-29 08:15:50', 'B组第1轮：快乐星球vs超能陆战队', '2024年3月1日 14:00', '体育中心3号场', '慕容紫英、诸葛大力、上官婉儿', '2026-03-01 10:00:00', '2022010010016', '慕容紫英', '超能陆战队', 'CP2023007', '郑直', '是', '');
INSERT INTO `bisaibaoming` VALUES (15, '2026-01-29 08:15:50', 'B组第1轮：元气满满队vs进击的巨人', '2024年3月1日 15:30', '体育中心4号场', '赵子龙、公孙离离、司马光耀', '2026-03-01 10:00:00', '2022010010019', '赵子龙', '元气满满队', 'CP2023008', '李雪梅', '是', '');
INSERT INTO `bisaibaoming` VALUES (16, '2026-01-29 08:15:50', 'B组第1轮：元气满满队vs进击的巨人', '2024年3月1日 15:30', '体育中心4号场', '孙小美、独孤求败、欧阳娜娜', '2026-03-01 10:00:00', '2022010010022', '孙小美', '进击的巨人', 'CP2023008', '李雪梅', '是', '');
INSERT INTO `bisaibaoming` VALUES (17, '2026-01-29 08:15:50', 'B组第2轮：快乐星球vs元气满满队', '2024年3月2日 14:00', '体育中心3号场', '陈明轩、皇甫铁牛、令狐飞', '2026-03-02 10:00:00', '2022010010013', '陈明轩', '快乐星球', 'CP2023009', '周杰', '是', '');
INSERT INTO `bisaibaoming` VALUES (18, '2026-01-29 08:15:50', 'B组第2轮：快乐星球vs元气满满队', '2024年3月2日 14:00', '体育中心3号场', '赵子龙、公孙离离、司马光耀', '2026-03-02 10:00:00', '2022010010019', '赵子龙', '元气满满队', 'CP2023009', '周杰', '是', '');
INSERT INTO `bisaibaoming` VALUES (19, '2026-01-29 08:15:50', 'B组第2轮：超能陆战队vs进击的巨人', '2024年3月2日 15:30', '体育中心4号场', '慕容紫英、诸葛大力、上官婉儿', '2026-03-02 10:00:00', '2022010010016', '慕容紫英', '超能陆战队', 'CP2023010', '陈平', '是', '');
INSERT INTO `bisaibaoming` VALUES (20, '2026-01-29 08:15:50', 'B组第2轮：超能陆战队vs进击的巨人', '2024年3月2日 15:30', '体育中心4号场', '孙小美、独孤求败、欧阳娜娜', '2026-03-02 10:00:00', '2022010010022', '孙小美', '进击的巨人', 'CP2023010', '陈平', '是', '');
INSERT INTO `bisaibaoming` VALUES (21, '2026-01-29 08:15:50', 'B组第3轮：快乐星球vs进击的巨人', '2024年3月3日 14:00', '体育中心3号场', '陈明轩、皇甫铁牛、令狐飞', '2026-03-03 10:00:00', '2022010010013', '陈明轩', '快乐星球', 'CP2023001', '赵铁面', '是', '');
INSERT INTO `bisaibaoming` VALUES (22, '2026-01-29 08:15:50', 'B组第3轮：快乐星球vs进击的巨人', '2024年3月3日 14:00', '体育中心3号场', '孙小美、独孤求败、欧阳娜娜', '2026-03-03 10:00:00', '2022010010022', '孙小美', '进击的巨人', 'CP2023001', '赵铁面', '是', '');
INSERT INTO `bisaibaoming` VALUES (23, '2026-01-29 08:15:50', 'B组第3轮：超能陆战队vs元气满满队', '2024年3月3日 15:30', '体育中心4号场', '慕容紫英、诸葛大力、上官婉儿', '2026-03-03 10:00:00', '2022010010016', '慕容紫英', '超能陆战队', 'CP2023002', '冯雷', '是', '');
INSERT INTO `bisaibaoming` VALUES (24, '2026-01-29 08:15:50', 'B组第3轮：超能陆战队vs元气满满队', '2024年3月3日 15:30', '体育中心4号场', '赵子龙、公孙离离、司马光耀', '2026-03-03 10:00:00', '2022010010019', '赵子龙', '元气满满队', 'CP2023002', '冯雷', '是', '');
INSERT INTO `bisaibaoming` VALUES (25, '2026-01-29 08:15:50', 'C组第1轮：燃烧吧少年vs逆风翻盘队', '2024年3月4日 14:00', '大学城体育馆1号场', '周杰伦、尉迟敬德、东方不败', '2026-03-04 10:00:00', '2022010010025', '周杰伦', '燃烧吧少年', 'CP2023003', '张明远', '是', '');
INSERT INTO `bisaibaoming` VALUES (26, '2026-01-29 08:15:50', 'C组第1轮：燃烧吧少年vs逆风翻盘队', '2024年3月4日 14:00', '大学城体育馆1号场', '吴彦祖、令狐冲冲、慕容复', '2026-03-04 10:00:00', '2022010010028', '吴彦祖', '逆风翻盘队', 'CP2023003', '张明远', '是', '');
INSERT INTO `bisaibaoming` VALUES (27, '2026-01-29 08:15:50', 'C组第1轮：雷霆战将vs钢铁洪流', '2024年3月4日 15:30', '大学城体育馆2号场', '郑爽爽、上官飞燕、诸葛瑾瑾', '2026-03-04 10:00:00', '2022010010031', '郑爽爽', '雷霆战将', 'CP2023004', '王志刚', '是', '');
INSERT INTO `bisaibaoming` VALUES (28, '2026-01-29 08:15:50', 'C组第1轮：雷霆战将vs钢铁洪流', '2024年3月4日 15:30', '大学城体育馆2号场', '林志颖、欧阳锋、司马昭', '2026-03-04 10:00:00', '2022010010034', '林志颖', '钢铁洪流', 'CP2023004', '王志刚', '是', '');
INSERT INTO `bisaibaoming` VALUES (29, '2026-01-29 08:15:50', 'C组第2轮：燃烧吧少年vs雷霆战将', '2024年3月5日 14:00', '大学城体育馆1号场', '周杰伦、尉迟敬德、东方不败', '2026-03-05 10:00:00', '2022010010025', '周杰伦', '燃烧吧少年', 'CP2023005', '孙公正', '是', '');
INSERT INTO `bisaibaoming` VALUES (30, '2026-01-29 08:15:50', 'C组第2轮：燃烧吧少年vs雷霆战将', '2024年3月5日 14:00', '大学城体育馆1号场', '郑爽爽、上官飞燕、诸葛瑾瑾', '2026-03-05 10:00:00', '2022010010031', '郑爽爽', '雷霆战将', 'CP2023005', '孙公正', '是', '');
INSERT INTO `bisaibaoming` VALUES (31, '2026-01-29 08:15:50', 'C组第2轮：逆风翻盘队vs钢铁洪流', '2024年3月5日 15:30', '大学城体育馆2号场', '吴彦祖、令狐冲冲、慕容复', '2026-03-05 10:00:00', '2022010010028', '吴彦祖', '逆风翻盘队', 'CP2023006', '吴浩然', '是', '');
INSERT INTO `bisaibaoming` VALUES (32, '2026-01-29 08:15:50', 'C组第2轮：逆风翻盘队vs钢铁洪流', '2024年3月5日 15:30', '大学城体育馆2号场', '林志颖、欧阳锋、司马昭', '2026-03-05 10:00:00', '2022010010034', '林志颖', '钢铁洪流', 'CP2023006', '吴浩然', '是', '');
INSERT INTO `bisaibaoming` VALUES (33, '2026-01-29 08:15:50', 'C组第3轮：燃烧吧少年vs钢铁洪流', '2024年3月6日 14:00', '大学城体育馆1号场', '周杰伦、尉迟敬德、东方不败', '2026-03-06 10:00:00', '2022010010025', '周杰伦', '燃烧吧少年', 'CP2023007', '郑直', '是', '');
INSERT INTO `bisaibaoming` VALUES (34, '2026-01-29 08:15:50', 'C组第3轮：燃烧吧少年vs钢铁洪流', '2024年3月6日 14:00', '大学城体育馆1号场', '林志颖、欧阳锋、司马昭', '2026-03-06 10:00:00', '2022010010034', '林志颖', '钢铁洪流', 'CP2023007', '郑直', '是', '');
INSERT INTO `bisaibaoming` VALUES (35, '2026-01-29 08:15:50', 'C组第3轮：逆风翻盘队vs雷霆战将', '2024年3月6日 15:30', '大学城体育馆2号场', '吴彦祖、令狐冲冲、慕容复', '2026-03-06 10:00:00', '2022010010028', '吴彦祖', '逆风翻盘队', 'CP2023008', '李雪梅', '是', '');
INSERT INTO `bisaibaoming` VALUES (36, '2026-01-29 08:15:50', 'C组第3轮：逆风翻盘队vs雷霆战将', '2024年3月6日 15:30', '大学城体育馆2号场', '郑爽爽、上官飞燕、诸葛瑾瑾', '2026-03-06 10:00:00', '2022010010031', '郑爽爽', '雷霆战将', 'CP2023008', '李雪梅', '是', '');
INSERT INTO `bisaibaoming` VALUES (37, '2026-01-29 08:15:50', 'D组第1轮：梦想起航vs星辰大海', '2024年3月4日 14:00', '新区体育中心1号场', '黄晓明、皇甫嵩、独孤剑', '2026-03-04 10:00:00', '2022010010037', '黄晓明', '梦想起航', 'CP2023009', '周杰', '是', '');
INSERT INTO `bisaibaoming` VALUES (38, '2026-01-29 08:15:50', 'D组第1轮：梦想起航vs星辰大海', '2024年3月4日 14:00', '新区体育中心1号场', '杨幂幂、上官秋月、慕容雪', '2026-03-04 10:00:00', '2022010010040', '杨幂幂', '星辰大海', 'CP2023009', '周杰', '是', '');
INSERT INTO `bisaibaoming` VALUES (39, '2026-01-29 08:15:50', 'D组第1轮：王者荣耀vs传奇之路', '2024年3月4日 15:30', '新区体育中心2号场', '邓超超、尉迟恭、令狐平', '2026-03-04 10:00:00', '2022010010043', '邓超超', '王者荣耀', 'CP2023010', '陈平', '是', '');
INSERT INTO `bisaibaoming` VALUES (40, '2026-01-29 08:15:50', 'D组第1轮：王者荣耀vs传奇之路', '2024年3月4日 15:30', '新区体育中心2号场', '赵丽颖、诸葛芸芸、独孤静', '2026-03-04 10:00:00', '2022010010046', '赵丽颖', '传奇之路', 'CP2023010', '陈平', '是', '');
INSERT INTO `bisaibaoming` VALUES (41, '2026-01-29 08:15:50', 'D组第2轮：梦想起航vs王者荣耀', '2024年3月5日 14:00', '新区体育中心1号场', '黄晓明、皇甫嵩、独孤剑', '2026-03-05 10:00:00', '2022010010037', '黄晓明', '梦想起航', 'CP2023001', '赵铁面', '是', '');
INSERT INTO `bisaibaoming` VALUES (42, '2026-01-29 08:15:50', 'D组第2轮：梦想起航vs王者荣耀', '2024年3月5日 14:00', '新区体育中心1号场', '邓超超、尉迟恭、令狐平', '2026-03-05 10:00:00', '2022010010043', '邓超超', '王者荣耀', 'CP2023001', '赵铁面', '是', '');
INSERT INTO `bisaibaoming` VALUES (43, '2026-01-29 08:15:50', 'D组第2轮：星辰大海vs传奇之路', '2024年3月5日 15:30', '新区体育中心2号场', '杨幂幂、上官秋月、慕容雪', '2026-03-05 10:00:00', '2022010010040', '杨幂幂', '星辰大海', 'CP2023002', '冯雷', '是', '');
INSERT INTO `bisaibaoming` VALUES (44, '2026-01-29 08:15:50', 'D组第2轮：星辰大海vs传奇之路', '2024年3月5日 15:30', '新区体育中心2号场', '赵丽颖、诸葛芸芸、独孤静', '2026-03-05 10:00:00', '2022010010046', '赵丽颖', '传奇之路', 'CP2023002', '冯雷', '是', '');
INSERT INTO `bisaibaoming` VALUES (45, '2026-01-29 08:15:50', 'D组第3轮：梦想起航vs传奇之路', '2024年3月6日 14:00', '新区体育中心1号场', '黄晓明、皇甫嵩、独孤剑', '2026-03-06 10:00:00', '2022010010037', '黄晓明', '梦想起航', 'CP2023003', '张明远', '是', '');
INSERT INTO `bisaibaoming` VALUES (46, '2026-01-29 08:15:50', 'D组第3轮：梦想起航vs传奇之路', '2024年3月6日 14:00', '新区体育中心1号场', '赵丽颖、诸葛芸芸、独孤静', '2026-03-06 10:00:00', '2022010010046', '赵丽颖', '传奇之路', 'CP2023003', '张明远', '是', '');
INSERT INTO `bisaibaoming` VALUES (47, '2026-01-29 08:15:50', 'D组第3轮：星辰大海vs王者荣耀', '2024年3月6日 15:30', '新区体育中心2号场', '杨幂幂、上官秋月、慕容雪', '2026-03-06 10:00:00', '2022010010040', '杨幂幂', '星辰大海', 'CP2023004', '王志刚', '是', '');
INSERT INTO `bisaibaoming` VALUES (48, '2026-01-29 08:15:50', 'D组第3轮：星辰大海vs王者荣耀', '2024年3月6日 15:30', '新区体育中心2号场', '邓超超、尉迟恭、令狐平', '2026-03-06 10:00:00', '2022010010043', '邓超超', '王者荣耀', 'CP2023004', '王志刚', '是', '');
INSERT INTO `bisaibaoming` VALUES (49, '2026-01-29 08:15:50', '1/4决赛：烈焰冲锋队vs传奇之路', '2024年3月15日 14:00', '市体育中心主馆', '张浩然、欧阳旭日、司马长空', '2026-03-15 10:00:00', '2022010010001', '张浩然', '烈焰冲锋队', 'CP2023001', '赵铁面', '是', '');
INSERT INTO `bisaibaoming` VALUES (50, '2026-01-29 08:15:50', '1/4决赛：烈焰冲锋队vs传奇之路', '2024年3月15日 14:00', '市体育中心主馆', '赵丽颖、诸葛芸芸、独孤静', '2026-03-15 10:00:00', '2022010010046', '赵丽颖', '传奇之路', 'CP2023001', '赵铁面', '是', '');
INSERT INTO `bisaibaoming` VALUES (51, '2026-01-29 08:15:50', '1/4决赛：元气满满队vs逆风翻盘队', '2024年3月15日 16:00', '市体育中心主馆', '赵子龙、公孙离离、司马光耀', '2026-03-15 10:00:00', '2022010010019', '赵子龙', '元气满满队', 'CP2023002', '冯雷', '是', '');
INSERT INTO `bisaibaoming` VALUES (52, '2026-01-29 08:15:50', '1/4决赛：元气满满队vs逆风翻盘队', '2024年3月15日 16:00', '市体育中心主馆', '吴彦祖、令狐冲冲、慕容复', '2026-03-15 10:00:00', '2022010010028', '吴彦祖', '逆风翻盘队', 'CP2023002', '冯雷', '是', '');
INSERT INTO `bisaibaoming` VALUES (53, '2026-01-29 08:15:50', '1/4决赛：燃烧吧少年vs超能陆战队', '2024年3月16日 14:00', '市体育中心主馆', '周杰伦、尉迟敬德、东方不败', '2026-03-16 10:00:00', '2022010010025', '周杰伦', '燃烧吧少年', 'CP2023003', '张明远', '是', '');
INSERT INTO `bisaibaoming` VALUES (54, '2026-01-29 08:15:50', '1/4决赛：燃烧吧少年vs超能陆战队', '2024年3月16日 14:00', '市体育中心主馆', '慕容紫英、诸葛大力、上官婉儿', '2026-03-16 10:00:00', '2022010010016', '慕容紫英', '超能陆战队', 'CP2023003', '张明远', '是', '');
INSERT INTO `bisaibaoming` VALUES (55, '2026-01-29 08:15:50', '1/4决赛：王者荣耀vs无限火力队', '2024年3月16日 16:00', '市体育中心主馆', '邓超超、尉迟恭、令狐平', '2026-03-16 10:00:00', '2022010010043', '邓超超', '王者荣耀', 'CP2023004', '王志刚', '是', '');
INSERT INTO `bisaibaoming` VALUES (56, '2026-01-29 08:15:50', '1/4决赛：王者荣耀vs无限火力队', '2024年3月16日 16:00', '市体育中心主馆', '王伟泽、欧阳震华、慕容冲', '2026-03-16 10:00:00', '2022010010007', '王伟泽', '无限火力队', 'CP2023004', '王志刚', '是', '');
INSERT INTO `bisaibaoming` VALUES (57, '2026-01-29 08:15:50', '半决赛：传奇之路vs元气满满队', '2024年3月22日 14:00', '市体育中心主馆', '赵丽颖、诸葛芸芸、独孤静', '2026-03-22 10:00:00', '2022010010046', '赵丽颖', '传奇之路', 'CP2023001', '赵铁面', '是', '');
INSERT INTO `bisaibaoming` VALUES (58, '2026-01-29 08:15:50', '半决赛：传奇之路vs元气满满队', '2024年3月22日 14:00', '市体育中心主馆', '赵子龙、公孙离离、司马光耀', '2026-03-22 10:00:00', '2022010010019', '赵子龙', '元气满满队', 'CP2023001', '赵铁面', '是', '');
INSERT INTO `bisaibaoming` VALUES (59, '2026-01-29 08:15:50', '半决赛：燃烧吧少年vs王者荣耀', '2024年3月22日 16:00', '市体育中心主馆', '周杰伦、尉迟敬德、东方不败', '2026-03-22 10:00:00', '2022010010025', '周杰伦', '燃烧吧少年', 'CP2023002', '冯雷', '是', '');
INSERT INTO `bisaibaoming` VALUES (60, '2026-01-29 08:15:50', '半决赛：燃烧吧少年vs王者荣耀', '2024年3月22日 16:00', '市体育中心主馆', '邓超超、尉迟恭、令狐平', '2026-03-22 10:00:00', '2022010010043', '邓超超', '王者荣耀', 'CP2023002', '冯雷', '是', '');
INSERT INTO `bisaibaoming` VALUES (61, '2026-01-29 08:15:50', '季军赛：传奇之路vs燃烧吧少年', '2024年3月29日 14:00', '市体育中心主馆', '赵丽颖、诸葛芸芸、独孤静', '2026-03-29 10:00:00', '2022010010046', '赵丽颖', '传奇之路', 'CP2023001', '赵铁面', '是', '');
INSERT INTO `bisaibaoming` VALUES (62, '2026-01-29 08:15:50', '季军赛：传奇之路vs燃烧吧少年', '2024年3月29日 14:00', '市体育中心主馆', '周杰伦、尉迟敬德、东方不败', '2026-03-29 10:00:00', '2022010010025', '周杰伦', '燃烧吧少年', 'CP2023001', '赵铁面', '是', '');
INSERT INTO `bisaibaoming` VALUES (63, '2026-01-29 08:15:50', '总决赛：元气满满队vs王者荣耀', '2024年3月29日 16:00', '市体育中心主馆', '赵子龙、公孙离离、司马光耀', '2026-03-29 10:00:00', '2022010010019', '赵子龙', '元气满满队', 'CP2023002', '冯雷', '是', '');
INSERT INTO `bisaibaoming` VALUES (64, '2026-01-29 08:15:50', '总决赛：元气满满队vs王者荣耀', '2024年3月29日 16:00', '市体育中心主馆', '邓超超、尉迟恭、令狐平', '2026-03-29 10:00:00', '2022010010043', '邓超超', '王者荣耀', 'CP2023002', '冯雷', '是', '');

-- ----------------------------
-- Table structure for bisaichengji
-- ----------------------------
DROP TABLE IF EXISTS `bisaichengji`;
CREATE TABLE `bisaichengji`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `saishimingcheng` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '赛事名称',
  `bisaichangdi` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '比赛场地',
  `bisaishijian` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '比赛时间',
  `qiuduimingcheng` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '球队名称',
  `qiuduijifen` int(11) NULL DEFAULT NULL COMMENT '球队积分',
  `bisaipaiming` int(11) NULL DEFAULT NULL COMMENT '比赛排名',
  `chengjibifen` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '成绩比分',
  `bisaijieguo` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '比赛结果',
  `teshushijian` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '特殊事件',
  `panfashuoming` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '判罚说明',
  `fabushijian` date NULL DEFAULT NULL COMMENT '发布时间',
  `caipanzhanghao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '裁判账号',
  `caipanxingming` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '裁判姓名',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 65 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '比赛成绩' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of bisaichengji
-- ----------------------------
INSERT INTO `bisaichengji` VALUES (1, '2026-01-29 08:15:50', 'A组第1轮：烈焰冲锋队vs极速闪电团', '中心体育馆1号场', '2024年3月1日 14:00', '烈焰冲锋队', 3, 1, '21:19', '胜', '', '正常', '2024-03-01', 'CP2023001', '赵铁面');
INSERT INTO `bisaichengji` VALUES (2, '2026-01-29 08:15:50', 'A组第1轮：烈焰冲锋队vs极速闪电团', '中心体育馆1号场', '2024年3月1日 14:00', '极速闪电团', 0, 2, '19:21', '负', '', '正常', '2024-03-01', 'CP2023001', '赵铁面');
INSERT INTO `bisaichengji` VALUES (3, '2026-01-29 08:15:50', 'A组第1轮：无限火力队vs青春风暴', '中心体育馆2号场', '2024年3月1日 15:30', '无限火力队', 3, 1, '20:15', '胜', '', '正常', '2024-03-01', 'CP2023002', '冯雷');
INSERT INTO `bisaichengji` VALUES (4, '2026-01-29 08:15:50', 'A组第1轮：无限火力队vs青春风暴', '中心体育馆2号场', '2024年3月1日 15:30', '青春风暴', 0, 2, '15:20', '负', '', '正常', '2024-03-01', 'CP2023002', '冯雷');
INSERT INTO `bisaichengji` VALUES (5, '2026-01-29 08:15:50', 'A组第2轮：烈焰冲锋队vs无限火力队', '中心体育馆1号场', '2024年3月2日 14:00', '无限火力队', 3, 1, '19:17', '胜', '', '正常', '2024-03-02', 'CP2023003', '张明远');
INSERT INTO `bisaichengji` VALUES (6, '2026-01-29 08:15:50', 'A组第2轮：烈焰冲锋队vs无限火力队', '中心体育馆1号场', '2024年3月2日 14:00', '烈焰冲锋队', 0, 2, '17:19', '负', '', '正常', '2024-03-02', 'CP2023003', '张明远');
INSERT INTO `bisaichengji` VALUES (7, '2026-01-29 08:15:50', 'A组第2轮：极速闪电团vs青春风暴', '中心体育馆2号场', '2024年3月2日 15:30', '极速闪电团', 3, 1, '21:18', '胜', '', '正常', '2024-03-02', 'CP2023004', '王志刚');
INSERT INTO `bisaichengji` VALUES (8, '2026-01-29 08:15:50', 'A组第2轮：极速闪电团vs青春风暴', '中心体育馆2号场', '2024年3月2日 15:30', '青春风暴', 0, 2, '18:21', '负', '', '正常', '2024-03-02', 'CP2023004', '王志刚');
INSERT INTO `bisaichengji` VALUES (9, '2026-01-29 08:15:50', 'A组第3轮：烈焰冲锋队vs青春风暴', '中心体育馆1号场', '2024年3月3日 14:00', '烈焰冲锋队', 3, 1, '22:16', '胜', '', '正常', '2024-03-03', 'CP2023005', '孙公正');
INSERT INTO `bisaichengji` VALUES (10, '2026-01-29 08:15:50', 'A组第3轮：烈焰冲锋队vs青春风暴', '中心体育馆1号场', '2024年3月3日 14:00', '青春风暴', 0, 2, '16:22', '负', '', '正常', '2024-03-03', 'CP2023005', '孙公正');
INSERT INTO `bisaichengji` VALUES (11, '2026-01-29 08:15:50', 'A组第3轮：极速闪电团vs无限火力队', '中心体育馆2号场', '2024年3月3日 15:30', '无限火力队', 3, 1, '18:16', '胜', '', '正常', '2024-03-03', 'CP2023006', '吴浩然');
INSERT INTO `bisaichengji` VALUES (12, '2026-01-29 08:15:50', 'A组第3轮：极速闪电团vs无限火力队', '中心体育馆2号场', '2024年3月3日 15:30', '极速闪电团', 0, 2, '16:18', '负', '', '正常', '2024-03-03', 'CP2023006', '吴浩然');
INSERT INTO `bisaichengji` VALUES (13, '2026-01-29 08:15:50', 'B组第1轮：快乐星球vs超能陆战队', '体育中心3号场', '2024年3月1日 14:00', '超能陆战队', 3, 1, '20:18', '胜', '', '正常', '2024-03-01', 'CP2023007', '郑直');
INSERT INTO `bisaichengji` VALUES (14, '2026-01-29 08:15:50', 'B组第1轮：快乐星球vs超能陆战队', '体育中心3号场', '2024年3月1日 14:00', '快乐星球', 0, 2, '18:20', '负', '', '正常', '2024-03-01', 'CP2023007', '郑直');
INSERT INTO `bisaichengji` VALUES (15, '2026-01-29 08:15:50', 'B组第1轮：元气满满队vs进击的巨人', '体育中心4号场', '2024年3月1日 15:30', '元气满满队', 3, 1, '21:17', '胜', '', '正常', '2024-03-01', 'CP2023008', '李雪梅');
INSERT INTO `bisaichengji` VALUES (16, '2026-01-29 08:15:50', 'B组第1轮：元气满满队vs进击的巨人', '体育中心4号场', '2024年3月1日 15:30', '进击的巨人', 0, 2, '17:21', '负', '', '正常', '2024-03-01', 'CP2023008', '李雪梅');
INSERT INTO `bisaichengji` VALUES (17, '2026-01-29 08:15:50', 'B组第2轮：快乐星球vs元气满满队', '体育中心3号场', '2024年3月2日 14:00', '元气满满队', 3, 1, '19:17', '胜', '', '正常', '2024-03-02', 'CP2023009', '周杰');
INSERT INTO `bisaichengji` VALUES (18, '2026-01-29 08:15:50', 'B组第2轮：快乐星球vs元气满满队', '体育中心3号场', '2024年3月2日 14:00', '快乐星球', 0, 2, '17:19', '负', '', '正常', '2024-03-02', 'CP2023009', '周杰');
INSERT INTO `bisaichengji` VALUES (19, '2026-01-29 08:15:50', 'B组第2轮：超能陆战队vs进击的巨人', '体育中心4号场', '2024年3月2日 15:30', '超能陆战队', 3, 1, '18:16', '胜', '', '正常', '2024-03-02', 'CP2023010', '陈平');
INSERT INTO `bisaichengji` VALUES (20, '2026-01-29 08:15:50', 'B组第2轮：超能陆战队vs进击的巨人', '体育中心4号场', '2024年3月2日 15:30', '进击的巨人', 0, 2, '16:18', '负', '', '正常', '2024-03-02', 'CP2023010', '陈平');
INSERT INTO `bisaichengji` VALUES (21, '2026-01-29 08:15:50', 'B组第3轮：快乐星球vs进击的巨人', '体育中心3号场', '2024年3月3日 14:00', '快乐星球', 3, 1, '21:18', '胜', '', '正常', '2024-03-03', 'CP2023001', '赵铁面');
INSERT INTO `bisaichengji` VALUES (22, '2026-01-29 08:15:50', 'B组第3轮：快乐星球vs进击的巨人', '体育中心3号场', '2024年3月3日 14:00', '进击的巨人', 0, 2, '18:21', '负', '', '正常', '2024-03-03', 'CP2023001', '赵铁面');
INSERT INTO `bisaichengji` VALUES (23, '2026-01-29 08:15:50', 'B组第3轮：超能陆战队vs元气满满队', '体育中心4号场', '2024年3月3日 15:30', '元气满满队', 3, 1, '21:17', '胜', '', '正常', '2024-03-03', 'CP2023002', '冯雷');
INSERT INTO `bisaichengji` VALUES (24, '2026-01-29 08:15:50', 'B组第3轮：超能陆战队vs元气满满队', '体育中心4号场', '2024年3月3日 15:30', '超能陆战队', 0, 2, '17:21', '负', '', '正常', '2024-03-03', 'CP2023002', '冯雷');
INSERT INTO `bisaichengji` VALUES (25, '2026-01-29 08:15:50', 'C组第1轮：燃烧吧少年vs逆风翻盘队', '大学城体育馆1号场', '2024年3月4日 14:00', '燃烧吧少年', 3, 1, '21:19', '胜', '', '正常', '2024-03-04', 'CP2023003', '张明远');
INSERT INTO `bisaichengji` VALUES (26, '2026-01-29 08:15:50', 'C组第1轮：燃烧吧少年vs逆风翻盘队', '大学城体育馆1号场', '2024年3月4日 14:00', '逆风翻盘队', 0, 2, '19:21', '负', '', '正常', '2024-03-04', 'CP2023003', '张明远');
INSERT INTO `bisaichengji` VALUES (27, '2026-01-29 08:15:50', 'C组第1轮：雷霆战将vs钢铁洪流', '大学城体育馆2号场', '2024年3月4日 15:30', '雷霆战将', 3, 1, '18:17', '胜', '', '正常', '2024-03-04', 'CP2023004', '王志刚');
INSERT INTO `bisaichengji` VALUES (28, '2026-01-29 08:15:50', 'C组第1轮：雷霆战将vs钢铁洪流', '大学城体育馆2号场', '2024年3月4日 15:30', '钢铁洪流', 0, 2, '17:18', '负', '', '正常', '2024-03-04', 'CP2023004', '王志刚');
INSERT INTO `bisaichengji` VALUES (29, '2026-01-29 08:15:50', 'C组第2轮：燃烧吧少年vs雷霆战将', '大学城体育馆1号场', '2024年3月5日 14:00', '燃烧吧少年', 3, 1, '21:19', '胜', '', '正常', '2024-03-05', 'CP2023005', '孙公正');
INSERT INTO `bisaichengji` VALUES (30, '2026-01-29 08:15:50', 'C组第2轮：燃烧吧少年vs雷霆战将', '大学城体育馆1号场', '2024年3月5日 14:00', '雷霆战将', 0, 2, '19:21', '负', '', '正常', '2024-03-05', 'CP2023005', '孙公正');
INSERT INTO `bisaichengji` VALUES (31, '2026-01-29 08:15:50', 'C组第2轮：逆风翻盘队vs钢铁洪流', '大学城体育馆2号场', '2024年3月5日 15:30', '逆风翻盘队', 3, 1, '20:18', '胜', '', '正常', '2024-03-05', 'CP2023006', '吴浩然');
INSERT INTO `bisaichengji` VALUES (32, '2026-01-29 08:15:50', 'C组第2轮：逆风翻盘队vs钢铁洪流', '大学城体育馆2号场', '2024年3月5日 15:30', '钢铁洪流', 0, 2, '18:20', '负', '', '正常', '2024-03-05', 'CP2023006', '吴浩然');
INSERT INTO `bisaichengji` VALUES (33, '2026-01-29 08:15:50', 'C组第3轮：燃烧吧少年vs钢铁洪流', '大学城体育馆1号场', '2024年3月6日 14:00', '燃烧吧少年', 3, 1, '20:17', '胜', '', '正常', '2024-03-06', 'CP2023007', '郑直');
INSERT INTO `bisaichengji` VALUES (34, '2026-01-29 08:15:50', 'C组第3轮：燃烧吧少年vs钢铁洪流', '大学城体育馆1号场', '2024年3月6日 14:00', '钢铁洪流', 0, 2, '17:20', '负', '', '正常', '2024-03-06', 'CP2023007', '郑直');
INSERT INTO `bisaichengji` VALUES (35, '2026-01-29 08:15:50', 'C组第3轮：逆风翻盘队vs雷霆战将', '大学城体育馆2号场', '2024年3月6日 15:30', '逆风翻盘队', 3, 1, '21:17', '胜', '', '正常', '2024-03-06', 'CP2023008', '李雪梅');
INSERT INTO `bisaichengji` VALUES (36, '2026-01-29 08:15:50', 'C组第3轮：逆风翻盘队vs雷霆战将', '大学城体育馆2号场', '2024年3月6日 15:30', '雷霆战将', 0, 2, '17:21', '负', '', '正常', '2024-03-06', 'CP2023008', '李雪梅');
INSERT INTO `bisaichengji` VALUES (37, '2026-01-29 08:15:50', 'D组第1轮：梦想起航vs星辰大海', '新区体育中心1号场', '2024年3月4日 14:00', '梦想起航', 3, 1, '21:19', '胜', '', '正常', '2024-03-04', 'CP2023009', '周杰');
INSERT INTO `bisaichengji` VALUES (38, '2026-01-29 08:15:50', 'D组第1轮：梦想起航vs星辰大海', '新区体育中心1号场', '2024年3月4日 14:00', '星辰大海', 0, 2, '19:21', '负', '', '正常', '2024-03-04', 'CP2023009', '周杰');
INSERT INTO `bisaichengji` VALUES (39, '2026-01-29 08:15:50', 'D组第1轮：王者荣耀vs传奇之路', '新区体育中心2号场', '2024年3月4日 15:30', '王者荣耀', 3, 1, '21:18', '胜', '', '正常', '2024-03-04', 'CP2023010', '陈平');
INSERT INTO `bisaichengji` VALUES (40, '2026-01-29 08:15:50', 'D组第1轮：王者荣耀vs传奇之路', '新区体育中心2号场', '2024年3月4日 15:30', '传奇之路', 0, 2, '18:21', '负', '', '正常', '2024-03-04', 'CP2023010', '陈平');
INSERT INTO `bisaichengji` VALUES (41, '2026-01-29 08:15:50', 'D组第2轮：梦想起航vs王者荣耀', '新区体育中心1号场', '2024年3月5日 14:00', '王者荣耀', 3, 1, '20:18', '胜', '', '正常', '2024-03-05', 'CP2023001', '赵铁面');
INSERT INTO `bisaichengji` VALUES (42, '2026-01-29 08:15:50', 'D组第2轮：梦想起航vs王者荣耀', '新区体育中心1号场', '2024年3月5日 14:00', '梦想起航', 0, 2, '18:20', '负', '', '正常', '2024-03-05', 'CP2023001', '赵铁面');
INSERT INTO `bisaichengji` VALUES (43, '2026-01-29 08:15:50', 'D组第2轮：星辰大海vs传奇之路', '新区体育中心2号场', '2024年3月5日 15:30', '星辰大海', 3, 1, '20:19', '胜', '', '正常', '2024-03-05', 'CP2023002', '冯雷');
INSERT INTO `bisaichengji` VALUES (44, '2026-01-29 08:15:50', 'D组第2轮：星辰大海vs传奇之路', '新区体育中心2号场', '2024年3月5日 15:30', '传奇之路', 0, 2, '19:20', '负', '', '正常', '2024-03-05', 'CP2023002', '冯雷');
INSERT INTO `bisaichengji` VALUES (45, '2026-01-29 08:15:50', 'D组第3轮：梦想起航vs传奇之路', '新区体育中心1号场', '2024年3月6日 14:00', '传奇之路', 3, 1, '21:18', '胜', '', '正常', '2024-03-06', 'CP2023003', '张明远');
INSERT INTO `bisaichengji` VALUES (46, '2026-01-29 08:15:50', 'D组第3轮：梦想起航vs传奇之路', '新区体育中心1号场', '2024年3月6日 14:00', '梦想起航', 0, 2, '18:21', '负', '', '正常', '2024-03-06', 'CP2023003', '张明远');
INSERT INTO `bisaichengji` VALUES (47, '2026-01-29 08:15:50', 'D组第3轮：星辰大海vs王者荣耀', '新区体育中心2号场', '2024年3月6日 15:30', '王者荣耀', 3, 1, '20:18', '胜', '', '正常', '2024-03-06', 'CP2023004', '王志刚');
INSERT INTO `bisaichengji` VALUES (48, '2026-01-29 08:15:50', 'D组第3轮：星辰大海vs王者荣耀', '新区体育中心2号场', '2024年3月6日 15:30', '星辰大海', 0, 2, '18:20', '负', '', '正常', '2024-03-06', 'CP2023004', '王志刚');
INSERT INTO `bisaichengji` VALUES (49, '2026-01-29 08:15:50', '1/4决赛：烈焰冲锋队vs传奇之路', '市体育中心主馆', '2024年3月15日 14:00', '传奇之路', 3, 1, '21:19', '胜', '黑马爆冷', '正常', '2024-03-15', 'CP2023001', '赵铁面');
INSERT INTO `bisaichengji` VALUES (50, '2026-01-29 08:15:50', '1/4决赛：烈焰冲锋队vs传奇之路', '市体育中心主馆', '2024年3月15日 14:00', '烈焰冲锋队', 0, 2, '19:21', '负', '黑马爆冷', '正常', '2024-03-15', 'CP2023001', '赵铁面');
INSERT INTO `bisaichengji` VALUES (51, '2026-01-29 08:15:50', '1/4决赛：元气满满队vs逆风翻盘队', '市体育中心主馆', '2024年3月15日 16:00', '元气满满队', 3, 1, '22:18', '胜', '', '正常', '2024-03-15', 'CP2023002', '冯雷');
INSERT INTO `bisaichengji` VALUES (52, '2026-01-29 08:15:50', '1/4决赛：元气满满队vs逆风翻盘队', '市体育中心主馆', '2024年3月15日 16:00', '逆风翻盘队', 0, 2, '18:22', '负', '', '正常', '2024-03-15', 'CP2023002', '冯雷');
INSERT INTO `bisaichengji` VALUES (53, '2026-01-29 08:15:50', '1/4决赛：燃烧吧少年vs超能陆战队', '市体育中心主馆', '2024年3月16日 14:00', '燃烧吧少年', 3, 1, '21:17', '胜', '', '正常', '2024-03-16', 'CP2023003', '张明远');
INSERT INTO `bisaichengji` VALUES (54, '2026-01-29 08:15:50', '1/4决赛：燃烧吧少年vs超能陆战队', '市体育中心主馆', '2024年3月16日 14:00', '超能陆战队', 0, 2, '17:21', '负', '', '正常', '2024-03-16', 'CP2023003', '张明远');
INSERT INTO `bisaichengji` VALUES (55, '2026-01-29 08:15:50', '1/4决赛：王者荣耀vs无限火力队', '市体育中心主馆', '2024年3月16日 16:00', '王者荣耀', 3, 1, '20:17', '胜', '', '正常', '2024-03-16', 'CP2023004', '王志刚');
INSERT INTO `bisaichengji` VALUES (56, '2026-01-29 08:15:50', '1/4决赛：王者荣耀vs无限火力队', '市体育中心主馆', '2024年3月16日 16:00', '无限火力队', 0, 2, '17:20', '负', '', '正常', '2024-03-16', 'CP2023004', '王志刚');
INSERT INTO `bisaichengji` VALUES (57, '2026-01-29 08:15:50', '半决赛：传奇之路vs元气满满队', '市体育中心主馆', '2024年3月22日 14:00', '元气满满队', 3, 1, '21:18', '胜', '', '正常', '2024-03-22', 'CP2023001', '赵铁面');
INSERT INTO `bisaichengji` VALUES (58, '2026-01-29 08:15:50', '半决赛：传奇之路vs元气满满队', '市体育中心主馆', '2024年3月22日 14:00', '传奇之路', 0, 2, '18:21', '负', '', '正常', '2024-03-22', 'CP2023001', '赵铁面');
INSERT INTO `bisaichengji` VALUES (59, '2026-01-29 08:15:50', '半决赛：燃烧吧少年vs王者荣耀', '市体育中心主馆', '2024年3月22日 16:00', '王者荣耀', 3, 1, '20:19', '胜', '绝杀', '正常', '2024-03-22', 'CP2023002', '冯雷');
INSERT INTO `bisaichengji` VALUES (60, '2026-01-29 08:15:50', '半决赛：燃烧吧少年vs王者荣耀', '市体育中心主馆', '2024年3月22日 16:00', '燃烧吧少年', 0, 2, '19:20', '负', '绝杀', '正常', '2024-03-22', 'CP2023002', '冯雷');
INSERT INTO `bisaichengji` VALUES (61, '2026-01-29 08:15:50', '季军赛：传奇之路vs燃烧吧少年', '市体育中心主馆', '2024年3月29日 14:00', '传奇之路', 3, 1, '21:19', '胜', '季军', '正常', '2024-03-29', 'CP2023001', '赵铁面');
INSERT INTO `bisaichengji` VALUES (62, '2026-01-29 08:15:50', '季军赛：传奇之路vs燃烧吧少年', '市体育中心主馆', '2024年3月29日 14:00', '燃烧吧少年', 0, 2, '19:21', '负', '季军', '正常', '2024-03-29', 'CP2023001', '赵铁面');
INSERT INTO `bisaichengji` VALUES (63, '2026-01-29 08:15:50', '总决赛：元气满满队vs王者荣耀', '市体育中心主馆', '2024年3月29日 16:00', '王者荣耀', 3, 1, '21:19', '胜', '冠军', '正常', '2024-03-29', 'CP2023002', '冯雷');
INSERT INTO `bisaichengji` VALUES (64, '2026-01-29 08:15:50', '总决赛：元气满满队vs王者荣耀', '市体育中心主馆', '2024年3月29日 16:00', '元气满满队', 0, 2, '19:21', '负', '亚军', '正常', '2024-03-29', 'CP2023002', '冯雷');

-- ----------------------------
-- Table structure for bisaijishutongji
-- ----------------------------
DROP TABLE IF EXISTS `bisaijishutongji`;
CREATE TABLE `bisaijishutongji`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `saishimingcheng` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '赛事名称',
  `bisaishijian` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '比赛时间',
  `bisaichangdi` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '比赛场地',
  `qiuduimingcheng` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '球队名称',
  `defen` int(11) NULL DEFAULT NULL COMMENT '得分',
  `fangui` int(11) NULL DEFAULT NULL COMMENT '犯规',
  `zanting` int(11) NULL DEFAULT NULL COMMENT '暂停',
  `jilushijian` datetime NULL DEFAULT NULL COMMENT '记录时间',
  `caipanzhanghao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '裁判账号',
  `caipanxingming` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '裁判姓名',
  `crossuserid` bigint(20) NULL DEFAULT NULL COMMENT '跨表用户id',
  `crossrefid` bigint(20) NULL DEFAULT NULL COMMENT '跨表主键id',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 65 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '比赛技术统计' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of bisaijishutongji
-- ----------------------------
INSERT INTO `bisaijishutongji` VALUES (1, '2026-01-29 08:15:50', 'A组第1轮：烈焰冲锋队vs极速闪电团', '2024年3月1日 14:00', '中心体育馆1号场', '烈焰冲锋队', 21, 8, 2, '2024-03-01 14:30:00', 'CP2023001', '赵铁面', 1, 1);
INSERT INTO `bisaijishutongji` VALUES (2, '2026-01-29 08:15:50', 'A组第1轮：烈焰冲锋队vs极速闪电团', '2024年3月1日 14:00', '中心体育馆1号场', '极速闪电团', 19, 10, 1, '2024-03-01 14:30:00', 'CP2023001', '赵铁面', 1, 2);
INSERT INTO `bisaijishutongji` VALUES (3, '2026-01-29 08:15:50', 'A组第1轮：无限火力队vs青春风暴', '2024年3月1日 15:30', '中心体育馆2号场', '无限火力队', 20, 7, 1, '2024-03-01 16:00:00', 'CP2023002', '冯雷', 2, 1);
INSERT INTO `bisaijishutongji` VALUES (4, '2026-01-29 08:15:50', 'A组第1轮：无限火力队vs青春风暴', '2024年3月1日 15:30', '中心体育馆2号场', '青春风暴', 15, 12, 2, '2024-03-01 16:00:00', 'CP2023002', '冯雷', 2, 2);
INSERT INTO `bisaijishutongji` VALUES (5, '2026-01-29 08:15:50', 'A组第2轮：烈焰冲锋队vs无限火力队', '2024年3月2日 14:00', '中心体育馆1号场', '无限火力队', 19, 9, 2, '2024-03-02 14:30:00', 'CP2023003', '张明远', 3, 1);
INSERT INTO `bisaijishutongji` VALUES (6, '2026-01-29 08:15:50', 'A组第2轮：烈焰冲锋队vs无限火力队', '2024年3月2日 14:00', '中心体育馆1号场', '烈焰冲锋队', 17, 11, 1, '2024-03-02 14:30:00', 'CP2023003', '张明远', 3, 2);
INSERT INTO `bisaijishutongji` VALUES (7, '2026-01-29 08:15:50', 'A组第2轮：极速闪电团vs青春风暴', '2024年3月2日 15:30', '中心体育馆2号场', '极速闪电团', 21, 8, 1, '2024-03-02 16:00:00', 'CP2023004', '王志刚', 4, 1);
INSERT INTO `bisaijishutongji` VALUES (8, '2026-01-29 08:15:50', 'A组第2轮：极速闪电团vs青春风暴', '2024年3月2日 15:30', '中心体育馆2号场', '青春风暴', 18, 10, 2, '2024-03-02 16:00:00', 'CP2023004', '王志刚', 4, 2);
INSERT INTO `bisaijishutongji` VALUES (9, '2026-01-29 08:15:50', 'A组第3轮：烈焰冲锋队vs青春风暴', '2024年3月3日 14:00', '中心体育馆1号场', '烈焰冲锋队', 22, 6, 1, '2024-03-03 14:30:00', 'CP2023005', '孙公正', 5, 1);
INSERT INTO `bisaijishutongji` VALUES (10, '2026-01-29 08:15:50', 'A组第3轮：烈焰冲锋队vs青春风暴', '2024年3月3日 14:00', '中心体育馆1号场', '青春风暴', 16, 13, 2, '2024-03-03 14:30:00', 'CP2023005', '孙公正', 5, 2);
INSERT INTO `bisaijishutongji` VALUES (11, '2026-01-29 08:15:50', 'A组第3轮：极速闪电团vs无限火力队', '2024年3月3日 15:30', '中心体育馆2号场', '无限火力队', 18, 9, 2, '2024-03-03 16:00:00', 'CP2023006', '吴浩然', 6, 1);
INSERT INTO `bisaijishutongji` VALUES (12, '2026-01-29 08:15:50', 'A组第3轮：极速闪电团vs无限火力队', '2024年3月3日 15:30', '中心体育馆2号场', '极速闪电团', 16, 10, 1, '2024-03-03 16:00:00', 'CP2023006', '吴浩然', 6, 2);
INSERT INTO `bisaijishutongji` VALUES (13, '2026-01-29 08:15:50', 'B组第1轮：快乐星球vs超能陆战队', '2024年3月1日 14:00', '体育中心3号场', '超能陆战队', 20, 8, 1, '2024-03-01 14:30:00', 'CP2023007', '郑直', 7, 1);
INSERT INTO `bisaijishutongji` VALUES (14, '2026-01-29 08:15:50', 'B组第1轮：快乐星球vs超能陆战队', '2024年3月1日 14:00', '体育中心3号场', '快乐星球', 18, 9, 2, '2024-03-01 14:30:00', 'CP2023007', '郑直', 7, 2);
INSERT INTO `bisaijishutongji` VALUES (15, '2026-01-29 08:15:50', 'B组第1轮：元气满满队vs进击的巨人', '2024年3月1日 15:30', '体育中心4号场', '元气满满队', 21, 7, 1, '2024-03-01 16:00:00', 'CP2023008', '李雪梅', 8, 1);
INSERT INTO `bisaijishutongji` VALUES (16, '2026-01-29 08:15:50', 'B组第1轮：元气满满队vs进击的巨人', '2024年3月1日 15:30', '体育中心4号场', '进击的巨人', 17, 11, 2, '2024-03-01 16:00:00', 'CP2023008', '李雪梅', 8, 2);
INSERT INTO `bisaijishutongji` VALUES (17, '2026-01-29 08:15:50', 'B组第2轮：快乐星球vs元气满满队', '2024年3月2日 14:00', '体育中心3号场', '元气满满队', 19, 8, 1, '2024-03-02 14:30:00', 'CP2023009', '周杰', 9, 1);
INSERT INTO `bisaijishutongji` VALUES (18, '2026-01-29 08:15:50', 'B组第2轮：快乐星球vs元气满满队', '2024年3月2日 14:00', '体育中心3号场', '快乐星球', 17, 10, 2, '2024-03-02 14:30:00', 'CP2023009', '周杰', 9, 2);
INSERT INTO `bisaijishutongji` VALUES (19, '2026-01-29 08:15:50', 'B组第2轮：超能陆战队vs进击的巨人', '2024年3月2日 15:30', '体育中心4号场', '超能陆战队', 18, 9, 1, '2024-03-02 16:00:00', 'CP2023010', '陈平', 10, 1);
INSERT INTO `bisaijishutongji` VALUES (20, '2026-01-29 08:15:50', 'B组第2轮：超能陆战队vs进击的巨人', '2024年3月2日 15:30', '体育中心4号场', '进击的巨人', 16, 11, 2, '2024-03-02 16:00:00', 'CP2023010', '陈平', 10, 2);
INSERT INTO `bisaijishutongji` VALUES (21, '2026-01-29 08:15:50', 'B组第3轮：快乐星球vs进击的巨人', '2024年3月3日 14:00', '体育中心3号场', '快乐星球', 21, 7, 1, '2024-03-03 14:30:00', 'CP2023001', '赵铁面', 11, 1);
INSERT INTO `bisaijishutongji` VALUES (22, '2026-01-29 08:15:50', 'B组第3轮：快乐星球vs进击的巨人', '2024年3月3日 14:00', '体育中心3号场', '进击的巨人', 18, 10, 2, '2024-03-03 14:30:00', 'CP2023001', '赵铁面', 11, 2);
INSERT INTO `bisaijishutongji` VALUES (23, '2026-01-29 08:15:50', 'B组第3轮：超能陆战队vs元气满满队', '2024年3月3日 15:30', '体育中心4号场', '元气满满队', 21, 8, 1, '2024-03-03 16:00:00', 'CP2023002', '冯雷', 12, 1);
INSERT INTO `bisaijishutongji` VALUES (24, '2026-01-29 08:15:50', 'B组第3轮：超能陆战队vs元气满满队', '2024年3月3日 15:30', '体育中心4号场', '超能陆战队', 17, 9, 2, '2024-03-03 16:00:00', 'CP2023002', '冯雷', 12, 2);
INSERT INTO `bisaijishutongji` VALUES (25, '2026-01-29 08:15:50', 'C组第1轮：燃烧吧少年vs逆风翻盘队', '2024年3月4日 14:00', '大学城体育馆1号场', '燃烧吧少年', 21, 8, 1, '2024-03-04 14:30:00', 'CP2023003', '张明远', 13, 1);
INSERT INTO `bisaijishutongji` VALUES (26, '2026-01-29 08:15:50', 'C组第1轮：燃烧吧少年vs逆风翻盘队', '2024年3月4日 14:00', '大学城体育馆1号场', '逆风翻盘队', 19, 10, 2, '2024-03-04 14:30:00', 'CP2023003', '张明远', 13, 2);
INSERT INTO `bisaijishutongji` VALUES (27, '2026-01-29 08:15:50', 'C组第1轮：雷霆战将vs钢铁洪流', '2024年3月4日 15:30', '大学城体育馆2号场', '雷霆战将', 18, 9, 1, '2024-03-04 16:00:00', 'CP2023004', '王志刚', 14, 1);
INSERT INTO `bisaijishutongji` VALUES (28, '2026-01-29 08:15:50', 'C组第1轮：雷霆战将vs钢铁洪流', '2024年3月4日 15:30', '大学城体育馆2号场', '钢铁洪流', 17, 10, 2, '2024-03-04 16:00:00', 'CP2023004', '王志刚', 14, 2);
INSERT INTO `bisaijishutongji` VALUES (29, '2026-01-29 08:15:50', 'C组第2轮：燃烧吧少年vs雷霆战将', '2024年3月5日 14:00', '大学城体育馆1号场', '燃烧吧少年', 21, 7, 1, '2024-03-05 14:30:00', 'CP2023005', '孙公正', 15, 1);
INSERT INTO `bisaijishutongji` VALUES (30, '2026-01-29 08:15:50', 'C组第2轮：燃烧吧少年vs雷霆战将', '2024年3月5日 14:00', '大学城体育馆1号场', '雷霆战将', 19, 11, 2, '2024-03-05 14:30:00', 'CP2023005', '孙公正', 15, 2);
INSERT INTO `bisaijishutongji` VALUES (31, '2026-01-29 08:15:50', 'C组第2轮：逆风翻盘队vs钢铁洪流', '2024年3月5日 15:30', '大学城体育馆2号场', '逆风翻盘队', 20, 8, 1, '2024-03-05 16:00:00', 'CP2023006', '吴浩然', 16, 1);
INSERT INTO `bisaijishutongji` VALUES (32, '2026-01-29 08:15:50', 'C组第2轮：逆风翻盘队vs钢铁洪流', '2024年3月5日 15:30', '大学城体育馆2号场', '钢铁洪流', 18, 10, 2, '2024-03-05 16:00:00', 'CP2023006', '吴浩然', 16, 2);
INSERT INTO `bisaijishutongji` VALUES (33, '2026-01-29 08:15:50', 'C组第3轮：燃烧吧少年vs钢铁洪流', '2024年3月6日 14:00', '大学城体育馆1号场', '燃烧吧少年', 20, 8, 1, '2024-03-06 14:30:00', 'CP2023007', '郑直', 17, 1);
INSERT INTO `bisaijishutongji` VALUES (34, '2026-01-29 08:15:50', 'C组第3轮：燃烧吧少年vs钢铁洪流', '2024年3月6日 14:00', '大学城体育馆1号场', '钢铁洪流', 17, 11, 2, '2024-03-06 14:30:00', 'CP2023007', '郑直', 17, 2);
INSERT INTO `bisaijishutongji` VALUES (35, '2026-01-29 08:15:50', 'C组第3轮：逆风翻盘队vs雷霆战将', '2024年3月6日 15:30', '大学城体育馆2号场', '逆风翻盘队', 21, 7, 1, '2024-03-06 16:00:00', 'CP2023008', '李雪梅', 18, 1);
INSERT INTO `bisaijishutongji` VALUES (36, '2026-01-29 08:15:50', 'C组第3轮：逆风翻盘队vs雷霆战将', '2024年3月6日 15:30', '大学城体育馆2号场', '雷霆战将', 17, 12, 2, '2024-03-06 16:00:00', 'CP2023008', '李雪梅', 18, 2);
INSERT INTO `bisaijishutongji` VALUES (37, '2026-01-29 08:15:50', 'D组第1轮：梦想起航vs星辰大海', '2024年3月4日 14:00', '新区体育中心1号场', '梦想起航', 21, 8, 1, '2024-03-04 14:30:00', 'CP2023009', '周杰', 19, 1);
INSERT INTO `bisaijishutongji` VALUES (38, '2026-01-29 08:15:50', 'D组第1轮：梦想起航vs星辰大海', '2024年3月4日 14:00', '新区体育中心1号场', '星辰大海', 19, 10, 2, '2024-03-04 14:30:00', 'CP2023009', '周杰', 19, 2);
INSERT INTO `bisaijishutongji` VALUES (39, '2026-01-29 08:15:50', 'D组第1轮：王者荣耀vs传奇之路', '2024年3月4日 15:30', '新区体育中心2号场', '王者荣耀', 21, 7, 1, '2024-03-04 16:00:00', 'CP2023010', '陈平', 20, 1);
INSERT INTO `bisaijishutongji` VALUES (40, '2026-01-29 08:15:50', 'D组第1轮：王者荣耀vs传奇之路', '2024年3月4日 15:30', '新区体育中心2号场', '传奇之路', 18, 9, 2, '2024-03-04 16:00:00', 'CP2023010', '陈平', 20, 2);
INSERT INTO `bisaijishutongji` VALUES (41, '2026-01-29 08:15:50', 'D组第2轮：梦想起航vs王者荣耀', '2024年3月5日 14:00', '新区体育中心1号场', '王者荣耀', 20, 8, 1, '2024-03-05 14:30:00', 'CP2023001', '赵铁面', 21, 1);
INSERT INTO `bisaijishutongji` VALUES (42, '2026-01-29 08:15:50', 'D组第2轮：梦想起航vs王者荣耀', '2024年3月5日 14:00', '新区体育中心1号场', '梦想起航', 18, 10, 2, '2024-03-05 14:30:00', 'CP2023001', '赵铁面', 21, 2);
INSERT INTO `bisaijishutongji` VALUES (43, '2026-01-29 08:15:50', 'D组第2轮：星辰大海vs传奇之路', '2024年3月5日 15:30', '新区体育中心2号场', '星辰大海', 20, 9, 1, '2024-03-05 16:00:00', 'CP2023002', '冯雷', 22, 1);
INSERT INTO `bisaijishutongji` VALUES (44, '2026-01-29 08:15:50', 'D组第2轮：星辰大海vs传奇之路', '2024年3月5日 15:30', '新区体育中心2号场', '传奇之路', 19, 11, 2, '2024-03-05 16:00:00', 'CP2023002', '冯雷', 22, 2);
INSERT INTO `bisaijishutongji` VALUES (45, '2026-01-29 08:15:50', 'D组第3轮：梦想起航vs传奇之路', '2024年3月6日 14:00', '新区体育中心1号场', '传奇之路', 21, 8, 1, '2024-03-06 14:30:00', 'CP2023003', '张明远', 23, 1);
INSERT INTO `bisaijishutongji` VALUES (46, '2026-01-29 08:15:50', 'D组第3轮：梦想起航vs传奇之路', '2024年3月6日 14:00', '新区体育中心1号场', '梦想起航', 18, 10, 2, '2024-03-06 14:30:00', 'CP2023003', '张明远', 23, 2);
INSERT INTO `bisaijishutongji` VALUES (47, '2026-01-29 08:15:50', 'D组第3轮：星辰大海vs王者荣耀', '2024年3月6日 15:30', '新区体育中心2号场', '王者荣耀', 20, 7, 1, '2024-03-06 16:00:00', 'CP2023004', '王志刚', 24, 1);
INSERT INTO `bisaijishutongji` VALUES (48, '2026-01-29 08:15:50', 'D组第3轮：星辰大海vs王者荣耀', '2024年3月6日 15:30', '新区体育中心2号场', '星辰大海', 18, 11, 2, '2024-03-06 16:00:00', 'CP2023004', '王志刚', 24, 2);
INSERT INTO `bisaijishutongji` VALUES (49, '2026-01-29 08:15:50', '1/4决赛：烈焰冲锋队vs传奇之路', '2024年3月15日 14:00', '市体育中心主馆', '传奇之路', 21, 9, 1, '2024-03-15 14:30:00', 'CP2023001', '赵铁面', 25, 1);
INSERT INTO `bisaijishutongji` VALUES (50, '2026-01-29 08:15:50', '1/4决赛：烈焰冲锋队vs传奇之路', '2024年3月15日 14:00', '市体育中心主馆', '烈焰冲锋队', 19, 10, 2, '2024-03-15 14:30:00', 'CP2023001', '赵铁面', 25, 2);
INSERT INTO `bisaijishutongji` VALUES (51, '2026-01-29 08:15:50', '1/4决赛：元气满满队vs逆风翻盘队', '2024年3月15日 16:00', '市体育中心主馆', '元气满满队', 22, 7, 1, '2024-03-15 16:30:00', 'CP2023002', '冯雷', 26, 1);
INSERT INTO `bisaijishutongji` VALUES (52, '2026-01-29 08:15:50', '1/4决赛：元气满满队vs逆风翻盘队', '2024年3月15日 16:00', '市体育中心主馆', '逆风翻盘队', 18, 11, 2, '2024-03-15 16:30:00', 'CP2023002', '冯雷', 26, 2);
INSERT INTO `bisaijishutongji` VALUES (53, '2026-01-29 08:15:50', '1/4决赛：燃烧吧少年vs超能陆战队', '2024年3月16日 14:00', '市体育中心主馆', '燃烧吧少年', 21, 8, 1, '2024-03-16 14:30:00', 'CP2023003', '张明远', 27, 1);
INSERT INTO `bisaijishutongji` VALUES (54, '2026-01-29 08:15:50', '1/4决赛：燃烧吧少年vs超能陆战队', '2024年3月16日 14:00', '市体育中心主馆', '超能陆战队', 17, 10, 2, '2024-03-16 14:30:00', 'CP2023003', '张明远', 27, 2);
INSERT INTO `bisaijishutongji` VALUES (55, '2026-01-29 08:15:50', '1/4决赛：王者荣耀vs无限火力队', '2024年3月16日 16:00', '市体育中心主馆', '王者荣耀', 20, 8, 1, '2024-03-16 16:30:00', 'CP2023004', '王志刚', 28, 1);
INSERT INTO `bisaijishutongji` VALUES (56, '2026-01-29 08:15:50', '1/4决赛：王者荣耀vs无限火力队', '2024年3月16日 16:00', '市体育中心主馆', '无限火力队', 17, 11, 2, '2024-03-16 16:30:00', 'CP2023004', '王志刚', 28, 2);
INSERT INTO `bisaijishutongji` VALUES (57, '2026-01-29 08:15:50', '半决赛：传奇之路vs元气满满队', '2024年3月22日 14:00', '市体育中心主馆', '元气满满队', 21, 7, 1, '2024-03-22 14:30:00', 'CP2023001', '赵铁面', 29, 1);
INSERT INTO `bisaijishutongji` VALUES (58, '2026-01-29 08:15:50', '半决赛：传奇之路vs元气满满队', '2024年3月22日 14:00', '市体育中心主馆', '传奇之路', 18, 10, 2, '2024-03-22 14:30:00', 'CP2023001', '赵铁面', 29, 2);
INSERT INTO `bisaijishutongji` VALUES (59, '2026-01-29 08:15:50', '半决赛：燃烧吧少年vs王者荣耀', '2024年3月22日 16:00', '市体育中心主馆', '王者荣耀', 20, 8, 1, '2024-03-22 16:30:00', 'CP2023002', '冯雷', 30, 1);
INSERT INTO `bisaijishutongji` VALUES (60, '2026-01-29 08:15:50', '半决赛：燃烧吧少年vs王者荣耀', '2024年3月22日 16:00', '市体育中心主馆', '燃烧吧少年', 19, 9, 2, '2024-03-22 16:30:00', 'CP2023002', '冯雷', 30, 2);
INSERT INTO `bisaijishutongji` VALUES (61, '2026-01-29 08:15:50', '季军赛：传奇之路vs燃烧吧少年', '2024年3月29日 14:00', '市体育中心主馆', '传奇之路', 21, 8, 1, '2024-03-29 14:30:00', 'CP2023001', '赵铁面', 31, 1);
INSERT INTO `bisaijishutongji` VALUES (62, '2026-01-29 08:15:50', '季军赛：传奇之路vs燃烧吧少年', '2024年3月29日 14:00', '市体育中心主馆', '燃烧吧少年', 19, 10, 2, '2024-03-29 14:30:00', 'CP2023001', '赵铁面', 31, 2);
INSERT INTO `bisaijishutongji` VALUES (63, '2026-01-29 08:15:50', '总决赛：元气满满队vs王者荣耀', '2024年3月29日 16:00', '市体育中心主馆', '王者荣耀', 21, 7, 1, '2024-03-29 16:30:00', 'CP2023002', '冯雷', 32, 1);
INSERT INTO `bisaijishutongji` VALUES (64, '2026-01-29 08:15:50', '总决赛：元气满满队vs王者荣耀', '2024年3月29日 16:00', '市体育中心主馆', '元气满满队', 19, 9, 2, '2024-03-29 16:30:00', 'CP2023002', '冯雷', 32, 2);

-- ----------------------------
-- Table structure for caipanyuan
-- ----------------------------
DROP TABLE IF EXISTS `caipanyuan`;
CREATE TABLE `caipanyuan`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `caipanzhanghao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '裁判账号',
  `caipanxingming` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '裁判姓名',
  `mima` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '密码',
  `touxiang` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '头像',
  `xingbie` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '性别',
  `shoujihaoma` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '手机号码',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `caipanzhanghao`(`caipanzhanghao`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 11 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '裁判员' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of caipanyuan
-- ----------------------------
INSERT INTO `caipanyuan` VALUES (1, '2026-01-29 08:15:50', 'CP2023001', '赵铁面', '123456', 'file/cp_ (1).jpg', '男', '13900001001');
INSERT INTO `caipanyuan` VALUES (2, '2026-01-29 08:15:50', 'CP2023002', '冯雷', '123456', 'file/cp_ (2).jpg', '男', '13900001002');
INSERT INTO `caipanyuan` VALUES (3, '2026-01-29 08:15:50', 'CP2023003', '张明远', '123456', 'file/cp_ (3).jpg', '男', '13900001003');
INSERT INTO `caipanyuan` VALUES (4, '2026-01-29 08:15:50', 'CP2023004', '王志刚', '123456', 'file/cp_ (4).jpg', '男', '13900001004');
INSERT INTO `caipanyuan` VALUES (5, '2026-01-29 08:15:50', 'CP2023005', '孙公正', '123456', 'file/cp_ (5).jpg', '男', '13900001005');
INSERT INTO `caipanyuan` VALUES (6, '2026-01-29 08:15:50', 'CP2023006', '吴浩然', '123456', 'file/cp_ (6).jpg', '男', '13900001006');
INSERT INTO `caipanyuan` VALUES (7, '2026-01-29 08:15:50', 'CP2023007', '郑直', '123456', 'file/cp_ (7).jpg', '男', '13900001007');
INSERT INTO `caipanyuan` VALUES (8, '2026-01-29 08:15:50', 'CP2023008', '李雪梅', '123456', 'file/cp_ (8).jpg', '女', '13900001008');
INSERT INTO `caipanyuan` VALUES (9, '2026-01-29 08:15:50', 'CP2023009', '周杰', '123456', 'file/cp_ (9).jpg', '男', '13900001009');
INSERT INTO `caipanyuan` VALUES (10, '2026-01-29 08:15:50', 'CP2023010', '陈平', '123456', 'file/cp_ (10).jpg', '女', '13900001010');

-- ----------------------------
-- Table structure for cansaixuesheng
-- ----------------------------
DROP TABLE IF EXISTS `cansaixuesheng`;
CREATE TABLE `cansaixuesheng`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `xuehao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '学号',
  `xingming` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '姓名',
  `mima` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '密码',
  `xingbie` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '性别',
  `nianling` int(11) NULL DEFAULT NULL COMMENT '年龄',
  `touxiang` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '头像',
  `shouji` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '手机',
  `email` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '邮箱',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `xuehao`(`xuehao`) USING BTREE,
  UNIQUE INDEX `email`(`email`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 49 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '参赛学生' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of cansaixuesheng
-- ----------------------------
INSERT INTO `cansaixuesheng` VALUES (1, '2026-01-29 08:15:50', '2022010010001', '张浩然', '123456', '男', 20, 'file/1770010967003.jpg', '13800001001', 'zhanghr@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (2, '2026-01-29 08:15:50', '2022010010002', '欧阳旭日', '123456', '男', 19, 'file/1770011073349.jpg', '13800001002', 'ouyangxr@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (3, '2026-01-29 08:15:50', '2022010010003', '司马长空', '123456', '男', 21, 'file/1770011105674.jpg', '13800001003', 'simack@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (4, '2026-01-29 08:15:50', '2022010010004', '李梓涵', '123456', '男', 20, 'file/1770011132878.jpg', '13800001004', 'lizr@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (5, '2026-01-29 08:15:50', '2022010010005', '上官云珠', '123456', '女', 19, 'file/5.jpg', '13800001005', 'shanggyz@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (6, '2026-01-29 08:15:50', '2022010010006', '诸葛亮亮', '123456', '男', 20, 'file/6.jpg', '13800001006', 'zhugell@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (7, '2026-01-29 08:15:50', '2022010010007', '王伟泽', '123456', '男', 21, 'file/7.jpg', '13800001007', 'wangwz@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (8, '2026-01-29 08:15:50', '2022010010008', '欧阳震华', '123456', '男', 20, 'file/8.jpg', '13800001008', 'ouyangzh@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (9, '2026-01-29 08:15:50', '2022010010009', '慕容冲', '123456', '男', 19, 'file/9.jpg', '13800001009', 'murongc@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (10, '2026-01-29 08:15:50', '2022010010010', '刘诗诗', '123456', '女', 20, 'file/10.jpg', '13800001010', 'liuss@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (11, '2026-01-29 08:15:50', '2022010010011', '诸葛青云', '123456', '男', 21, 'file/11.jpg', '13800001011', 'zhugeqy@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (12, '2026-01-29 08:15:50', '2022010010012', '独孤雨柔', '123456', '女', 19, 'file/12.jpg', '13800001012', 'duguyr@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (13, '2026-01-29 08:15:50', '2022010010013', '陈明轩', '123456', '男', 20, 'file/13.jpg', '13800001013', 'chenmx@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (14, '2026-01-29 08:15:50', '2022010010014', '皇甫铁牛', '123456', '男', 21, 'file/14.jpg', '13800001014', 'huangftn@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (15, '2026-01-29 08:15:50', '2022010010015', '令狐飞', '123456', '男', 19, 'file/15.jpg', '13800001015', 'linghuf@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (16, '2026-01-29 08:15:50', '2022010010016', '慕容紫英', '123456', '女', 20, 'file/16.jpg', '13800001016', 'murongzy@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (17, '2026-01-29 08:15:50', '2022010010017', '诸葛大力', '123456', '男', 21, 'file/17.jpg', '13800001017', 'zhugedl@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (18, '2026-01-29 08:15:50', '2022010010018', '上官婉儿', '123456', '女', 19, 'file/18.jpg', '13800001018', 'shanggwe@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (19, '2026-01-29 08:15:50', '2022010010019', '赵子龙', '123456', '男', 20, 'file/19.jpg', '13800001019', 'zhaozl@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (20, '2026-01-29 08:15:50', '2022010010020', '公孙离离', '123456', '女', 21, 'file/20.jpg', '13800001020', 'gongsll@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (21, '2026-01-29 08:15:50', '2022010010021', '司马光耀', '123456', '男', 19, 'file/21.jpg', '13800001021', 'simagy@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (22, '2026-01-29 08:15:50', '2022010010022', '孙小美', '123456', '女', 20, 'file/22.jpg', '13800001022', 'sunxm@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (23, '2026-01-29 08:15:50', '2022010010023', '独孤求败', '123456', '男', 21, 'file/23.jpg', '13800001023', 'dugqub@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (24, '2026-01-29 08:15:50', '2022010010024', '欧阳娜娜', '123456', '女', 19, 'file/24.jpg', '13800001024', 'ouyangnn@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (25, '2026-01-29 08:15:50', '2022010010025', '周杰伦', '123456', '男', 20, 'file/25.jpg', '13800001025', 'zhoujl@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (26, '2026-01-29 08:15:50', '2022010010026', '尉迟敬德', '123456', '男', 21, 'file/26.jpg', '13800001026', 'yuchijd@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (27, '2026-01-29 08:15:50', '2022010010027', '东方不败', '123456', '男', 19, 'file/27.jpg', '13800001027', 'dongfb@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (28, '2026-01-29 08:15:50', '2022010010028', '吴彦祖', '123456', '男', 20, 'file/28.jpg', '13800001028', 'wuyz@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (29, '2026-01-29 08:15:50', '2022010010029', '令狐冲冲', '123456', '男', 21, 'file/29.jpg', '13800001029', 'linghucc@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (30, '2026-01-29 08:15:50', '2022010010030', '慕容复', '123456', '男', 19, 'file/30.jpg', '13800001030', 'murongf@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (31, '2026-01-29 08:15:50', '2022010010031', '郑爽爽', '123456', '女', 20, 'file/31.jpg', '13800001031', 'zhengss@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (32, '2026-01-29 08:15:50', '2022010010032', '上官飞燕', '123456', '女', 21, 'file/32.jpg', '13800001032', 'shanggfy@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (33, '2026-01-29 08:15:50', '2022010010033', '诸葛瑾瑾', '123456', '女', 19, 'file/33.jpg', '13800001033', 'zhugejj@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (34, '2026-01-29 08:15:50', '2022010010034', '林志颖', '123456', '男', 20, 'file/34.jpg', '13800001034', 'linzy@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (35, '2026-01-29 08:15:50', '2022010010035', '欧阳锋', '123456', '男', 21, 'file/35.jpg', '13800001035', 'ouyangf@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (36, '2026-01-29 08:15:50', '2022010010036', '司马昭', '123456', '男', 19, 'file/36.jpg', '13800001036', 'simaz@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (37, '2026-01-29 08:15:50', '2022010010037', '黄晓明', '123456', '男', 20, 'file/37.jpg', '13800001037', 'huangxm@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (38, '2026-01-29 08:15:50', '2022010010038', '皇甫嵩', '123456', '男', 21, 'file/38.jpg', '13800001038', 'huangfs@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (39, '2026-01-29 08:15:50', '2022010010039', '独孤剑', '123456', '男', 19, 'file/39.jpg', '13800001039', 'duguj@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (40, '2026-01-29 08:15:50', '2022010010040', '杨幂幂', '123456', '女', 20, 'file/40.jpg', '13800001040', 'yangmm@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (41, '2026-01-29 08:15:50', '2022010010041', '上官秋月', '123456', '女', 21, 'file/41.jpg', '13800001041', 'shanggqy@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (42, '2026-01-29 08:15:50', '2022010010042', '慕容雪', '123456', '女', 19, 'file/42.jpg', '13800001042', 'murongx@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (43, '2026-01-29 08:15:50', '2022010010043', '邓超超', '123456', '男', 20, 'file/43.jpg', '13800001043', 'dengcc@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (44, '2026-01-29 08:15:50', '2022010010044', '尉迟恭', '123456', '男', 21, 'file/44.jpg', '13800001044', 'yuchig@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (45, '2026-01-29 08:15:50', '2022010010045', '令狐平', '123456', '男', 19, 'file/45.jpg', '13800001045', 'linghup@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (46, '2026-01-29 08:15:50', '2022010010046', '赵丽颖', '123456', '女', 20, 'file/46.jpg', '13800001046', 'zhaoly@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (47, '2026-01-29 08:15:50', '2022010010047', '诸葛芸芸', '123456', '女', 21, 'file/47.jpg', '13800001047', 'zhugeyy@edu.cn');
INSERT INTO `cansaixuesheng` VALUES (48, '2026-01-29 08:15:50', '2022010010048', '独孤静', '123456', '女', 19, 'file/48.jpg', '13800001048', 'dugujing@edu.cn');

-- ----------------------------
-- Table structure for config
-- ----------------------------
DROP TABLE IF EXISTS `config`;
CREATE TABLE `config`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '名称',
  `value` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '值',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 4 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '轮播图' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of config
-- ----------------------------
INSERT INTO `config` VALUES (1, '2026-01-29 16:15:51', 'swiper1', 'file/1770013505732.jpg');
INSERT INTO `config` VALUES (2, '2026-01-29 16:15:51', 'swiper2', 'file/1770013497889.jpg');
INSERT INTO `config` VALUES (3, '2026-01-29 16:15:51', 'swiper3', 'file/1770013517900.jpg');

-- ----------------------------
-- Table structure for discusslanqiusaishi
-- ----------------------------
DROP TABLE IF EXISTS `discusslanqiusaishi`;
CREATE TABLE `discusslanqiusaishi`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `refid` bigint(20) NOT NULL COMMENT '关联表id',
  `userid` bigint(20) NOT NULL COMMENT '用户id',
  `avatarurl` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '头像',
  `nickname` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '用户名',
  `content` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '评论内容',
  `reply` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '回复内容',
  `thumbsupnum` int(11) NULL DEFAULT 0 COMMENT '赞',
  `crazilynum` int(11) NULL DEFAULT 0 COMMENT '踩',
  `istop` int(11) NULL DEFAULT 0 COMMENT '置顶(1:置顶,0:非置顶)',
  `tuserids` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '赞用户ids',
  `cuserids` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '踩用户ids',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 31 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '篮球赛事评论表' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of discusslanqiusaishi
-- ----------------------------
INSERT INTO `discusslanqiusaishi` VALUES (1, '2026-01-29 14:10:00', 1, 4, 'file/cansaixueshengTouxiang4.jpg', '2022010010004', '21:19，烈焰冲锋队第一场就下了马威，极速闪电团后半场明显体力不足，失球太多😱', NULL, 6, 0, 0, '1,7,19,10,13,16', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (2, '2026-01-29 14:20:00', 1, 19, 'file/cansaixueshengTouxiang19.jpg', '2022010010019', '张浩然这场发挥超好！那几个快攻直接把极速闪电团逼到心理崩盘了😄', '极速闪电团别急，后面还有追回来的机会！💪', 4, 0, 0, '1,7,10,46', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (3, '2026-01-29 14:15:00', 7, 22, 'file/cansaixueshengTouxiang22.jpg', '2022010010022', '超能陆战队20:18，慕容紫英那个中距离投篮真的太稳了！快乐星球今天发挥有点不在线😅', NULL, 5, 1, 0, '19,25,34,43,37', '4');
INSERT INTO `discusslanqiusaishi` VALUES (4, '2026-01-29 14:25:00', 7, 13, 'file/cansaixueshengTouxiang13.jpg', '2022010010013', '快乐星球加油！第一场输了没关系，后面还有反超的机会。皇甫铁牛那个篮板抢的好棒😄', '谢谢铁牛的支持！后面两场我们一定找回来！💪', 3, 0, 1, '16,22,37', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (5, '2026-03-15 14:35:00', 25, 46, 'file/cansaixueshengTouxiang46.jpg', '2022010010046', '我们传奇之路赢了！！！😱😱😱 21:19黑马爆冷！诸葛芸芸最后那连续三球简直不可思议，独孤静篮下抢板全场第一！', NULL, 18, 2, 1, '7,4,10,13,16,19,22,25,28,31,34,37,40,43,3,6,2,8', '11,30');
INSERT INTO `discusslanqiusaishi` VALUES (6, '2026-03-15 14:45:00', 25, 1, 'file/cansaixueshengTouxiang1.jpg', '2022010010001', '😭😭 我们输了……前半场明明压着打的，后半场怎么就这么垮了。传奇之路后半场真的太疯狂了，个人表现太强…', '张浩然加油！你们小组赛的表现已经很棒了！下赛季再来！', 8, 3, 0, '4,10,16,19,22,25,28,31', '13,40,46');
INSERT INTO `discusslanqiusaishi` VALUES (7, '2026-03-15 15:00:00', 25, 43, 'file/cansaixueshengTouxiang43.jpg', '2022010010043', '黑马爆冷看得超刺激！！😱 这才是三人篮球最酷的地方——任何时候都不能放弃！赵丽颖这场也太猛了😍', NULL, 9, 0, 1, '4,7,10,13,16,19,22,25,28,31,37', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (8, '2026-03-22 14:40:00', 29, 19, 'file/cansaixueshengTouxiang19.jpg', '2022010010019', '元气满满队21:18！赵子龙那个关键球简直太稳了！公孙离离的传球线路清楚得不得了😄 半决赛就这么赢了！', NULL, 11, 1, 0, '1,4,7,10,13,21,25,28,37,43,46', '16');
INSERT INTO `discusslanqiusaishi` VALUES (9, '2026-03-22 14:55:00', 29, 46, 'file/cansaixueshengTouxiang46.jpg', '2022010010046', '传奇之路我们被淘汰了😭 1/4决赛的奇迹没能再延续……不过元气满满队确实实力太过硬了，服！', '丽颖别伤心！1/4决赛那场逆转烈焰冲锋队已经是赛事传奇了！🏆', 5, 0, 0, '10,16,22,34,37', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (10, '2026-03-22 16:15:00', 30, 43, 'file/cansaixueshengTouxiang43.jpg', '2022010010043', '王者荣耀20:19绝杀！！那最后1分差距太心跳了😱😱 尉迟恭最后那个篮下暴扣直接锁死比赛！', NULL, 14, 1, 1, '1,4,7,10,13,16,19,22,28,31,34,37,40', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (11, '2026-03-22 16:25:00', 30, 25, 'file/cansaixueshengTouxiang25.jpg', '2022010010025', '燃烧吧少年被淘汰😭😭 19:20，只差一分啊！最后那几秒钟真的太痛了，如果东方不败那球投进去……', '杰伦加油！你们今赛季已经证明了实力了！三连胜不是开玩笑的💪', 7, 0, 0, '4,10,16,22,28,34', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (12, '2026-03-29 14:20:00', 31, 46, 'file/cansaixueshengTouxiang46.jpg', '2022010010046', '传奇之路获得季军！！🥉😊 21:19，和1/4决赛那场比分一样——传奇二连翻盘！丽颖好开心！', NULL, 10, 0, 0, '1,4,7,10,13,16,22,28,34,37', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (13, '2026-03-29 14:30:00', 31, 25, 'file/cansaixueshengTouxiang25.jpg', '2022010010025', '燃烧吧少年第四名……虽然不开心，但丽颖恭喜你！你们传奇之路确实是这赛季的黑马💪 下次见！', '谢谢杰伦！你们三连胜的实力我都看到了，下赛季见！😄', 4, 0, 0, '7,10,16,19,34', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (14, '2026-03-29 16:25:00', 32, 43, 'file/cansaixueshengTouxiang43.jpg', '2022010010043', '🏆🏆🏆 王者荣耀夺冠！！！21:19！！ 尉迟恭那个最后的暴扣全场沸腾了😱😱😱 我们做到了！！！CHAMPION！！！', NULL, 28, 1, 2, '1,4,7,10,13,16,19,22,25,28,31,34,37,40,46,2,3,6', '8,37');
INSERT INTO `discusslanqiusaishi` VALUES (15, '2026-03-29 16:30:00', 32, 19, 'file/cansaixueshengTouxiang19.jpg', '2022010010019', '元气满满队亚军😭 公孙离离和司马光耀都拼到极限了，但今天王者荣耀的状态确实太好了……唉，恭喜你们吧😔', '子龙别伤心！你们是赛事最强的双打组合！下赛季见！💪', 12, 2, 0, '1,4,7,10,13,16,25,28,34,37,40,46', '22,28');
INSERT INTO `discusslanqiusaishi` VALUES (16, '2026-03-29 16:40:00', 32, 25, 'file/cansaixueshengTouxiang25.jpg', '2022010010025', '恭喜王者荣耀！😊 邓超超发挥太好了，关键时刻那种稳定性真的不是一般人有的。冠军当之无愧！', NULL, 8, 0, 0, '1,4,7,10,13,19,34,37', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (17, '2026-03-29 16:50:00', 32, 46, 'file/cansaixueshengTouxiang46.jpg', '2022010010046', '看完决赛我觉得王者荣耀确实是全赛事最完美的队伍——攻守平衡，关键球处理太稳了。冠军！🎊', NULL, 6, 0, 0, '1,4,10,13,25,37', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (18, '2026-03-29 17:00:00', 32, 1, 'file/cansaixueshengTouxiang1.jpg', '2022010010001', '虽然我们烈焰冲锋队早就被淘汰了，但看完整个赛事的决赛还是被打动了😊 整个赛事回味无穷！明年见！', NULL, 5, 0, 0, '4,7,10,13,16', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (19, '2026-01-29 15:35:00', 8, 19, 'file/cansaixueshengTouxiang19.jpg', '2022010010019', '元气满满队21:17，稳胜！赵子龙这场篮下控制力真的太棒了，司马光耀远投也命中率很高😄', NULL, 7, 0, 0, '1,4,7,10,13,21,46', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (20, '2026-01-29 15:40:00', 8, 22, 'file/cansaixueshengTouxiang22.jpg', '2022010010022', '进击的巨人加油！虽然输了但独孤求败那个篮板抢得超拼😄 后面还有追上的机会！', NULL, 3, 0, 0, '10,16,25', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (21, '2026-03-04 14:10:00', 13, 25, 'file/cansaixueshengTouxiang25.jpg', '2022010010025', '燃烧吧少年21:19！第一场就赢了好开心😄 尉迟敬德那个关键三分投得太漂亮了！', NULL, 6, 0, 1, '7,10,16,19,34,37', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (22, '2026-03-04 14:20:00', 13, 28, 'file/cansaixueshengTouxiang28.jpg', '2022010010028', '逆风翻盘队加油！我们吴彦祖今天发挥一般，但后面两场我们会找回来的💪', NULL, 4, 0, 0, '10,16,34,37', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (23, '2026-03-04 15:35:00', 20, 43, 'file/cansaixueshengTouxiang43.jpg', '2022010010043', '王者荣耀21:18！D组第一场就开了好头😄 邓超超和尉迟恭配合超好，令狐平今天远投全中！', NULL, 7, 0, 0, '1,4,7,10,13,19,37', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (24, '2026-03-04 15:45:00', 20, 46, 'file/cansaixueshengTouxiang46.jpg', '2022010010046', '传奇之路第一场输了没关系😄 我们后面会拼回来的！赵丽颖的发挥能接着比赛好起来！💪', NULL, 3, 0, 0, '10,16,34', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (25, '2026-03-02 14:10:00', 3, 7, 'file/cansaixueshengTouxiang7.jpg', '2022010010007', '无限火力队19:17赢了！欧阳震华这场篮下太稳了😄 烈焰冲锋队第一场赢了后面被我们扳回来了哈哈！', NULL, 5, 0, 0, '4,10,13,19,22', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (26, '2026-03-02 14:20:00', 3, 1, 'file/cansaixueshengTouxiang1.jpg', '2022010010001', '烈焰冲锋队输了😭 王伟泽和欧阳震华配合太默契了，后半场被完全打散了。司马长空要加油！💪', '张浩然加油！第三轮可以把伤害找回来！💪', 3, 0, 0, '4,13,16,22', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (27, '2026-03-02 14:10:00', 9, 19, 'file/cansaixueshengTouxiang19.jpg', '2022010010019', '元气满满队19:17！两场两胜😄 赵子龙公孙离离配合越来越好了，司马光耀那个底角三分投得太舒服了！', NULL, 5, 0, 0, '7,10,13,21,43', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (28, '2026-03-02 14:25:00', 9, 13, 'file/cansaixueshengTouxiang13.jpg', '2022010010013', '快乐星球两场两败😭 不过皇甫铁牛这场篮板抢的真的不差！关键是攻击力还是有欠缺，希望第三场能找回来！', NULL, 3, 0, 0, '4,10,22', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (29, '2026-03-05 14:10:00', 21, 43, 'file/cansaixueshengTouxiang43.jpg', '2022010010043', '王者荣耀20:18连赢！！D组前两轮全胜😄 尉迟恭的暴力篮下简直是赛事最恐怖的武器！', NULL, 6, 0, 0, '1,4,7,10,13,19', NULL);
INSERT INTO `discusslanqiusaishi` VALUES (30, '2026-03-05 14:25:00', 21, 37, 'file/cansaixueshengTouxiang37.jpg', '2022010010037', '梦想起航输了😔 王者荣耀确实太过硬了，皇甫嵩和独孤剑都拼到极限了。第三场已经无意义了……加油吧', NULL, 2, 0, 0, '7,10', NULL);

-- ----------------------------
-- Table structure for discussqiuduipaixingbang
-- ----------------------------
DROP TABLE IF EXISTS `discussqiuduipaixingbang`;
CREATE TABLE `discussqiuduipaixingbang`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `refid` bigint(20) NOT NULL COMMENT '关联表id',
  `userid` bigint(20) NOT NULL COMMENT '用户id',
  `avatarurl` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '头像',
  `nickname` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '用户名',
  `content` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '评论内容',
  `reply` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '回复内容',
  `thumbsupnum` int(11) NULL DEFAULT 0 COMMENT '赞',
  `crazilynum` int(11) NULL DEFAULT 0 COMMENT '踩',
  `istop` int(11) NULL DEFAULT 0 COMMENT '置顶(1:置顶,0:非置顶)',
  `tuserids` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '赞用户ids',
  `cuserids` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '踩用户ids',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 26 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '球队排行榜评论表' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of discussqiuduipaixingbang
-- ----------------------------
INSERT INTO `discussqiuduipaixingbang` VALUES (1, '2026-03-30 10:00:00', 15, 43, 'file/cansaixueshengTouxiang43.jpg', '2022010010043', '🏆 王者荣耀冠军！小组赛三连胜，淘汰赛一路坦途，总决赛21:19封锁！这赛季全程没有败绩——帅！', NULL, 22, 1, 0, '1,4,7,10,13,16,19,22,25,28,31,34,37,40,46,2,3,6', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (2, '2026-03-30 10:15:00', 15, 19, 'file/cansaixueshengTouxiang19.jpg', '2022010010019', '恭喜王者荣耀！😊 决赛对我们元气满满队确实发挥太好了。我们和你们比起来还是差了一点边缘……尊敬！', '谢谢赵子龙！决赛那场你们也拼得很好，21:19说明实力差距真的很小！💪', 10, 0, 0, '1,4,7,10,13,16,25,28,34,37', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (3, '2026-03-30 10:30:00', 15, 25, 'file/cansaixueshengTouxiang25.jpg', '2022010010025', '帝王级配合！邓超超的控球+尉迟恭的暴力篮下+令狐平的定点三分，三线齐齐，简直就是三人篮球的教科书级组合😍', NULL, 15, 0, 1, '1,4,7,10,13,16,19,28,34,37,40,43,46', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (4, '2026-03-30 11:00:00', 15, 46, 'file/cansaixueshengTouxiang46.jpg', '2022010010046', '我们传奇之路1/4决赛翻了烈焰冲锋队，但遇到王者荣耀估计也翻不了😂 他们确实是赛事最强的队！恭喜！', NULL, 7, 0, 0, '4,7,10,13,19,34,37', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (5, '2026-03-30 10:05:00', 7, 19, 'file/cansaixueshengTouxiang19.jpg', '2022010010019', '元气满满队亚军😭 小组赛三连胜、半决赛胜出，最后在决赛被王者荣耀压下。19:21，每一分都痛😔', NULL, 12, 1, 0, '1,4,7,10,13,16,22,25,28,34,37,46', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (6, '2026-03-30 10:20:00', 7, 43, 'file/cansaixueshengTouxiang43.jpg', '2022010010043', '赵子龙 加油！元气满满队实力有目共睹，亚军对于这支年轻队来说已经很厉害了！下赛季定然能拿冠军💪', '谢谢邓超超！😊 下赛季见！', 8, 0, 0, '1,4,10,13,16,19,25,37', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (7, '2026-03-30 10:45:00', 7, 25, 'file/cansaixueshengTouxiang25.jpg', '2022010010025', '赵子龙公孙离离司马光耀这三个配合真的很高级！公孙离离那个传球线路简直看不见😱 赛事最好看的传球之一！', NULL, 9, 0, 0, '1,4,7,10,13,16,43,37,46', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (8, '2026-03-30 10:10:00', 9, 25, 'file/cansaixueshengTouxiang25.jpg', '2022010010025', '燃烧吧少年小组赛三连胜但半决赛被王者荣耀绝杀😭😭 19:20，最后一分就是一分的差距……太痛了！但我们证明了实力！', NULL, 11, 0, 0, '1,4,7,10,13,16,19,22,34,37,43', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (9, '2026-03-30 10:25:00', 9, 43, 'file/cansaixueshengTouxiang43.jpg', '2022010010043', '杰伦！燃烧吧少年三连胜的实力是真的不开玩笑😄 半决赛只差1分就能进决赛，确实太遗憾了。但你们的精神值得尊敬！💪', '谢谢邓超超的认可！😊 下赛季我们不会再输了！', 7, 0, 0, '1,4,10,13,19,37,46', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (10, '2026-03-30 11:15:00', 9, 19, 'file/cansaixueshengTouxiang19.jpg', '2022010010019', '东方不败那个最后的三分如果投进去……人生不能假设😅 但燃烧吧少年整赛季的抗压能力确实很强！', NULL, 5, 0, 0, '4,7,10,25,37', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (11, '2026-03-30 10:08:00', 16, 46, 'file/cansaixueshengTouxiang46.jpg', '2022010010046', '🥉 传奇之路——赛事最大的黑马！1/4决赛翻盘烈焰冲锋队，季军赛再赢燃烧吧少年。从D组第二名到季军，走得比谁都硬！', NULL, 16, 0, 1, '1,4,7,10,13,16,19,22,25,28,34,37,43', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (12, '2026-03-30 10:35:00', 16, 1, 'file/cansaixueshengTouxiang1.jpg', '2022010010001', '说到传奇之路就心痛😭😭 1/4决赛被他们翻的那场真的太突然了。但不得不说，丽颖那场确实太猛了，诸葛芸芸那连续三球也是天赋级别😱', '张浩然谢谢你！虽然翻盘了你们但你们实力真的很强，尊敬！😊', 10, 1, 0, '4,7,10,13,16,19,22,25,28,34,37', '46');
INSERT INTO `discussqiuduipaixingbang` VALUES (13, '2026-03-30 11:30:00', 16, 25, 'file/cansaixueshengTouxiang25.jpg', '2022010010025', '季军赛21:19打了我们😭 丽颖赛事最黑马的存在😱 她在关键球处理上真的超脱了同龄人的水平！传奇之路当之无愧！', NULL, 8, 0, 0, '1,4,7,10,13,19,43,37', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (14, '2026-03-30 09:30:00', 3, 7, 'file/cansaixueshengTouxiang7.jpg', '2022010010007', '无限火力队A组三连胜！😄 欧阳震华篮下稳定性赛事前列，慕容冲反应速度极快，进攻火力就是真的猛！虽然淘汰赛没走太远，但小组赛展示了真实实力！', NULL, 9, 0, 0, '1,4,10,13,16,19,34,43,37', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (15, '2026-03-30 09:45:00', 3, 13, 'file/cansaixueshengTouxiang13.jpg', '2022010010013', '1/4决赛对王者荣耀是真的太难了😅 王者荣耀20:17，三个人都在最佳状态，无限火力队有点发挥不稳定。但A组全胜证明实力！', NULL, 5, 0, 0, '4,7,10,19,22', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (16, '2026-03-30 09:20:00', 1, 1, 'file/cansaixueshengTouxiang1.jpg', '2022010010001', '烈焰冲锋队——虽然被传奇之路1/4决赛黑马翻了😭 但我们张浩然、欧阳旭日、司马长空这三个人在赛事里展示了真正的热血！明年再来！', NULL, 8, 0, 0, '4,7,10,13,19,25,34,43', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (17, '2026-03-30 09:35:00', 1, 46, 'file/cansaixueshengTouxiang46.jpg', '2022010010046', '张浩然加油！翻盘你们那场确实是命中注定😄 但我一直尊重你们烈焰冲锋队的实力！明年见！', NULL, 5, 0, 0, '7,10,13,19,25', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (18, '2026-03-30 09:50:00', 6, 16, 'file/cansaixueshengTouxiang16.jpg', '2022010010016', '超能陆战队B组第二名，淘汰赛被燃烧吧少年淘汰😭 但慕容紫英的中距离投篮是赛事最稳定的之一！诸葛大力和上官婉儿配合也很棒！', NULL, 6, 0, 0, '4,7,10,19,22,37', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (19, '2026-03-30 10:05:00', 6, 25, 'file/cansaixueshengTouxiang25.jpg', '2022010010025', '那场1/4决赛21:17……我们燃烧吧少年发挥很好😄 但超能陆战队的攻守平衡确实是看到的最好之一！恭喜慕容紫英！', '谢谢杰伦😊 你们那场确实太猛了，拍手称赞！', 4, 0, 0, '1,7,10,13,34', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (20, '2026-03-30 10:00:00', 10, 28, 'file/cansaixueshengTouxiang28.jpg', '2022010010028', '逆风翻盘队C组第二名，晋级到了1/4决赛！吴彦祖和令狐冲冲配合也越来越默契了😄 遗憾是1/4决赛遇到了元气满满队…', NULL, 7, 0, 0, '1,4,10,13,16,22,37', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (21, '2026-03-30 10:20:00', 10, 19, 'file/cansaixueshengTouxiang19.jpg', '2022010010019', '吴彦祖！那场1/4决赛22:18……元气满满队确实状态最好😅 但你们赛事展示的逆境精神值得学习！', '谢谢赵子龙！下赛季真正翻盘的时候来了！😄💪', 4, 0, 0, '7,10,13,25', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (22, '2026-03-30 09:55:00', 11, 31, 'file/cansaixueshengTouxiang31.jpg', '2022010010031', '雷霆战将C组第三名……郑爽爽、上官飞燕、诸葛瑾瑾三个人都拼到极限了。防守确实很好但攻击力不够啊😔', NULL, 5, 0, 0, '4,7,10,13,16', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (23, '2026-03-30 10:10:00', 11, 28, 'file/cansaixueshengTouxiang28.jpg', '2022010010028', '爽爽！雷霆战将的防守底蕴我看见了😄 只要攻击力再强一点，下赛季应该能走到淘汰赛！加油！💪', '谢谢吴彦祖！下赛季我们攻击力一定会翻倍！😄', 3, 0, 0, '1,7,10', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (24, '2026-03-30 09:40:00', 5, 13, 'file/cansaixueshengTouxiang13.jpg', '2022010010013', '快乐星球第三场赢了！！🎉 21:18挽回一场！虽然还是B组第三名没晋级，但最后一场赢了心情好多了😄 下赛季加油！', NULL, 6, 0, 0, '4,7,10,14,16,22', NULL);
INSERT INTO `discussqiuduipaixingbang` VALUES (25, '2026-03-30 10:00:00', 5, 22, 'file/cansaixueshengTouxiang22.jpg', '2022010010022', '快乐星球前两场没赢但最后一场赢了——说明这队有信心！陈明轩指挥还是有两把刷子😄 明年看看他们能不能冲上去！', NULL, 4, 0, 0, '4,10,13,16', NULL);

-- ----------------------------
-- Table structure for emailregistercode
-- ----------------------------
DROP TABLE IF EXISTS `emailregistercode`;
CREATE TABLE `emailregistercode`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `email` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '邮箱',
  `role` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '角色',
  `code` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '验证码',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 11 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '邮箱验证码' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of emailregistercode
-- ----------------------------
INSERT INTO `emailregistercode` VALUES (1, '2026-01-29 16:15:50', '邮箱1', '角色1', '验证码1');
INSERT INTO `emailregistercode` VALUES (2, '2026-01-29 16:15:50', '邮箱2', '角色2', '验证码2');
INSERT INTO `emailregistercode` VALUES (3, '2026-01-29 16:15:50', '邮箱3', '角色3', '验证码3');
INSERT INTO `emailregistercode` VALUES (4, '2026-01-29 16:15:50', '邮箱4', '角色4', '验证码4');
INSERT INTO `emailregistercode` VALUES (5, '2026-01-29 16:15:50', '邮箱5', '角色5', '验证码5');
INSERT INTO `emailregistercode` VALUES (6, '2026-01-29 16:15:50', '邮箱6', '角色6', '验证码6');
INSERT INTO `emailregistercode` VALUES (7, '2026-01-29 16:15:50', '邮箱7', '角色7', '验证码7');
INSERT INTO `emailregistercode` VALUES (8, '2026-01-29 16:15:50', '邮箱8', '角色8', '验证码8');
INSERT INTO `emailregistercode` VALUES (9, '2026-01-29 16:15:50', '邮箱9', '角色9', '验证码9');
INSERT INTO `emailregistercode` VALUES (10, '2026-01-29 16:15:50', '邮箱10', '角色10', '验证码10');

-- ----------------------------
-- Table structure for forum
-- ----------------------------
DROP TABLE IF EXISTS `forum`;
CREATE TABLE `forum`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `title` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '帖子标题',
  `content` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '帖子内容',
  `parentid` bigint(20) NULL DEFAULT NULL COMMENT '父节点id',
  `userid` bigint(20) NOT NULL COMMENT '用户id',
  `username` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '用户名',
  `avatarurl` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '头像',
  `isdone` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '状态',
  `is_top` int(11) NULL DEFAULT 0 COMMENT '是否置顶',
  `top_time` datetime NULL DEFAULT NULL COMMENT '置顶时间',
  `type_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '分类名称',
  `cover` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '封面',
  `is_anonymous` int(11) NULL DEFAULT 0 COMMENT '是否匿名',
  `is_del` int(11) NULL DEFAULT 0 COMMENT '是否删除',
  `thumbsup_number` int(11) NULL DEFAULT 0 COMMENT '赞',
  `crazily_number` int(11) NULL DEFAULT 0 COMMENT '踩',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 9 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '互动交流' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of forum
-- ----------------------------
INSERT INTO `forum` VALUES (1, '2026-02-01 17:24:44', '【冠军时刻】王者荣耀做到了！感谢所有支持我们的同学！', '<p>21:19！最后的比分定格的那一刻，我大脑一片空白。从小组赛三连胜到总决赛绝杀元气满满队，这条路真的太难了。感谢尉迟恭(ID 44)最后的关键篮板，感谢令狐平(ID 45)的致命三分！我们是冠军！🏆</p>', 0, 1, '邓超超', 'file/cansaixueshengTouxiang43.jpg', '开放', 1, '2026-02-01 17:24:44', '🔥 热门赛事讨论', 'file/1770018549665.jpg', 0, 0, 520, 3);
INSERT INTO `forum` VALUES (2, '2026-02-01 16:24:44', '虽败犹荣，明年我们一定会赢回来！', '<p>输给王者荣耀确实心服口服，邓超超确实太稳了。但是我们元气满满队不会散！公孙离离、司马光耀，别灰心，我们依然是全校最强的进攻组合之一。明年奖杯一定是我们的！</p>', 0, 1, '赵子龙', 'file/cansaixueshengTouxiang19.jpg', '开放', 1, '2026-02-01 17:24:44', '🔥 热门赛事讨论', 'file/1770018540708.jpg', 0, 0, 345, 0);
INSERT INTO `forum` VALUES (3, '2026-02-01 15:24:44', '季军也是一种传奇！传奇之路队总结帖', '<p>谁能想到我们能从D组杀出来？1/4决赛逆转烈焰冲锋队是我这学期最开心的事！虽然半决赛输了，但季军赛赢了燃烧吧少年，证明了我们不是昙花一现。传奇之路，未完待续！✨</p>', 0, 1, '赵丽颖', 'file/cansaixueshengTouxiang46.jpg', '开放', 0, NULL, '🔥 热门赛事讨论', 'file/1770018532801.jpg', 0, 0, 888, 12);
INSERT INTO `forum` VALUES (4, '2026-02-01 12:24:44', '【烈焰冲锋队】诚招一名强力中锋，备战下赛季', '<p>这赛季止步8强很不甘心。痛定思痛，我们的内线防守太薄弱了。现诚招一名身高185+，有护框能力的中锋。有意者私聊，或者直接来中心体育馆1号场找我PK试训。</p>', 0, 1, '张浩然', 'file/cansaixueshengTouxiang1.jpg', '开放', 0, NULL, '🤝 约球与组队招募', 'file/1770018523549.jpg', 0, 0, 45, 0);
INSERT INTO `forum` VALUES (5, '2026-01-31 17:24:44', '复盘：如何破解“无限火力队”的快攻战术？', '<p>和王伟泽他们打了一场，发现他们转换进攻极快。如果不退防，基本就是送分。建议大家打阵地战，拖慢节奏。附上我画的几个防守站位图。</p>', 0, 1, '慕容紫英', 'file/cansaixueshengTouxiang16.jpg', '开放', 0, NULL, '🏀 战术与技术交流', 'file/1770018516892.jpg', 0, 0, 112, 1);
INSERT INTO `forum` VALUES (6, '2026-01-30 17:24:44', '出99新詹姆斯20，43码，只穿过一次实战', '<p>鞋子偏小，有点挤脚。配色是首发色。原价入的，现在打骨折出。校内面交，支持验货。送两双精英袜。</p>', 0, 1, '周杰伦', 'file/cansaixueshengTouxiang25.jpg', '开放', 0, NULL, '👟 装备交易与测评', 'file/1770018504265.jpg', 0, 0, 23, 0);
INSERT INTO `forum` VALUES (7, '2026-01-29 17:24:44', 'B组那场比赛的判罚是不是有点太严了？', '<p>我就轻轻碰了一下，真的就是轻轻一下，裁判直接吹违体？这还让不让人防守了？快乐星球打得一点都不快乐了😭</p>', 0, 1, '陈明轩', 'file/cansaixueshengTouxiang13.jpg', '开放', 0, NULL, '🎤 校园吐槽大会', 'file/1770018490538.jpg', 0, 0, 56, 15);
INSERT INTO `forum` VALUES (8, '2026-01-28 17:24:44', '有没有人觉得那个记分员小哥哥有点帅？', '<p>就是决赛那场负责翻分的那个，戴眼镜斯斯文文的。求个联系方式，在线等，挺急的！</p>', 0, 1, '杨幂幂', 'file/cansaixueshengTouxiang40.jpg', '开放', 0, NULL, '🎤 校园吐槽大会', 'file/1770018564439.jpg', 0, 0, 233, 5);

-- ----------------------------
-- Table structure for forum_report
-- ----------------------------
DROP TABLE IF EXISTS `forum_report`;
CREATE TABLE `forum_report`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `forum_id` bigint(20) NULL DEFAULT NULL COMMENT '论坛Id',
  `title` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '帖子标题',
  `report_userid` bigint(20) NOT NULL COMMENT '举报人id',
  `report_username` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '举报人账号',
  `reported_userid` bigint(20) NOT NULL COMMENT '被举报人id',
  `reported_username` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '被举报人账号',
  `reason` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '举报原因',
  `images` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '举报图片',
  `suggestion` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '处理建议',
  `status` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT '待处理' COMMENT '处理状态',
  `report_type` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT '主题帖举报' COMMENT '举报类型',
  `userid` bigint(20) NOT NULL COMMENT '用户id',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 2 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '论坛举报' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of forum_report
-- ----------------------------
INSERT INTO `forum_report` VALUES (1, '2026-02-01 17:24:44', 7, 'B组那场比赛的判罚是不是有点太严了？', 7, '王伟泽', 13, '陈明轩', '质疑裁判公正性，引发评论区骂战，建议处理', NULL, '建议删除该贴并警告用户', '待处理', '主题帖举报', 7);

-- ----------------------------
-- Table structure for forum_type
-- ----------------------------
DROP TABLE IF EXISTS `forum_type`;
CREATE TABLE `forum_type`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `type_name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '分类名称',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 6 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '论坛类型' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of forum_type
-- ----------------------------
INSERT INTO `forum_type` VALUES (1, '2026-02-01 17:24:44', '🔥 热门赛事讨论');
INSERT INTO `forum_type` VALUES (2, '2026-02-01 17:24:44', '🏀 战术与技术交流');
INSERT INTO `forum_type` VALUES (3, '2026-02-01 17:24:44', '🤝 约球与组队招募');
INSERT INTO `forum_type` VALUES (4, '2026-02-01 17:24:44', '👟 装备交易与测评');
INSERT INTO `forum_type` VALUES (5, '2026-02-01 17:24:44', '🎤 校园吐槽大会');

-- ----------------------------
-- Table structure for jiaruqiudui
-- ----------------------------
DROP TABLE IF EXISTS `jiaruqiudui`;
CREATE TABLE `jiaruqiudui`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `qiuduimingcheng` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '球队名称',
  `duizhangzhanghao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '队长账号',
  `duizhangxingming` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '队长姓名',
  `shenqingshijian` datetime NULL DEFAULT NULL COMMENT '申请时间',
  `xuehao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '学号',
  `xingming` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '姓名',
  `shouji` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '手机',
  `sfsh` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT '待审核' COMMENT '是否审核',
  `shhf` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '回复内容',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 17 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '加入球队' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of jiaruqiudui
-- ----------------------------
INSERT INTO `jiaruqiudui` VALUES (1, '2026-01-29 08:15:50', '烈焰冲锋队', '2022010010001', '张浩然', '2026-02-20 10:00:00', '2022010010002', '欧阳旭日', '13800001002', '是', '');
INSERT INTO `jiaruqiudui` VALUES (2, '2026-01-29 08:15:50', '极速闪电团', '2022010010004', '李梓涵', '2026-02-20 10:00:00', '2022010010005', '上官云珠', '13800001005', '是', '');
INSERT INTO `jiaruqiudui` VALUES (3, '2026-01-29 08:15:50', '无限火力队', '2022010010007', '王伟泽', '2026-02-20 10:00:00', '2022010010008', '欧阳震华', '13800001008', '是', '');
INSERT INTO `jiaruqiudui` VALUES (4, '2026-01-29 08:15:50', '青春风暴', '2022010010010', '刘诗诗', '2026-02-20 10:00:00', '2022010010011', '诸葛青云', '13800001011', '是', '');
INSERT INTO `jiaruqiudui` VALUES (5, '2026-01-29 08:15:50', '快乐星球', '2022010010013', '陈明轩', '2026-02-20 10:00:00', '2022010010014', '皇甫铁牛', '13800001014', '是', '');
INSERT INTO `jiaruqiudui` VALUES (6, '2026-01-29 08:15:50', '超能陆战队', '2022010010016', '慕容紫英', '2026-02-20 10:00:00', '2022010010017', '诸葛大力', '13800001017', '是', '');
INSERT INTO `jiaruqiudui` VALUES (7, '2026-01-29 08:15:50', '元气满满队', '2022010010019', '赵子龙', '2026-02-20 10:00:00', '2022010010020', '公孙离离', '13800001020', '是', '');
INSERT INTO `jiaruqiudui` VALUES (8, '2026-01-29 08:15:50', '进击的巨人', '2022010010022', '孙小美', '2026-02-20 10:00:00', '2022010010023', '独孤求败', '13800001023', '是', '');
INSERT INTO `jiaruqiudui` VALUES (9, '2026-01-29 08:15:50', '燃烧吧少年', '2022010010025', '周杰伦', '2026-02-20 10:00:00', '2022010010026', '尉迟敬德', '13800001026', '是', '');
INSERT INTO `jiaruqiudui` VALUES (10, '2026-01-29 08:15:50', '逆风翻盘队', '2022010010028', '吴彦祖', '2026-02-20 10:00:00', '2022010010029', '令狐冲冲', '13800001029', '是', '');
INSERT INTO `jiaruqiudui` VALUES (11, '2026-01-29 08:15:50', '雷霆战将', '2022010010031', '郑爽爽', '2026-02-20 10:00:00', '2022010010032', '上官飞燕', '13800001032', '是', '');
INSERT INTO `jiaruqiudui` VALUES (12, '2026-01-29 08:15:50', '钢铁洪流', '2022010010034', '林志颖', '2026-02-20 10:00:00', '2022010010035', '欧阳锋', '13800001035', '是', '');
INSERT INTO `jiaruqiudui` VALUES (13, '2026-01-29 08:15:50', '梦想起航', '2022010010037', '黄晓明', '2026-02-20 10:00:00', '2022010010038', '皇甫嵩', '13800001038', '是', '');
INSERT INTO `jiaruqiudui` VALUES (14, '2026-01-29 08:15:50', '星辰大海', '2022010010040', '杨幂幂', '2026-02-20 10:00:00', '2022010010041', '上官秋月', '13800001041', '是', '');
INSERT INTO `jiaruqiudui` VALUES (15, '2026-01-29 08:15:50', '王者荣耀', '2022010010043', '邓超超', '2026-02-20 10:00:00', '2022010010044', '尉迟恭', '13800001044', '是', '');
INSERT INTO `jiaruqiudui` VALUES (16, '2026-01-29 08:15:50', '传奇之路', '2022010010046', '赵丽颖', '2026-02-20 10:00:00', '2022010010047', '诸葛芸芸', '13800001047', '是', '');

-- ----------------------------
-- Table structure for jingsairicheng
-- ----------------------------
DROP TABLE IF EXISTS `jingsairicheng`;
CREATE TABLE `jingsairicheng`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `saishimingcheng` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '赛事名称',
  `bisaichangdi` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '比赛场地',
  `bisaishijian` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '比赛时间',
  `shoufazhenrong` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '首发阵容',
  `duizhenduiwu` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '对阵队伍',
  `xingming` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '上场球员',
  `tijiaoshijian` datetime NULL DEFAULT NULL COMMENT '提交时间',
  `duizhangzhanghao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '队长账号',
  `duizhangxingming` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '队长姓名',
  `qiuduimingcheng` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '球队名称',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `saishimingcheng`(`saishimingcheng`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 33 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '竞赛日程' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of jingsairicheng
-- ----------------------------
INSERT INTO `jingsairicheng` VALUES (1, '2026-01-29 08:15:50', 'A组第1轮：烈焰冲锋队vs极速闪电团', '中心体育馆1号场', '2024年3月1日 14:00', '张浩然、欧阳旭日、司马长空', '烈焰冲锋队vs极速闪电团', '张浩然、欧阳旭日、司马长空', '2026-03-01 10:00:00', '2022010010001', '张浩然', '烈焰冲锋队');
INSERT INTO `jingsairicheng` VALUES (2, '2026-01-29 08:15:50', 'A组第1轮：无限火力队vs青春风暴', '中心体育馆2号场', '2024年3月1日 15:30', '王伟泽、欧阳震华、慕容冲', '无限火力队vs青春风暴', '王伟泽、欧阳震华、慕容冲', '2026-03-01 10:00:00', '2022010010007', '王伟泽', '无限火力队');
INSERT INTO `jingsairicheng` VALUES (3, '2026-01-29 08:15:50', 'A组第2轮：烈焰冲锋队vs无限火力队', '中心体育馆1号场', '2024年3月2日 14:00', '张浩然、欧阳旭日、司马长空', '烈焰冲锋队vs无限火力队', '张浩然、欧阳旭日、司马长空', '2026-03-02 10:00:00', '2022010010001', '张浩然', '烈焰冲锋队');
INSERT INTO `jingsairicheng` VALUES (4, '2026-01-29 08:15:50', 'A组第2轮：极速闪电团vs青春风暴', '中心体育馆2号场', '2024年3月2日 15:30', '李梓涵、上官云珠、诸葛亮亮', '极速闪电团vs青春风暴', '李梓涵、上官云珠、诸葛亮亮', '2026-03-02 10:00:00', '2022010010004', '李梓涵', '极速闪电团');
INSERT INTO `jingsairicheng` VALUES (5, '2026-01-29 08:15:50', 'A组第3轮：烈焰冲锋队vs青春风暴', '中心体育馆1号场', '2024年3月3日 14:00', '张浩然、欧阳旭日、司马长空', '烈焰冲锋队vs青春风暴', '张浩然、欧阳旭日、司马长空', '2026-03-03 10:00:00', '2022010010001', '张浩然', '烈焰冲锋队');
INSERT INTO `jingsairicheng` VALUES (6, '2026-01-29 08:15:50', 'A组第3轮：极速闪电团vs无限火力队', '中心体育馆2号场', '2024年3月3日 15:30', '李梓涵、上官云珠、诸葛亮亮', '极速闪电团vs无限火力队', '李梓涵、上官云珠、诸葛亮亮', '2026-03-03 10:00:00', '2022010010004', '李梓涵', '极速闪电团');
INSERT INTO `jingsairicheng` VALUES (7, '2026-01-29 08:15:50', 'B组第1轮：快乐星球vs超能陆战队', '体育中心3号场', '2024年3月1日 14:00', '陈明轩、皇甫铁牛、令狐飞', '快乐星球vs超能陆战队', '陈明轩、皇甫铁牛、令狐飞', '2026-03-01 10:00:00', '2022010010013', '陈明轩', '快乐星球');
INSERT INTO `jingsairicheng` VALUES (8, '2026-01-29 08:15:50', 'B组第1轮：元气满满队vs进击的巨人', '体育中心4号场', '2024年3月1日 15:30', '赵子龙、公孙离离、司马光耀', '元气满满队vs进击的巨人', '赵子龙、公孙离离、司马光耀', '2026-03-01 10:00:00', '2022010010019', '赵子龙', '元气满满队');
INSERT INTO `jingsairicheng` VALUES (9, '2026-01-29 08:15:50', 'B组第2轮：快乐星球vs元气满满队', '体育中心3号场', '2024年3月2日 14:00', '陈明轩、皇甫铁牛、令狐飞', '快乐星球vs元气满满队', '陈明轩、皇甫铁牛、令狐飞', '2026-03-02 10:00:00', '2022010010013', '陈明轩', '快乐星球');
INSERT INTO `jingsairicheng` VALUES (10, '2026-01-29 08:15:50', 'B组第2轮：超能陆战队vs进击的巨人', '体育中心4号场', '2024年3月2日 15:30', '慕容紫英、诸葛大力、上官婉儿', '超能陆战队vs进击的巨人', '慕容紫英、诸葛大力、上官婉儿', '2026-03-02 10:00:00', '2022010010016', '慕容紫英', '超能陆战队');
INSERT INTO `jingsairicheng` VALUES (11, '2026-01-29 08:15:50', 'B组第3轮：快乐星球vs进击的巨人', '体育中心3号场', '2024年3月3日 14:00', '陈明轩、皇甫铁牛、令狐飞', '快乐星球vs进击的巨人', '陈明轩、皇甫铁牛、令狐飞', '2026-03-03 10:00:00', '2022010010013', '陈明轩', '快乐星球');
INSERT INTO `jingsairicheng` VALUES (12, '2026-01-29 08:15:50', 'B组第3轮：超能陆战队vs元气满满队', '体育中心4号场', '2024年3月3日 15:30', '慕容紫英、诸葛大力、上官婉儿', '超能陆战队vs元气满满队', '慕容紫英、诸葛大力、上官婉儿', '2026-03-03 10:00:00', '2022010010016', '慕容紫英', '超能陆战队');
INSERT INTO `jingsairicheng` VALUES (13, '2026-01-29 08:15:50', 'C组第1轮：燃烧吧少年vs逆风翻盘队', '大学城体育馆1号场', '2024年3月4日 14:00', '周杰伦、尉迟敬德、东方不败', '燃烧吧少年vs逆风翻盘队', '周杰伦、尉迟敬德、东方不败', '2026-03-04 10:00:00', '2022010010025', '周杰伦', '燃烧吧少年');
INSERT INTO `jingsairicheng` VALUES (14, '2026-01-29 08:15:50', 'C组第1轮：雷霆战将vs钢铁洪流', '大学城体育馆2号场', '2024年3月4日 15:30', '郑爽爽、上官飞燕、诸葛瑾瑾', '雷霆战将vs钢铁洪流', '郑爽爽、上官飞燕、诸葛瑾瑾', '2026-03-04 10:00:00', '2022010010031', '郑爽爽', '雷霆战将');
INSERT INTO `jingsairicheng` VALUES (15, '2026-01-29 08:15:50', 'C组第2轮：燃烧吧少年vs雷霆战将', '大学城体育馆1号场', '2024年3月5日 14:00', '周杰伦、尉迟敬德、东方不败', '燃烧吧少年vs雷霆战将', '周杰伦、尉迟敬德、东方不败', '2026-03-05 10:00:00', '2022010010025', '周杰伦', '燃烧吧少年');
INSERT INTO `jingsairicheng` VALUES (16, '2026-01-29 08:15:50', 'C组第2轮：逆风翻盘队vs钢铁洪流', '大学城体育馆2号场', '2024年3月5日 15:30', '吴彦祖、令狐冲冲、慕容复', '逆风翻盘队vs钢铁洪流', '吴彦祖、令狐冲冲、慕容复', '2026-03-05 10:00:00', '2022010010028', '吴彦祖', '逆风翻盘队');
INSERT INTO `jingsairicheng` VALUES (17, '2026-01-29 08:15:50', 'C组第3轮：燃烧吧少年vs钢铁洪流', '大学城体育馆1号场', '2024年3月6日 14:00', '周杰伦、尉迟敬德、东方不败', '燃烧吧少年vs钢铁洪流', '周杰伦、尉迟敬德、东方不败', '2026-03-06 10:00:00', '2022010010025', '周杰伦', '燃烧吧少年');
INSERT INTO `jingsairicheng` VALUES (18, '2026-01-29 08:15:50', 'C组第3轮：逆风翻盘队vs雷霆战将', '大学城体育馆2号场', '2024年3月6日 15:30', '吴彦祖、令狐冲冲、慕容复', '逆风翻盘队vs雷霆战将', '吴彦祖、令狐冲冲、慕容复', '2026-03-06 10:00:00', '2022010010028', '吴彦祖', '逆风翻盘队');
INSERT INTO `jingsairicheng` VALUES (19, '2026-01-29 08:15:50', 'D组第1轮：梦想起航vs星辰大海', '新区体育中心1号场', '2024年3月4日 14:00', '黄晓明、皇甫嵩、独孤剑', '梦想起航vs星辰大海', '黄晓明、皇甫嵩、独孤剑', '2026-03-04 10:00:00', '2022010010037', '黄晓明', '梦想起航');
INSERT INTO `jingsairicheng` VALUES (20, '2026-01-29 08:15:50', 'D组第1轮：王者荣耀vs传奇之路', '新区体育中心2号场', '2024年3月4日 15:30', '邓超超、尉迟恭、令狐平', '王者荣耀vs传奇之路', '邓超超、尉迟恭、令狐平', '2026-03-04 10:00:00', '2022010010043', '邓超超', '王者荣耀');
INSERT INTO `jingsairicheng` VALUES (21, '2026-01-29 08:15:50', 'D组第2轮：梦想起航vs王者荣耀', '新区体育中心1号场', '2024年3月5日 14:00', '黄晓明、皇甫嵩、独孤剑', '梦想起航vs王者荣耀', '黄晓明、皇甫嵩、独孤剑', '2026-03-05 10:00:00', '2022010010037', '黄晓明', '梦想起航');
INSERT INTO `jingsairicheng` VALUES (22, '2026-01-29 08:15:50', 'D组第2轮：星辰大海vs传奇之路', '新区体育中心2号场', '2024年3月5日 15:30', '杨幂幂、上官秋月、慕容雪', '星辰大海vs传奇之路', '杨幂幂、上官秋月、慕容雪', '2026-03-05 10:00:00', '2022010010040', '杨幂幂', '星辰大海');
INSERT INTO `jingsairicheng` VALUES (23, '2026-01-29 08:15:50', 'D组第3轮：梦想起航vs传奇之路', '新区体育中心1号场', '2024年3月6日 14:00', '黄晓明、皇甫嵩、独孤剑', '梦想起航vs传奇之路', '黄晓明、皇甫嵩、独孤剑', '2026-03-06 10:00:00', '2022010010037', '黄晓明', '梦想起航');
INSERT INTO `jingsairicheng` VALUES (24, '2026-01-29 08:15:50', 'D组第3轮：星辰大海vs王者荣耀', '新区体育中心2号场', '2024年3月6日 15:30', '杨幂幂、上官秋月、慕容雪', '星辰大海vs王者荣耀', '杨幂幂、上官秋月、慕容雪', '2026-03-06 10:00:00', '2022010010040', '杨幂幂', '星辰大海');
INSERT INTO `jingsairicheng` VALUES (25, '2026-01-29 08:15:50', '1/4决赛：烈焰冲锋队vs传奇之路', '市体育中心主馆', '2024年3月15日 14:00', '张浩然、欧阳旭日、司马长空', '烈焰冲锋队vs传奇之路', '张浩然、欧阳旭日、司马长空', '2026-03-15 10:00:00', '2022010010001', '张浩然', '烈焰冲锋队');
INSERT INTO `jingsairicheng` VALUES (26, '2026-01-29 08:15:50', '1/4决赛：元气满满队vs逆风翻盘队', '市体育中心主馆', '2024年3月15日 16:00', '赵子龙、公孙离离、司马光耀', '元气满满队vs逆风翻盘队', '赵子龙、公孙离离、司马光耀', '2026-03-15 10:00:00', '2022010010019', '赵子龙', '元气满满队');
INSERT INTO `jingsairicheng` VALUES (27, '2026-01-29 08:15:50', '1/4决赛：燃烧吧少年vs超能陆战队', '市体育中心主馆', '2024年3月16日 14:00', '周杰伦、尉迟敬德、东方不败', '燃烧吧少年vs超能陆战队', '周杰伦、尉迟敬德、东方不败', '2026-03-16 10:00:00', '2022010010025', '周杰伦', '燃烧吧少年');
INSERT INTO `jingsairicheng` VALUES (28, '2026-01-29 08:15:50', '1/4决赛：王者荣耀vs无限火力队', '市体育中心主馆', '2024年3月16日 16:00', '邓超超、尉迟恭、令狐平', '王者荣耀vs无限火力队', '邓超超、尉迟恭、令狐平', '2026-03-16 10:00:00', '2022010010043', '邓超超', '王者荣耀');
INSERT INTO `jingsairicheng` VALUES (29, '2026-01-29 08:15:50', '半决赛：传奇之路vs元气满满队', '市体育中心主馆', '2024年3月22日 14:00', '赵丽颖、诸葛芸芸、独孤静', '传奇之路vs元气满满队', '赵丽颖、诸葛芸芸、独孤静', '2026-03-22 10:00:00', '2022010010046', '赵丽颖', '传奇之路');
INSERT INTO `jingsairicheng` VALUES (30, '2026-01-29 08:15:50', '半决赛：燃烧吧少年vs王者荣耀', '市体育中心主馆', '2024年3月22日 16:00', '周杰伦、尉迟敬德、东方不败', '燃烧吧少年vs王者荣耀', '周杰伦、尉迟敬德、东方不败', '2026-03-22 10:00:00', '2022010010025', '周杰伦', '燃烧吧少年');
INSERT INTO `jingsairicheng` VALUES (31, '2026-01-29 08:15:50', '季军赛：传奇之路vs燃烧吧少年', '市体育中心主馆', '2024年3月29日 14:00', '赵丽颖、诸葛芸芸、独孤静', '传奇之路vs燃烧吧少年', '赵丽颖、诸葛芸芸、独孤静', '2026-03-29 10:00:00', '2022010010046', '赵丽颖', '传奇之路');
INSERT INTO `jingsairicheng` VALUES (32, '2026-01-29 08:15:50', '总决赛：元气满满队vs王者荣耀', '市体育中心主馆', '2024年3月29日 16:00', '赵子龙、公孙离离、司马光耀', '元气满满队vs王者荣耀', '赵子龙、公孙离离、司马光耀', '2026-03-29 10:00:00', '2022010010019', '赵子龙', '元气满满队');

-- ----------------------------
-- Table structure for jinjibisaijieguo
-- ----------------------------
DROP TABLE IF EXISTS `jinjibisaijieguo`;
CREATE TABLE `jinjibisaijieguo`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `jinjisaishi` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '晋级赛事',
  `zhuduiqiudui` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '主队球队',
  `keduiqiudui` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '客队球队',
  `zhuchangqiuyuan` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '主场球员',
  `kechangqiuyuan` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '客场球员',
  `zuizhongbifen` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '最终比分',
  `zhengyiqingkuang` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '争议情况',
  `tijiaoshijian` datetime NULL DEFAULT NULL COMMENT '提交时间',
  `caipanzhanghao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '裁判账号',
  `caipanxingming` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '裁判姓名',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 9 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '晋级比赛结果' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of jinjibisaijieguo
-- ----------------------------
INSERT INTO `jinjibisaijieguo` VALUES (1, '2026-01-29 08:15:50', '1/4决赛：烈焰冲锋队vs传奇之路', '烈焰冲锋队', '传奇之路', '张浩然、欧阳旭日、司马长空', '赵丽颖、诸葛芸芸、独孤静', '19:21', '黑马爆冷，传奇之路逆转', '2024-03-15 14:30:00', 'CP2023001', '赵铁面');
INSERT INTO `jinjibisaijieguo` VALUES (2, '2026-01-29 08:15:50', '1/4决赛：元气满满队vs逆风翻盘队', '元气满满队', '逆风翻盘队', '赵子龙、公孙离离、司马光耀', '吴彦祖、令狐冲冲、慕容复', '22:18', '元气满满队强势晋级', '2024-03-15 16:30:00', 'CP2023002', '冯雷');
INSERT INTO `jinjibisaijieguo` VALUES (3, '2026-01-29 08:15:50', '1/4决赛：燃烧吧少年vs超能陆战队', '燃烧吧少年', '超能陆战队', '周杰伦、尉迟敬德、东方不败', '慕容紫英、诸葛大力、上官婉儿', '21:17', '燃烧吧少年顺利晋级', '2024-03-16 14:30:00', 'CP2023003', '张明远');
INSERT INTO `jinjibisaijieguo` VALUES (4, '2026-01-29 08:15:50', '1/4决赛：王者荣耀vs无限火力队', '王者荣耀', '无限火力队', '邓超超、尉迟恭、令狐平', '王伟泽、欧阳震华、慕容冲', '20:17', '王者荣耀强势晋级', '2024-03-16 16:30:00', 'CP2023004', '王志刚');
INSERT INTO `jinjibisaijieguo` VALUES (5, '2026-01-29 08:15:50', '半决赛：传奇之路vs元气满满队', '传奇之路', '元气满满队', '赵丽颖、诸葛芸芸、独孤静', '赵子龙、公孙离离、司马光耀', '18:21', '元气满满队险胜', '2024-03-22 14:30:00', 'CP2023001', '赵铁面');
INSERT INTO `jinjibisaijieguo` VALUES (6, '2026-01-29 08:15:50', '半决赛：燃烧吧少年vs王者荣耀', '燃烧吧少年', '王者荣耀', '周杰伦、尉迟敬德、东方不败', '邓超超、尉迟恭、令狐平', '19:20', '王者荣耀绝杀晋级', '2024-03-22 16:30:00', 'CP2023002', '冯雷');
INSERT INTO `jinjibisaijieguo` VALUES (7, '2026-01-29 08:15:50', '季军赛：传奇之路vs燃烧吧少年', '传奇之路', '燃烧吧少年', '赵丽颖、诸葛芸芸、独孤静', '周杰伦、尉迟敬德、东方不败', '21:19', '传奇之路获得季军', '2024-03-29 14:30:00', 'CP2023001', '赵铁面');
INSERT INTO `jinjibisaijieguo` VALUES (8, '2026-01-29 08:15:50', '总决赛：元气满满队vs王者荣耀', '元气满满队', '王者荣耀', '赵子龙、公孙离离、司马光耀', '邓超超、尉迟恭、令狐平', '19:21', '王者荣耀获得冠军', '2024-03-29 16:30:00', 'CP2023002', '冯雷');

-- ----------------------------
-- Table structure for jinjishenqing
-- ----------------------------
DROP TABLE IF EXISTS `jinjishenqing`;
CREATE TABLE `jinjishenqing`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `saishimingcheng` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '赛事名称',
  `qiuduimingcheng` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '球队名称',
  `qiuduijifen` int(11) NULL DEFAULT NULL COMMENT '球队积分',
  `bisaipaiming` int(11) NULL DEFAULT NULL COMMENT '比赛排名',
  `caipanzhanghao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '裁判账号',
  `caipanxingming` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '裁判姓名',
  `jinjisaishi` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '晋级赛事',
  `shenqingshijian` datetime NULL DEFAULT NULL COMMENT '申请时间',
  `duizhangzhanghao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '队长账号',
  `duizhangxingming` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '队长姓名',
  `sfsh` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT '待审核' COMMENT '是否审核',
  `shhf` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '回复内容',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 9 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '晋级申请' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of jinjishenqing
-- ----------------------------
INSERT INTO `jinjishenqing` VALUES (1, '2026-01-29 08:15:50', 'A组第2轮：烈焰冲锋队vs无限火力队', '烈焰冲锋队', 6, 1, 'CP2023003', '张明远', '1/4决赛：烈焰冲锋队vs传奇之路', '2026-03-14 10:00:00', '2022010010001', '张浩然', '是', '');
INSERT INTO `jinjishenqing` VALUES (2, '2026-01-29 08:15:50', 'A组第3轮：极速闪电团vs无限火力队', '无限火力队', 9, 1, 'CP2023006', '吴浩然', '1/4决赛：王者荣耀vs无限火力队', '2026-03-14 10:00:00', '2022010010007', '王伟泽', '是', '');
INSERT INTO `jinjishenqing` VALUES (3, '2026-01-29 08:15:50', 'B组第3轮：超能陆战队vs元气满满队', '元气满满队', 9, 1, 'CP2023002', '冯雷', '1/4决赛：元气满满队vs逆风翻盘队', '2026-03-14 10:00:00', '2022010010019', '赵子龙', '是', '');
INSERT INTO `jinjishenqing` VALUES (4, '2026-01-29 08:15:50', 'B组第2轮：超能陆战队vs进击的巨人', '超能陆战队', 6, 2, 'CP2023010', '陈平', '1/4决赛：燃烧吧少年vs超能陆战队', '2026-03-14 10:00:00', '2022010010016', '慕容紫英', '是', '');
INSERT INTO `jinjishenqing` VALUES (5, '2026-01-29 08:15:50', 'C组第3轮：燃烧吧少年vs钢铁洪流', '燃烧吧少年', 9, 1, 'CP2023007', '郑直', '1/4决赛：燃烧吧少年vs超能陆战队', '2026-03-14 10:00:00', '2022010010025', '周杰伦', '是', '');
INSERT INTO `jinjishenqing` VALUES (6, '2026-01-29 08:15:50', 'C组第2轮：逆风翻盘队vs钢铁洪流', '逆风翻盘队', 6, 2, 'CP2023006', '吴浩然', '1/4决赛：元气满满队vs逆风翻盘队', '2026-03-14 10:00:00', '2022010010028', '吴彦祖', '是', '');
INSERT INTO `jinjishenqing` VALUES (7, '2026-01-29 08:15:50', 'D组第3轮：星辰大海vs王者荣耀', '王者荣耀', 9, 1, 'CP2023004', '王志刚', '1/4决赛：王者荣耀vs无限火力队', '2026-03-14 10:00:00', '2022010010043', '邓超超', '是', '');
INSERT INTO `jinjishenqing` VALUES (8, '2026-01-29 08:15:50', 'D组第3轮：梦想起航vs传奇之路', '传奇之路', 3, 2, 'CP2023003', '张明远', '1/4决赛：烈焰冲锋队vs传奇之路', '2026-03-14 10:00:00', '2022010010046', '赵丽颖', '是', '');

-- ----------------------------
-- Table structure for lanqiusaishi
-- ----------------------------
DROP TABLE IF EXISTS `lanqiusaishi`;
CREATE TABLE `lanqiusaishi`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `saishimingcheng` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '赛事名称',
  `fengmian` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '封面',
  `bisaichangdi` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '比赛场地',
  `bisaishijian` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '比赛时间',
  `bisaisaizhi` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '比赛赛制',
  `bisaiguize` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '比赛规则',
  `bisaisaicheng` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '比赛赛程',
  `storeup_number` int(11) NULL DEFAULT 0 COMMENT '收藏数',
  `discuss_number` int(11) NULL DEFAULT 0 COMMENT '评论数',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 33 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '篮球赛事' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of lanqiusaishi
-- ----------------------------
INSERT INTO `lanqiusaishi` VALUES (1, '2026-01-29 08:15:50', 'A组第1轮：烈焰冲锋队vs极速闪电团', 'file/saishi (1).jpg', '中心体育馆1号场', '2024年3月1日 14:00', '小组赛单循环', '三人篮球', 'A组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (2, '2026-01-29 08:15:50', 'A组第1轮：无限火力队vs青春风暴', 'file/saishi (2).jpg', '中心体育馆2号场', '2024年3月1日 15:30', '小组赛单循环', '三人篮球', 'A组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (3, '2026-01-29 08:15:50', 'A组第2轮：烈焰冲锋队vs无限火力队', 'file/saishi (3).jpg', '中心体育馆1号场', '2024年3月2日 14:00', '小组赛单循环', '三人篮球', 'A组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (4, '2026-01-29 08:15:50', 'A组第2轮：极速闪电团vs青春风暴', 'file/saishi (4).jpg', '中心体育馆2号场', '2024年3月2日 15:30', '小组赛单循环', '三人篮球', 'A组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (5, '2026-01-29 08:15:50', 'A组第3轮：烈焰冲锋队vs青春风暴', 'file/saishi (5).jpg', '中心体育馆1号场', '2024年3月3日 14:00', '小组赛单循环', '三人篮球', 'A组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (6, '2026-01-29 08:15:50', 'A组第3轮：极速闪电团vs无限火力队', 'file/saishi (6).jpg', '中心体育馆2号场', '2024年3月3日 15:30', '小组赛单循环', '三人篮球', 'A组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (7, '2026-01-29 08:15:50', 'B组第1轮：快乐星球vs超能陆战队', 'file/saishi (7).jpg', '体育中心3号场', '2024年3月1日 14:00', '小组赛单循环', '三人篮球', 'B组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (8, '2026-01-29 08:15:50', 'B组第1轮：元气满满队vs进击的巨人', 'file/saishi (8).jpg', '体育中心4号场', '2024年3月1日 15:30', '小组赛单循环', '三人篮球', 'B组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (9, '2026-01-29 08:15:50', 'B组第2轮：快乐星球vs元气满满队', 'file/saishi (9).jpg', '体育中心3号场', '2024年3月2日 14:00', '小组赛单循环', '三人篮球', 'B组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (10, '2026-01-29 08:15:50', 'B组第2轮：超能陆战队vs进击的巨人', 'file/saishi (10).jpg', '体育中心4号场', '2024年3月2日 15:30', '小组赛单循环', '三人篮球', 'B组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (11, '2026-01-29 08:15:50', 'B组第3轮：快乐星球vs进击的巨人', 'file/saishi (11).jpg', '体育中心3号场', '2024年3月3日 14:00', '小组赛单循环', '三人篮球', 'B组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (12, '2026-01-29 08:15:50', 'B组第3轮：超能陆战队vs元气满满队', 'file/saishi (12).jpg', '体育中心4号场', '2024年3月3日 15:30', '小组赛单循环', '三人篮球', 'B组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (13, '2026-01-29 08:15:50', 'C组第1轮：燃烧吧少年vs逆风翻盘队', 'file/saishi (13).jpg', '大学城体育馆1号场', '2024年3月4日 14:00', '小组赛单循环', '三人篮球', 'C组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (14, '2026-01-29 08:15:50', 'C组第1轮：雷霆战将vs钢铁洪流', 'file/saishi (14).jpg', '大学城体育馆2号场', '2024年3月4日 15:30', '小组赛单循环', '三人篮球', 'C组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (15, '2026-01-29 08:15:50', 'C组第2轮：燃烧吧少年vs雷霆战将', 'file/saishi (15).jpg', '大学城体育馆1号场', '2024年3月5日 14:00', '小组赛单循环', '三人篮球', 'C组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (16, '2026-01-29 08:15:50', 'C组第2轮：逆风翻盘队vs钢铁洪流', 'file/saishi (16).jpg', '大学城体育馆2号场', '2024年3月5日 15:30', '小组赛单循环', '三人篮球', 'C组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (17, '2026-01-29 08:15:50', 'C组第3轮：燃烧吧少年vs钢铁洪流', 'file/saishi (17).jpg', '大学城体育馆1号场', '2024年3月6日 14:00', '小组赛单循环', '三人篮球', 'C组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (18, '2026-01-29 08:15:50', 'C组第3轮：逆风翻盘队vs雷霆战将', 'file/saishi (18).jpg', '大学城体育馆2号场', '2024年3月6日 15:30', '小组赛单循环', '三人篮球', 'C组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (19, '2026-01-29 08:15:50', 'D组第1轮：梦想起航vs星辰大海', 'file/saishi (19).jpg', '新区体育中心1号场', '2024年3月4日 14:00', '小组赛单循环', '三人篮球', 'D组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (20, '2026-01-29 08:15:50', 'D组第1轮：王者荣耀vs传奇之路', 'file/saishi (20).jpg', '新区体育中心2号场', '2024年3月4日 15:30', '小组赛单循环', '三人篮球', 'D组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (21, '2026-01-29 08:15:50', 'D组第2轮：梦想起航vs王者荣耀', 'file/saishi (21).jpg', '新区体育中心1号场', '2024年3月5日 14:00', '小组赛单循环', '三人篮球', 'D组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (22, '2026-01-29 08:15:50', 'D组第2轮：星辰大海vs传奇之路', 'file/saishi (22).jpg', '新区体育中心2号场', '2024年3月5日 15:30', '小组赛单循环', '三人篮球', 'D组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (23, '2026-01-29 08:15:50', 'D组第3轮：梦想起航vs传奇之路', 'file/saishi (23).jpg', '新区体育中心1号场', '2024年3月6日 14:00', '小组赛单循环', '三人篮球', 'D组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (24, '2026-01-29 08:15:50', 'D组第3轮：星辰大海vs王者荣耀', 'file/saishi (24).jpg', '新区体育中心2号场', '2024年3月6日 15:30', '小组赛单循环', '三人篮球', 'D组赛程', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (25, '2026-01-29 08:15:50', '1/4决赛：烈焰冲锋队vs传奇之路', 'file/saishi (25).jpg', '市体育中心主馆', '2024年3月15日 14:00', '淘汰赛', '三人篮球', '1/4决赛', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (26, '2026-01-29 08:15:50', '1/4决赛：元气满满队vs逆风翻盘队', 'file/saishi (26).jpg', '市体育中心主馆', '2024年3月15日 16:00', '淘汰赛', '三人篮球', '1/4决赛', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (27, '2026-01-29 08:15:50', '1/4决赛：燃烧吧少年vs超能陆战队', 'file/saishi (27).jpg', '市体育中心主馆', '2024年3月16日 14:00', '淘汰赛', '三人篮球', '1/4决赛', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (28, '2026-01-29 08:15:50', '1/4决赛：王者荣耀vs无限火力队', 'file/saishi (28).jpg', '市体育中心主馆', '2024年3月16日 16:00', '淘汰赛', '三人篮球', '1/4决赛', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (29, '2026-01-29 08:15:50', '半决赛：传奇之路vs元气满满队', 'file/saishi (29).jpg', '市体育中心主馆', '2024年3月22日 14:00', '淘汰赛', '三人篮球', '半决赛', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (30, '2026-01-29 08:15:50', '半决赛：燃烧吧少年vs王者荣耀', 'file/saishi (30).jpg', '市体育中心主馆', '2024年3月22日 16:00', '淘汰赛', '三人篮球', '半决赛', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (31, '2026-01-29 08:15:50', '季军赛：传奇之路vs燃烧吧少年', 'file/1770018437027.jpg', '市体育中心主馆', '2024年3月29日 14:00', '淘汰赛', '三人篮球', '<p>季军赛</p>', 0, 0);
INSERT INTO `lanqiusaishi` VALUES (32, '2026-01-29 08:15:50', '总决赛：元气满满队vs王者荣耀', 'file/saishi (32).jpg', '市体育中心主馆', '2024年3月29日 16:00', '淘汰赛', '三人篮球', '总决赛', 0, 0);

-- ----------------------------
-- Table structure for menu
-- ----------------------------
DROP TABLE IF EXISTS `menu`;
CREATE TABLE `menu`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `menujson` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '菜单',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 2 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '菜单' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of menu
-- ----------------------------
INSERT INTO `menu` VALUES (1, '2026-01-29 16:15:51', '[{\"backMenu\":[{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"appFrontIcon\":\"cuIcon-brand\",\"buttons\":[\"查看\",\"删除\"],\"classname\":\"storeup\",\"menu\":\"我的收藏\",\"menuJump\":\"1\",\"tableName\":\"storeup\"}],\"fontClass\":\"icon-common3\",\"menu\":\"我的收藏管理\",\"unicode\":\"&#xeda5;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"审核\",\"结果\"],\"appFrontIcon\":\"cuIcon-link\",\"buttons\":[\"查看\"],\"classname\":\"jinjishenqing\",\"menu\":\"晋级申请\",\"menuJump\":\"列表\",\"tableName\":\"jinjishenqing\"}],\"fontClass\":\"icon-common13\",\"menu\":\"晋级申请管理\",\"unicode\":\"&#xedf7;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"审核\"],\"appFrontIcon\":\"cuIcon-goodsnew\",\"buttons\":[\"查看\",\"修改\",\"删除\"],\"classname\":\"jiaruqiudui\",\"menu\":\"加入球队\",\"menuJump\":\"列表\",\"tableName\":\"jiaruqiudui\"}],\"fontClass\":\"icon-common15\",\"menu\":\"加入球队管理\",\"unicode\":\"&#xedfc;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"appFrontIcon\":\"cuIcon-discover\",\"buttons\":[\"查看\"],\"classname\":\"jingsairicheng\",\"menu\":\"竞赛日程\",\"menuJump\":\"列表\",\"tableName\":\"jingsairicheng\"}],\"fontClass\":\"icon-common18\",\"menu\":\"竞赛日程管理\",\"unicode\":\"&#xedff;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"申请\"],\"appFrontIcon\":\"cuIcon-album\",\"buttons\":[\"查看\"],\"classname\":\"bisaichengji\",\"menu\":\"比赛成绩\",\"menuJump\":\"列表\",\"tableName\":\"bisaichengji\"}],\"fontClass\":\"icon-common8\",\"menu\":\"比赛成绩管理\",\"unicode\":\"&#xedb6;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"appFrontIcon\":\"cuIcon-news\",\"buttons\":[\"查看\",\"修改\",\"删除\"],\"classname\":\"forum\",\"menu\":\"我的发布\",\"menuJump\":\"14\",\"tableName\":\"forum\"}],\"fontClass\":\"icon-common40\",\"menu\":\"互动交流管理\",\"unicode\":\"&#xeebb;\"}],\"frontMenu\":[{\"child\":[{\"appFrontIcon\":\"cuIcon-camera\",\"buttons\":[\"查看\",\"新增\",\"查看评论\"],\"classname\":\"forum\",\"fontClass\":\"icon-common18\",\"menu\":\"互动交流\",\"menuJump\":\"列表\",\"tableName\":\"forum\",\"unicode\":\"&#xedff;\"}],\"fontClass\":\"icon-common18\",\"menu\":\"互动交流\",\"unicode\":\"&#xedff;\"},{\"child\":[{\"appFrontIcon\":\"cuIcon-wenzi\",\"buttons\":[\"查看\",\"查看评论\"],\"classname\":\"lanqiusaishi\",\"menu\":\"篮球赛事\",\"menuJump\":\"列表\",\"tableName\":\"lanqiusaishi\"}],\"menu\":\"篮球赛事管理\"},{\"child\":[{\"appFrontIcon\":\"cuIcon-goods\",\"buttons\":[\"查看\",\"查看评论\",\"申请加入\"],\"classname\":\"qiuduipaixingbang\",\"menu\":\"球队排行榜\",\"menuJump\":\"列表\",\"tableName\":\"qiuduipaixingbang\"}],\"menu\":\"球队排行榜管理\"},{\"child\":[{\"appFrontIcon\":\"cuIcon-vip\",\"buttons\":[\"查看\",\"比赛技术统计\"],\"classname\":\"bisaijishutongji\",\"menu\":\"比赛技术统计\",\"menuJump\":\"列表\",\"tableName\":\"bisaijishutongji\"}],\"menu\":\"比赛技术统计管理\"}],\"hasBackLogin\":\"否\",\"hasBackRegister\":\"否\",\"hasFrontLogin\":\"是\",\"hasFrontRegister\":\"是\",\"pathName\":\"cansaixuesheng\",\"roleName\":\"参赛学生\",\"tableName\":\"cansaixuesheng\"},{\"backMenu\":[{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"比赛技术统计\",\"首页总数\",\"首页统计\"],\"appFrontIcon\":\"cuIcon-full\",\"buttons\":[\"查看\",\"比赛技术统计\"],\"classname\":\"bisaijishutongji\",\"menu\":\"比赛技术统计\",\"menuJump\":\"列表\",\"tableName\":\"bisaijishutongji\"}],\"fontClass\":\"icon-common43\",\"menu\":\"比赛技术统计管理\",\"unicode\":\"&#xef27;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"查看评论\",\"报名\"],\"appFrontIcon\":\"cuIcon-flashlightopen\",\"buttons\":[\"查看\",\"查看评论\",\"报名\"],\"classname\":\"lanqiusaishi\",\"menu\":\"篮球赛事\",\"menuJump\":\"列表\",\"tableName\":\"lanqiusaishi\"}],\"fontClass\":\"icon-common10\",\"menu\":\"篮球赛事管理\",\"unicode\":\"&#xedd1;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"审核\",\"结果\"],\"appFrontIcon\":\"cuIcon-link\",\"buttons\":[\"查看\",\"修改\",\"删除\"],\"classname\":\"jinjishenqing\",\"menu\":\"晋级申请\",\"menuJump\":\"列表\",\"tableName\":\"jinjishenqing\"}],\"fontClass\":\"icon-common13\",\"menu\":\"晋级申请管理\",\"unicode\":\"&#xedf7;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"审核\",\"日程\",\"记录\",\"成绩\"],\"appFrontIcon\":\"cuIcon-flashlightopen\",\"buttons\":[\"查看\",\"修改\",\"删除\",\"日程\"],\"classname\":\"bisaibaoming\",\"menu\":\"比赛报名\",\"menuJump\":\"列表\",\"tableName\":\"bisaibaoming\"}],\"fontClass\":\"icon-common25\",\"menu\":\"比赛报名管理\",\"unicode\":\"&#xee09;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"审核\"],\"appFrontIcon\":\"cuIcon-goodsnew\",\"buttons\":[\"查看\",\"修改\",\"删除\",\"审核\"],\"classname\":\"jiaruqiudui\",\"menu\":\"加入球队\",\"menuJump\":\"列表\",\"tableName\":\"jiaruqiudui\"}],\"fontClass\":\"icon-common15\",\"menu\":\"加入球队管理\",\"unicode\":\"&#xedfc;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"appFrontIcon\":\"cuIcon-clothes\",\"buttons\":[\"查看\"],\"classname\":\"jinjibisaijieguo\",\"menu\":\"晋级比赛结果\",\"menuJump\":\"列表\",\"tableName\":\"jinjibisaijieguo\"}],\"fontClass\":\"icon-common45\",\"menu\":\"晋级比赛结果管理\",\"unicode\":\"&#xef3b;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"appFrontIcon\":\"cuIcon-discover\",\"buttons\":[\"查看\",\"修改\",\"删除\"],\"classname\":\"jingsairicheng\",\"menu\":\"竞赛日程\",\"menuJump\":\"列表\",\"tableName\":\"jingsairicheng\"}],\"fontClass\":\"icon-common18\",\"menu\":\"竞赛日程管理\",\"unicode\":\"&#xedff;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"申请\"],\"appFrontIcon\":\"cuIcon-album\",\"buttons\":[\"查看\",\"申请\"],\"classname\":\"bisaichengji\",\"menu\":\"比赛成绩\",\"menuJump\":\"列表\",\"tableName\":\"bisaichengji\"}],\"fontClass\":\"icon-common8\",\"menu\":\"比赛成绩管理\",\"unicode\":\"&#xedb6;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"审核\",\"查看评论\",\"申请加入\"],\"appFrontIcon\":\"cuIcon-link\",\"buttons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"查看评论\"],\"classname\":\"qiuduipaixingbang\",\"menu\":\"球队排行榜\",\"menuJump\":\"列表\",\"tableName\":\"qiuduipaixingbang\"}],\"fontClass\":\"icon-common14\",\"menu\":\"球队排行榜管理\",\"unicode\":\"&#xedfb;\"}],\"frontMenu\":[{\"child\":[{\"appFrontIcon\":\"cuIcon-camera\",\"buttons\":[\"查看\",\"新增\",\"查看评论\"],\"classname\":\"forum\",\"fontClass\":\"icon-common18\",\"menu\":\"互动交流\",\"menuJump\":\"列表\",\"tableName\":\"forum\",\"unicode\":\"&#xedff;\"}],\"fontClass\":\"icon-common18\",\"menu\":\"互动交流\",\"unicode\":\"&#xedff;\"},{\"child\":[{\"appFrontIcon\":\"cuIcon-wenzi\",\"buttons\":[\"查看\",\"查看评论\"],\"classname\":\"lanqiusaishi\",\"menu\":\"篮球赛事\",\"menuJump\":\"列表\",\"tableName\":\"lanqiusaishi\"}],\"menu\":\"篮球赛事管理\"},{\"child\":[{\"appFrontIcon\":\"cuIcon-goods\",\"buttons\":[\"查看\",\"查看评论\",\"申请加入\"],\"classname\":\"qiuduipaixingbang\",\"menu\":\"球队排行榜\",\"menuJump\":\"列表\",\"tableName\":\"qiuduipaixingbang\"}],\"menu\":\"球队排行榜管理\"},{\"child\":[{\"appFrontIcon\":\"cuIcon-vip\",\"buttons\":[\"查看\",\"比赛技术统计\"],\"classname\":\"bisaijishutongji\",\"menu\":\"比赛技术统计\",\"menuJump\":\"列表\",\"tableName\":\"bisaijishutongji\"}],\"menu\":\"比赛技术统计管理\"}],\"hasBackLogin\":\"是\",\"hasBackRegister\":\"是\",\"hasFrontLogin\":\"否\",\"hasFrontRegister\":\"否\",\"pathName\":\"qiuduiduizhang\",\"roleName\":\"球队队长\",\"tableName\":\"qiuduiduizhang\"},{\"backMenu\":[{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"审核\",\"日程\",\"记录\",\"成绩\"],\"appFrontIcon\":\"cuIcon-flashlightopen\",\"buttons\":[\"查看\",\"记录\",\"成绩\"],\"classname\":\"bisaibaoming\",\"menu\":\"比赛报名\",\"menuJump\":\"列表\",\"tableName\":\"bisaibaoming\"}],\"fontClass\":\"icon-common25\",\"menu\":\"比赛报名管理\",\"unicode\":\"&#xee09;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"appFrontIcon\":\"cuIcon-clothes\",\"buttons\":[\"查看\",\"修改\",\"删除\"],\"classname\":\"jinjibisaijieguo\",\"menu\":\"晋级比赛结果\",\"menuJump\":\"列表\",\"tableName\":\"jinjibisaijieguo\"}],\"fontClass\":\"icon-common45\",\"menu\":\"晋级比赛结果管理\",\"unicode\":\"&#xef3b;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"比赛技术统计\",\"首页总数\",\"首页统计\"],\"appFrontIcon\":\"cuIcon-full\",\"buttons\":[\"查看\",\"修改\",\"删除\"],\"classname\":\"bisaijishutongji\",\"menu\":\"比赛技术统计\",\"menuJump\":\"列表\",\"tableName\":\"bisaijishutongji\"}],\"fontClass\":\"icon-common43\",\"menu\":\"比赛技术统计管理\",\"unicode\":\"&#xef27;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"审核\",\"结果\"],\"appFrontIcon\":\"cuIcon-link\",\"buttons\":[\"查看\",\"结果\"],\"classname\":\"jinjishenqing\",\"menu\":\"晋级申请\",\"menuJump\":\"列表\",\"tableName\":\"jinjishenqing\"}],\"fontClass\":\"icon-common13\",\"menu\":\"晋级申请管理\",\"unicode\":\"&#xedf7;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"申请\"],\"appFrontIcon\":\"cuIcon-album\",\"buttons\":[\"查看\",\"修改\",\"删除\"],\"classname\":\"bisaichengji\",\"menu\":\"比赛成绩\",\"menuJump\":\"列表\",\"tableName\":\"bisaichengji\"}],\"fontClass\":\"icon-common8\",\"menu\":\"比赛成绩管理\",\"unicode\":\"&#xedb6;\"}],\"frontMenu\":[{\"child\":[{\"appFrontIcon\":\"cuIcon-camera\",\"buttons\":[\"查看\",\"新增\",\"查看评论\"],\"classname\":\"forum\",\"fontClass\":\"icon-common18\",\"menu\":\"互动交流\",\"menuJump\":\"列表\",\"tableName\":\"forum\",\"unicode\":\"&#xedff;\"}],\"fontClass\":\"icon-common18\",\"menu\":\"互动交流\",\"unicode\":\"&#xedff;\"},{\"child\":[{\"appFrontIcon\":\"cuIcon-wenzi\",\"buttons\":[\"查看\",\"查看评论\"],\"classname\":\"lanqiusaishi\",\"menu\":\"篮球赛事\",\"menuJump\":\"列表\",\"tableName\":\"lanqiusaishi\"}],\"menu\":\"篮球赛事管理\"},{\"child\":[{\"appFrontIcon\":\"cuIcon-goods\",\"buttons\":[\"查看\",\"查看评论\",\"申请加入\"],\"classname\":\"qiuduipaixingbang\",\"menu\":\"球队排行榜\",\"menuJump\":\"列表\",\"tableName\":\"qiuduipaixingbang\"}],\"menu\":\"球队排行榜管理\"},{\"child\":[{\"appFrontIcon\":\"cuIcon-vip\",\"buttons\":[\"查看\",\"比赛技术统计\"],\"classname\":\"bisaijishutongji\",\"menu\":\"比赛技术统计\",\"menuJump\":\"列表\",\"tableName\":\"bisaijishutongji\"}],\"menu\":\"比赛技术统计管理\"}],\"hasBackLogin\":\"是\",\"hasBackRegister\":\"否\",\"hasFrontLogin\":\"否\",\"hasFrontRegister\":\"否\",\"pathName\":\"caipanyuan\",\"roleName\":\"裁判员\",\"tableName\":\"caipanyuan\"},{\"backMenu\":[{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"审核\"],\"appFrontIcon\":\"cuIcon-full\",\"buttons\":[\"查看\",\"修改\",\"删除\",\"审核\"],\"classname\":\"qiuduiduizhang\",\"menu\":\"球队队长\",\"menuJump\":\"列表\",\"tableName\":\"qiuduiduizhang\"}],\"fontClass\":\"icon-user3\",\"menu\":\"球队队长管理\",\"unicode\":\"&#xef99;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"appFrontIcon\":\"cuIcon-pic\",\"buttons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"classname\":\"forumReport\",\"menu\":\"论坛举报\",\"menuJump\":\"列表\",\"tableName\":\"forum_report\"}],\"fontClass\":\"icon-common36\",\"menu\":\"论坛举报管理\",\"unicode\":\"&#xee9f;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"appFrontIcon\":\"cuIcon-clothes\",\"buttons\":[\"查看\",\"修改\",\"删除\"],\"classname\":\"jinjibisaijieguo\",\"menu\":\"晋级比赛结果\",\"menuJump\":\"列表\",\"tableName\":\"jinjibisaijieguo\"}],\"fontClass\":\"icon-common45\",\"menu\":\"晋级比赛结果管理\",\"unicode\":\"&#xef3b;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"比赛技术统计\",\"首页总数\",\"首页统计\"],\"appFrontIcon\":\"cuIcon-full\",\"buttons\":[\"查看\",\"修改\",\"删除\",\"首页总数\",\"首页统计\"],\"classname\":\"bisaijishutongji\",\"menu\":\"比赛技术统计\",\"menuJump\":\"列表\",\"tableName\":\"bisaijishutongji\"}],\"fontClass\":\"icon-common43\",\"menu\":\"比赛技术统计管理\",\"unicode\":\"&#xef27;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"appFrontIcon\":\"cuIcon-list\",\"buttons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"classname\":\"caipanyuan\",\"menu\":\"裁判员\",\"menuJump\":\"列表\",\"tableName\":\"caipanyuan\"}],\"fontClass\":\"icon-user3\",\"menu\":\"裁判员管理\",\"unicode\":\"&#xef99;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"查看评论\",\"报名\"],\"appFrontIcon\":\"cuIcon-flashlightopen\",\"buttons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"查看评论\"],\"classname\":\"lanqiusaishi\",\"menu\":\"篮球赛事\",\"menuJump\":\"列表\",\"tableName\":\"lanqiusaishi\"}],\"fontClass\":\"icon-common10\",\"menu\":\"篮球赛事管理\",\"unicode\":\"&#xedd1;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"appFrontIcon\":\"cuIcon-shop\",\"buttons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"classname\":\"config\",\"menu\":\"轮播图\",\"menuJump\":\"列表\",\"tableName\":\"config\"}],\"fontClass\":\"icon-common15\",\"menu\":\"轮播图管理\",\"unicode\":\"&#xedfc;\"},{\"child\":[{\"allButtons\":[\"查看\",\"修改\"],\"appFrontIcon\":\"cuIcon-form\",\"buttons\":[\"查看\",\"修改\"],\"classname\":\"sensitiveWord\",\"menu\":\"敏感词\",\"menuJump\":\"列表\",\"tableName\":\"sensitive_word\"}],\"fontClass\":\"icon-common14\",\"menu\":\"敏感词管理\",\"unicode\":\"&#xedfb;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"appFrontIcon\":\"cuIcon-qrcode\",\"buttons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"classname\":\"forumType\",\"menu\":\"论坛类型\",\"menuJump\":\"列表\",\"tableName\":\"forum_type\"}],\"fontClass\":\"icon-common37\",\"menu\":\"论坛类型管理\",\"unicode\":\"&#xeea4;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"审核\",\"结果\"],\"appFrontIcon\":\"cuIcon-link\",\"buttons\":[\"查看\",\"修改\",\"删除\",\"审核\"],\"classname\":\"jinjishenqing\",\"menu\":\"晋级申请\",\"menuJump\":\"列表\",\"tableName\":\"jinjishenqing\"}],\"fontClass\":\"icon-common13\",\"menu\":\"晋级申请管理\",\"unicode\":\"&#xedf7;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"审核\"],\"appFrontIcon\":\"cuIcon-goodsnew\",\"buttons\":[\"查看\",\"修改\",\"删除\"],\"classname\":\"jiaruqiudui\",\"menu\":\"加入球队\",\"menuJump\":\"列表\",\"tableName\":\"jiaruqiudui\"}],\"fontClass\":\"icon-common15\",\"menu\":\"加入球队管理\",\"unicode\":\"&#xedfc;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"审核\",\"日程\",\"记录\",\"成绩\"],\"appFrontIcon\":\"cuIcon-flashlightopen\",\"buttons\":[\"查看\",\"修改\",\"删除\",\"审核\"],\"classname\":\"bisaibaoming\",\"menu\":\"比赛报名\",\"menuJump\":\"列表\",\"tableName\":\"bisaibaoming\"}],\"fontClass\":\"icon-common25\",\"menu\":\"比赛报名管理\",\"unicode\":\"&#xee09;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"学生数量统计\",\"首页总数\",\"首页统计\"],\"appFrontIcon\":\"cuIcon-brand\",\"buttons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"首页总数\",\"首页统计\"],\"classname\":\"cansaixuesheng\",\"menu\":\"参赛学生\",\"menuJump\":\"列表\",\"tableName\":\"cansaixuesheng\"}],\"fontClass\":\"icon-user2\",\"menu\":\"参赛学生管理\",\"unicode\":\"&#xef98;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"申请\"],\"appFrontIcon\":\"cuIcon-album\",\"buttons\":[\"查看\",\"修改\",\"删除\"],\"classname\":\"bisaichengji\",\"menu\":\"比赛成绩\",\"menuJump\":\"列表\",\"tableName\":\"bisaichengji\"}],\"fontClass\":\"icon-common8\",\"menu\":\"比赛成绩管理\",\"unicode\":\"&#xedb6;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"论坛活跃度统计\",\"发帖量统计\",\"首页总数\",\"首页统计\",\"查看评论\"],\"appFrontIcon\":\"cuIcon-news\",\"buttons\":[\"查看\",\"修改\",\"删除\",\"查看评论\",\"首页总数\",\"首页统计\"],\"classname\":\"forum\",\"menu\":\"互动交流\",\"tableName\":\"forum\"}],\"fontClass\":\"icon-common40\",\"menu\":\"互动交流管理\",\"unicode\":\"&#xeebb;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\",\"审核\",\"查看评论\",\"申请加入\"],\"appFrontIcon\":\"cuIcon-link\",\"buttons\":[\"查看\",\"修改\",\"删除\",\"审核\",\"查看评论\"],\"classname\":\"qiuduipaixingbang\",\"menu\":\"球队排行榜\",\"menuJump\":\"列表\",\"tableName\":\"qiuduipaixingbang\"}],\"fontClass\":\"icon-common14\",\"menu\":\"球队排行榜管理\",\"unicode\":\"&#xedfb;\"},{\"child\":[{\"allButtons\":[\"新增\",\"查看\",\"修改\",\"删除\"],\"appFrontIcon\":\"cuIcon-discover\",\"buttons\":[\"查看\",\"删除\"],\"classname\":\"jingsairicheng\",\"menu\":\"竞赛日程\",\"menuJump\":\"列表\",\"tableName\":\"jingsairicheng\"}],\"fontClass\":\"icon-common18\",\"menu\":\"竞赛日程管理\",\"unicode\":\"&#xedff;\"}],\"frontMenu\":[{\"child\":[{\"appFrontIcon\":\"cuIcon-camera\",\"buttons\":[\"查看\",\"新增\",\"查看评论\"],\"classname\":\"forum\",\"fontClass\":\"icon-common18\",\"menu\":\"互动交流\",\"menuJump\":\"列表\",\"tableName\":\"forum\",\"unicode\":\"&#xedff;\"}],\"fontClass\":\"icon-common18\",\"menu\":\"互动交流\",\"unicode\":\"&#xedff;\"},{\"child\":[{\"appFrontIcon\":\"cuIcon-wenzi\",\"buttons\":[\"查看\",\"查看评论\"],\"classname\":\"lanqiusaishi\",\"menu\":\"篮球赛事\",\"menuJump\":\"列表\",\"tableName\":\"lanqiusaishi\"}],\"menu\":\"篮球赛事管理\"},{\"child\":[{\"appFrontIcon\":\"cuIcon-goods\",\"buttons\":[\"查看\",\"查看评论\",\"申请加入\"],\"classname\":\"qiuduipaixingbang\",\"menu\":\"球队排行榜\",\"menuJump\":\"列表\",\"tableName\":\"qiuduipaixingbang\"}],\"menu\":\"球队排行榜管理\"},{\"child\":[{\"appFrontIcon\":\"cuIcon-vip\",\"buttons\":[\"查看\",\"比赛技术统计\"],\"classname\":\"bisaijishutongji\",\"menu\":\"比赛技术统计\",\"menuJump\":\"列表\",\"tableName\":\"bisaijishutongji\"}],\"menu\":\"比赛技术统计管理\"}],\"hasBackLogin\":\"是\",\"hasBackRegister\":\"否\",\"hasFrontLogin\":\"否\",\"hasFrontRegister\":\"否\",\"pathName\":\"users\",\"roleName\":\"管理员\",\"tableName\":\"users\"}]');

-- ----------------------------
-- Table structure for qiuduiduizhang
-- ----------------------------
DROP TABLE IF EXISTS `qiuduiduizhang`;
CREATE TABLE `qiuduiduizhang`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `duizhangzhanghao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '队长账号',
  `duizhangxingming` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '队长姓名',
  `mima` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '密码',
  `zhaopian` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '照片',
  `xingbie` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '性别',
  `dianhua` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '电话',
  `sfsh` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT '待审核' COMMENT '是否审核',
  `shhf` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '回复内容',
  `qiuduimingcheng` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '球队名称',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `duizhangzhanghao`(`duizhangzhanghao`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 17 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '球队队长' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of qiuduiduizhang
-- ----------------------------
INSERT INTO `qiuduiduizhang` VALUES (1, '2026-01-29 08:15:50', '2022010010001', '张浩然', '123456', 'file/dz_ (1).jpg', '男', '13800001001', '是', '', '烈焰冲锋队');
INSERT INTO `qiuduiduizhang` VALUES (2, '2026-01-29 08:15:50', '2022010010004', '李梓涵', '123456', 'file/dz_ (2).jpg', '男', '13800001004', '是', '', '极速闪电团');
INSERT INTO `qiuduiduizhang` VALUES (3, '2026-01-29 08:15:50', '2022010010007', '王伟泽', '123456', 'file/dz_ (3).jpg', '男', '13800001007', '是', '', '无限火力队');
INSERT INTO `qiuduiduizhang` VALUES (4, '2026-01-29 08:15:50', '2022010010010', '刘诗诗', '123456', 'file/dz_ (4).jpg', '女', '13800001010', '是', '', '青春风暴');
INSERT INTO `qiuduiduizhang` VALUES (5, '2026-01-29 08:15:50', '2022010010013', '陈明轩', '123456', 'file/dz_ (5).jpg', '男', '13800001013', '是', '', '快乐星球');
INSERT INTO `qiuduiduizhang` VALUES (6, '2026-01-29 08:15:50', '2022010010016', '慕容紫英', '123456', 'file/dz_ (6).jpg', '女', '13800001016', '是', '', '超能陆战队');
INSERT INTO `qiuduiduizhang` VALUES (7, '2026-01-29 08:15:50', '2022010010019', '赵子龙', '123456', 'file/dz_ (7).jpg', '男', '13800001019', '是', '', '元气满满队');
INSERT INTO `qiuduiduizhang` VALUES (8, '2026-01-29 08:15:50', '2022010010022', '孙小美', '123456', 'file/dz_ (8).jpg', '女', '13800001022', '是', '', '进击的巨人');
INSERT INTO `qiuduiduizhang` VALUES (9, '2026-01-29 08:15:50', '2022010010025', '周杰伦', '123456', 'file/dz_ (9).jpg', '男', '13800001025', '是', '', '燃烧吧少年');
INSERT INTO `qiuduiduizhang` VALUES (10, '2026-01-29 08:15:50', '2022010010028', '吴彦祖', '123456', 'file/dz_ (10).jpg', '男', '13800001028', '是', '', '逆风翻盘队');
INSERT INTO `qiuduiduizhang` VALUES (11, '2026-01-29 08:15:50', '2022010010031', '郑爽爽', '123456', 'file/dz_ (11).jpg', '女', '13800001031', '是', '', '雷霆战将');
INSERT INTO `qiuduiduizhang` VALUES (12, '2026-01-29 08:15:50', '2022010010034', '林志颖', '123456', 'file/dz_ (12).jpg', '男', '13800001034', '是', '', '钢铁洪流');
INSERT INTO `qiuduiduizhang` VALUES (13, '2026-01-29 08:15:50', '2022010010037', '黄晓明', '123456', 'file/dz_ (13).jpg', '男', '13800001037', '是', '', '梦想起航');
INSERT INTO `qiuduiduizhang` VALUES (14, '2026-01-29 08:15:50', '2022010010040', '杨幂幂', '123456', 'file/dz_ (14).jpg', '女', '13800001040', '是', '', '星辰大海');
INSERT INTO `qiuduiduizhang` VALUES (15, '2026-01-29 08:15:50', '2022010010043', '邓超超', '123456', 'file/dz_ (15).jpg', '男', '13800001043', '是', '', '王者荣耀');
INSERT INTO `qiuduiduizhang` VALUES (16, '2026-01-29 08:15:50', '2022010010046', '赵丽颖', '123456', 'file/dz_ (16).jpg', '女', '13800001046', '是', '', '传奇之路');

-- ----------------------------
-- Table structure for qiuduipaixingbang
-- ----------------------------
DROP TABLE IF EXISTS `qiuduipaixingbang`;
CREATE TABLE `qiuduipaixingbang`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `jiaolianmingcheng` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '教练名称',
  `qiuduimingcheng` varchar(16) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '球队名称',
  `qiuduilogo` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '球队logo',
  `qiuyi` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '球衣',
  `qiuyuanrenshu` int(11) NULL DEFAULT NULL COMMENT '球员人数',
  `jifen` int(11) NULL DEFAULT NULL COMMENT '积分',
  `sheng` int(11) NULL DEFAULT NULL COMMENT '胜',
  `fu` int(11) NULL DEFAULT NULL COMMENT '负',
  `ping` int(11) NULL DEFAULT NULL COMMENT '平',
  `shenglv` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '胜率',
  `shifouzaizhaomu` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '是否在招募',
  `chuanglishijian` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '创立时间',
  `qiuduikouhao` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '球队口号',
  `qiuyuanmingdan` varchar(32) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '球员名单',
  `qiuduijieshao` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '球队介绍',
  `duizhangzhanghao` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '队长账号',
  `duizhangxingming` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '队长姓名',
  `storeup_number` int(11) NULL DEFAULT NULL COMMENT '收藏数量',
  `discuss_number` int(11) NULL DEFAULT 0 COMMENT '评论数',
  `sfsh` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT '待审核' COMMENT '是否审核',
  `shhf` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL COMMENT '回复内容',
  PRIMARY KEY (`id`) USING BTREE,
  UNIQUE INDEX `qiuduimingcheng`(`qiuduimingcheng`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 17 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '球队排行榜' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of qiuduipaixingbang
-- ----------------------------
INSERT INTO `qiuduipaixingbang` VALUES (1, '2026-01-29 08:15:50', '张浩然', '烈焰冲锋队', 'file/logo (1).jpg', 'file/jersey (1).jpg', 3, 6, 2, 1, 0, '67', '否', '2024年1月', '烈焰如火，冲锋向前', '张浩然、欧阳旭日、司马长空', '<p>烈焰冲锋队是一支充满激情的球队，以快速进攻著称</p>', '2022010010001', '张浩然', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (2, '2026-01-29 08:15:50', '李梓涵', '极速闪电团', 'file/logo (2).jpg', 'file/jersey (2).jpg', 3, 3, 1, 2, 0, '33', '否', '2024年1月', '闪电速度，势不可挡', '李梓涵、上官云珠、诸葛亮亮', '极速闪电团以速度见长，擅长快速反击', '2022010010004', '李梓涵', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (3, '2026-01-29 08:15:50', '王伟泽', '无限火力队', 'file/logo (3).jpg', 'file/jersey (3).jpg', 3, 9, 3, 0, 0, '100', '否', '2024年1月', '火力全开，无限可能', '王伟泽、欧阳震华、慕容冲', '无限火力队进攻火力强大，小组赛第一', '2022010010007', '王伟泽', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (4, '2026-01-29 08:15:50', '刘诗诗', '青春风暴', 'file/logo (4).jpg', 'file/jersey (4).jpg', 3, 0, 0, 3, 0, '0', '否', '2024年1月', '青春无敌，风暴来袭', '刘诗诗、诸葛青云、独孤雨柔', '青春风暴年轻有活力，但经验不足', '2022010010010', '刘诗诗', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (5, '2026-01-29 08:15:50', '陈明轩', '快乐星球', 'file/logo (5).jpg', 'file/jersey (5).jpg', 3, 3, 1, 2, 0, '33', '否', '2024年1月', '快乐篮球，星球大战', '陈明轩、皇甫铁牛、令狐飞', '快乐星球以娱乐为主，比赛风格轻松', '2022010010013', '陈明轩', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (6, '2026-01-29 08:15:50', '慕容紫英', '超能陆战队', 'file/logo (6).jpg', 'file/jersey (6).jpg', 3, 6, 2, 1, 0, '67', '否', '2024年1月', '超能战队，所向披靡', '慕容紫英、诸葛大力、上官婉儿', '超能陆战队攻守平衡，实力强劲', '2022010010016', '慕容紫英', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (7, '2026-01-29 08:15:50', '赵子龙', '元气满满队', 'file/logo (7).jpg', 'file/jersey (7).jpg', 3, 9, 3, 0, 0, '100', '否', '2024年1月', '元气满满，勇往直前', '赵子龙、公孙离离、司马光耀', '元气满满队小组赛全胜，实力强劲', '2022010010019', '赵子龙', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (8, '2026-01-29 08:15:50', '孙小美', '进击的巨人', 'file/logo (8).jpg', 'file/jersey (8).jpg', 3, 0, 0, 3, 0, '0', '否', '2024年1月', '进击巨人，永不言败', '孙小美、独孤求败、欧阳娜娜', '进击的巨人虽然战绩不佳，但斗志昂扬', '2022010010022', '孙小美', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (9, '2026-01-29 08:15:50', '周杰伦', '燃烧吧少年', 'file/logo (9).jpg', 'file/jersey (9).jpg', 3, 9, 3, 0, 0, '100', '否', '2024年1月', '燃烧青春，少年无畏', '周杰伦、尉迟敬德、东方不败', '燃烧吧少年小组赛全胜，进攻犀利', '2022010010025', '周杰伦', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (10, '2026-01-29 08:15:50', '吴彦祖', '逆风翻盘队', 'file/logo (10).jpg', 'file/jersey (10).jpg', 3, 6, 2, 1, 0, '67', '否', '2024年1月', '逆风翻盘，绝地反击', '吴彦祖、令狐冲冲、慕容复', '逆风翻盘队擅长逆境作战', '2022010010028', '吴彦祖', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (11, '2026-01-29 08:15:50', '郑爽爽', '雷霆战将', 'file/logo (11).jpg', 'file/jersey (11).jpg', 3, 3, 1, 2, 0, '33', '否', '2024年1月', '雷霆万钧，战将无敌', '郑爽爽、上官飞燕、诸葛瑾瑾', '雷霆战将以防守见长', '2022010010031', '郑爽爽', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (12, '2026-01-29 08:15:50', '林志颖', '钢铁洪流', 'file/logo (12).jpg', 'file/jersey (12).jpg', 3, 0, 0, 3, 0, '0', '否', '2024年1月', '钢铁洪流，坚不可摧', '林志颖、欧阳锋、司马昭', '钢铁洪流防守稳固但进攻乏力', '2022010010034', '林志颖', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (13, '2026-01-29 08:15:50', '黄晓明', '梦想起航', 'file/logo (13).jpg', 'file/jersey (13).jpg', 3, 3, 1, 2, 0, '33', '否', '2024年1月', '梦想起航，追逐星辰', '黄晓明、皇甫嵩、独孤剑', '梦想起航队充满梦想与激情', '2022010010037', '黄晓明', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (14, '2026-01-29 08:15:50', '杨幂幂', '星辰大海', 'file/logo (14).jpg', 'file/jersey (14).jpg', 3, 3, 1, 2, 0, '33', '否', '2024年1月', '星辰大海，征途漫漫', '杨幂幂、上官秋月、慕容雪', '星辰大海队志在远方', '2022010010040', '杨幂幂', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (15, '2026-01-29 08:15:50', '邓超超', '王者荣耀', 'file/logo (15).jpg', 'file/jersey (15).jpg', 3, 9, 3, 0, 0, '100', '否', '2024年1月', '王者荣耀，荣耀王者', '邓超超、尉迟恭、令狐平', '王者荣耀队实力强劲，攻守平衡', '2022010010043', '邓超超', 0, 0, '是', '');
INSERT INTO `qiuduipaixingbang` VALUES (16, '2026-01-29 08:15:50', '赵丽颖', '传奇之路', 'file/logo (16).jpg', 'file/jersey (16).jpg', 3, 3, 1, 2, 0, '33', '否', '2024年1月', '传奇之路，创造传奇', '赵丽颖、诸葛芸芸、独孤静', '传奇之路队以弱胜强，黑马本色', '2022010010046', '赵丽颖', 0, 0, '是', '');

-- ----------------------------
-- Table structure for sensitive_word
-- ----------------------------
DROP TABLE IF EXISTS `sensitive_word`;
CREATE TABLE `sensitive_word`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `content` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT '垃圾,傻逼,二逼' COMMENT '内容',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 2 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '敏感词' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of sensitive_word
-- ----------------------------
INSERT INTO `sensitive_word` VALUES (1, '2026-01-29 16:15:50', '垃圾,傻逼,二逼');

-- ----------------------------
-- Table structure for storeup
-- ----------------------------
DROP TABLE IF EXISTS `storeup`;
CREATE TABLE `storeup`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `refid` bigint(20) NULL DEFAULT NULL COMMENT 'refid',
  `tablename` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '表名',
  `name` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '名称',
  `picture` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '图片',
  `type` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '类型(1:收藏,21:赞,22:踩,31:竞拍参与,41:关注)',
  `inteltype` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '推荐类型',
  `remark` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '备注',
  `userid` bigint(20) NOT NULL COMMENT '用户id',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 1 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '我的收藏' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of storeup
-- ----------------------------

-- ----------------------------
-- Table structure for token
-- ----------------------------
DROP TABLE IF EXISTS `token`;
CREATE TABLE `token`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `userid` bigint(20) NOT NULL COMMENT '用户id',
  `username` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '用户名',
  `tablename` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '表名',
  `role` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NULL DEFAULT NULL COMMENT '角色',
  `token` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '密码',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '新增时间',
  `expiratedtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '过期时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 16 CHARACTER SET = utf8 COLLATE = utf8_general_ci COMMENT = 'token表' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of token
-- ----------------------------
INSERT INTO `token` VALUES (1, 31, '2022010010031', 'cansaixuesheng', '参赛学生', '89z3di8wfclg2zfb8ndcie0y0wrzg2kt', '2026-02-01 14:59:12', '2026-02-01 15:59:12');
INSERT INTO `token` VALUES (2, 1, '2022010010001', 'qiuduiduizhang', '球队队长', 'x2rkomfrn88y5odb13vvdrihn2qdxzi7', '2026-02-01 14:59:56', '2026-02-02 15:16:29');
INSERT INTO `token` VALUES (3, 1, '2022010010001', 'users', '管理员', 'gt379d9699w5dywhb43ouuomtph49sqk', '2026-02-01 15:04:27', '2026-02-02 16:45:52');
INSERT INTO `token` VALUES (4, 17, '2022010010017', 'cansaixuesheng', '参赛学生', 'u6me1fnz8bc9aogqoondi42dd4lvtsnt', '2026-02-01 15:13:55', '2026-02-01 16:13:56');
INSERT INTO `token` VALUES (5, 1, '2022010010001', 'cansaixuesheng', '参赛学生', '70swsmlnqsd46n08a1g9ujj3gqgksw34', '2026-02-01 16:38:25', '2026-02-02 16:32:06');
INSERT INTO `token` VALUES (6, 5, '2022010010005', 'cansaixuesheng', '参赛学生', '4980fnxkb2x6dftl58s4gucxrz095j1k', '2026-02-01 16:41:28', '2026-02-02 14:51:59');
INSERT INTO `token` VALUES (7, 2, '2022010010002', 'cansaixuesheng', '参赛学生', 's1h01tfn01xbth3dqk72itcbi3w2b501', '2026-02-02 13:44:23', '2026-02-02 14:44:23');
INSERT INTO `token` VALUES (8, 3, '2022010010003', 'cansaixuesheng', '参赛学生', 'c1mhkap7uc96hqc8fyj12lpu1d1xg187', '2026-02-02 13:44:57', '2026-02-02 14:44:57');
INSERT INTO `token` VALUES (9, 4, '2022010010004', 'cansaixuesheng', '参赛学生', 'wqlb1x85bli6xdm9bemwjpnog4nk11gw', '2026-02-02 13:45:25', '2026-02-02 14:45:25');
INSERT INTO `token` VALUES (10, 18, '2022010010018', 'cansaixuesheng', '参赛学生', 'jhztc8zprk6pusd04axn6s1tw5iepmum', '2026-02-02 13:52:19', '2026-02-02 14:52:20');
INSERT INTO `token` VALUES (11, 1, 'CP2023001', 'caipanyuan', '裁判员', 'e7xaj8r54g9jj6cw3gwqwe7kgr6p4eu6', '2026-02-02 14:17:01', '2026-02-02 15:17:02');
INSERT INTO `token` VALUES (12, 9, '2022010010025', 'qiuduiduizhang', '球队队长', '7o527zk6e88vsqb1f1lhh9h1r5nwkoid', '2026-02-02 14:17:29', '2026-02-02 15:17:30');
INSERT INTO `token` VALUES (13, 14, '2022010010040', 'qiuduiduizhang', '球队队长', 'vlx2sqfwlfadojpp4sp8074dbuc6z5ja', '2026-02-02 14:17:47', '2026-02-02 15:17:48');
INSERT INTO `token` VALUES (14, 7, 'CP2023007', 'caipanyuan', '裁判员', 'x8ouu8e5oygeayi6e6eih9nx0vh8euhd', '2026-02-02 14:18:05', '2026-02-02 15:18:06');
INSERT INTO `token` VALUES (15, 9, 'CP2023009', 'caipanyuan', '裁判员', 'ubo1xysbm3mqy9mye3sjilfn3bzbc6t0', '2026-02-02 14:24:32', '2026-02-02 15:24:33');

-- ----------------------------
-- Table structure for users
-- ----------------------------
DROP TABLE IF EXISTS `users`;
CREATE TABLE `users`  (
  `id` bigint(20) NOT NULL AUTO_INCREMENT COMMENT '主键',
  `addtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间',
  `username` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '用户名',
  `password` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NOT NULL COMMENT '密码',
  `role` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci NULL DEFAULT NULL COMMENT '角色',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE = InnoDB AUTO_INCREMENT = 2 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_unicode_ci COMMENT = '管理员' ROW_FORMAT = DYNAMIC;

-- ----------------------------
-- Records of users
-- ----------------------------
INSERT INTO `users` VALUES (1, '2026-01-29 16:15:51', 'admin', 'admin', '管理员');

-- ----------------------------
-- Procedure structure for sp_crazily_post
-- ----------------------------
DROP PROCEDURE IF EXISTS `sp_crazily_post`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `sp_crazily_post`(
    IN p_id BIGINT,
    IN p_userid BIGINT,
    OUT p_result INT,
    OUT p_message VARCHAR(500)
)
BEGIN
    DECLARE v_post_count INT;
    DECLARE v_current_crazily INT;
    
    DECLARE EXIT HANDLER FOR SQLEXCEPTION
    BEGIN
        ROLLBACK;
        SET p_result = -1;
        SET p_message = '数据库错误，踩操作失败';
    END;
    
    START TRANSACTION;
    
    -- 验证帖子是否存在
    SELECT COUNT(*) INTO v_post_count FROM forum WHERE id = p_id AND is_del = 0;
    
    IF v_post_count = 0 THEN
        SET p_result = -2;
        SET p_message = '帖子不存在或已删除';
        ROLLBACK;
    ELSE
        -- 获取当前踩数
        SELECT crazily_number INTO v_current_crazily FROM forum WHERE id = p_id;
        
        -- 更新踩数
        UPDATE forum SET crazily_number = crazily_number + 1 WHERE id = p_id;
        
        SET p_result = 1;
        SET p_message = CONCAT('踩成功，当前踩数：', v_current_crazily + 1);
        COMMIT;
    END IF;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for sp_create_post
-- ----------------------------
DROP PROCEDURE IF EXISTS `sp_create_post`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `sp_create_post`(
    IN p_title VARCHAR(200),
    IN p_content LONGTEXT,
    IN p_userid BIGINT,
    IN p_username VARCHAR(200),
    IN p_avatarurl LONGTEXT,
    IN p_type_name VARCHAR(200),
    IN p_cover LONGTEXT,
    IN p_is_anonymous INT,
    OUT p_result INT,
    OUT p_message VARCHAR(500)
)
BEGIN
    DECLARE v_type_count INT;
    
    DECLARE EXIT HANDLER FOR SQLEXCEPTION
    BEGIN
        ROLLBACK;
        SET p_result = -1;
        SET p_message = '数据库错误，帖子创建失败';
    END;
    
    START TRANSACTION;
    
    -- 验证必填字段
    IF p_title IS NULL OR p_title = '' THEN
        SET p_result = -2;
        SET p_message = '标题不能为空';
        ROLLBACK;
    ELSEIF p_content IS NULL OR p_content = '' THEN
        SET p_result = -3;
        SET p_message = '内容不能为空';
        ROLLBACK;
    ELSEIF p_userid IS NULL OR p_userid = 0 THEN
        SET p_result = -4;
        SET p_message = '用户ID不能为空';
        ROLLBACK;
    ELSEIF p_type_name IS NULL OR p_type_name = '' THEN
        SET p_result = -5;
        SET p_message = '分类不能为空';
        ROLLBACK;
    ELSE
        -- 验证分类是否存在
        SELECT COUNT(*) INTO v_type_count FROM forum_type WHERE type_name = p_type_name;
        
        IF v_type_count = 0 THEN
            SET p_result = -6;
            SET p_message = '分类不存在';
            ROLLBACK;
        ELSE
            -- 插入帖子
            INSERT INTO forum (
                addtime,
                title,
                content,
                parentid,
                userid,
                username,
                avatarurl,
                isdone,
                is_top,
                top_time,
                type_name,
                cover,
                is_anonymous,
                is_del,
                thumbsup_number,
                crazily_number
            ) VALUES (
                CURRENT_TIMESTAMP,
                p_title,
                p_content,
                0,
                p_userid,
                p_username,
                p_avatarurl,
                '开放',
                0,
                NULL,
                p_type_name,
                p_cover,
                IFNULL(p_is_anonymous, 0),
                0,
                0,
                0
            );
            
            SET p_result = 1;
            SET p_message = CONCAT('帖子创建成功，ID：', LAST_INSERT_ID());
            COMMIT;
        END IF;
    END IF;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for sp_delete_post
-- ----------------------------
DROP PROCEDURE IF EXISTS `sp_delete_post`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `sp_delete_post`(
    IN p_id BIGINT,
    OUT p_result INT,
    OUT p_message VARCHAR(500)
)
BEGIN
    DECLARE v_post_count INT;
    
    DECLARE EXIT HANDLER FOR SQLEXCEPTION
    BEGIN
        ROLLBACK;
        SET p_result = -1;
        SET p_message = '数据库错误，删除操作失败';
    END;
    
    START TRANSACTION;
    
    -- 验证帖子是否存在
    SELECT COUNT(*) INTO v_post_count FROM forum WHERE id = p_id AND is_del = 0;
    
    IF v_post_count = 0 THEN
        SET p_result = -2;
        SET p_message = '帖子不存在或已删除';
        ROLLBACK;
    ELSE
        -- 软删除帖子
        UPDATE forum SET is_del = 1 WHERE id = p_id;
        
        SET p_result = 1;
        SET p_message = CONCAT('帖子删除成功，ID：', p_id);
        COMMIT;
    END IF;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for sp_edit_post
-- ----------------------------
DROP PROCEDURE IF EXISTS `sp_edit_post`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `sp_edit_post`(
    IN p_id BIGINT,
    IN p_title VARCHAR(200),
    IN p_content LONGTEXT,
    IN p_cover LONGTEXT,
    IN p_type_name VARCHAR(200),
    OUT p_result INT,
    OUT p_message VARCHAR(500)
)
BEGIN
    DECLARE v_post_count INT;
    DECLARE v_type_count INT;
    
    DECLARE EXIT HANDLER FOR SQLEXCEPTION
    BEGIN
        ROLLBACK;
        SET p_result = -1;
        SET p_message = '数据库错误，帖子编辑失败';
    END;
    
    START TRANSACTION;
    
    -- 验证帖子是否存在
    SELECT COUNT(*) INTO v_post_count FROM forum WHERE id = p_id AND is_del = 0;
    
    IF v_post_count = 0 THEN
        SET p_result = -2;
        SET p_message = '帖子不存在或已删除';
        ROLLBACK;
    ELSE
        -- 验证必填字段
        IF p_title IS NULL OR p_title = '' THEN
            SET p_result = -3;
            SET p_message = '标题不能为空';
            ROLLBACK;
        ELSEIF p_content IS NULL OR p_content = '' THEN
            SET p_result = -4;
            SET p_message = '内容不能为空';
            ROLLBACK;
        ELSE
            -- 验证分类是否存在
            SELECT COUNT(*) INTO v_type_count FROM forum_type WHERE type_name = p_type_name;
            
            IF v_type_count = 0 THEN
                SET p_result = -5;
                SET p_message = '分类不存在';
                ROLLBACK;
            ELSE
                -- 更新帖子
                UPDATE forum SET
                    title = p_title,
                    content = p_content,
                    cover = p_cover,
                    type_name = p_type_name
                WHERE id = p_id AND is_del = 0;
                
                SET p_result = 1;
                SET p_message = CONCAT('帖子编辑成功，ID：', p_id);
                COMMIT;
            END IF;
        END IF;
    END IF;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for sp_get_posts
-- ----------------------------
DROP PROCEDURE IF EXISTS `sp_get_posts`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `sp_get_posts`(
    IN p_page INT,
    IN p_page_size INT,
    IN p_type_name VARCHAR(200),
    IN p_order_by VARCHAR(50)
)
BEGIN
    DECLARE v_offset INT;
    SET v_offset = (p_page - 1) * p_page_size;
    
    -- 根据参数构建查询
    IF p_type_name IS NULL OR p_type_name = '' THEN
        -- 查询所有分类
        IF p_order_by = 'hot' THEN
            SELECT id, addtime, title, content, parentid, userid, username, 
                   avatarurl, isdone, is_top, top_time, type_name, cover, 
                   is_anonymous, thumbsup_number, crazily_number 
            FROM forum 
            WHERE is_del = 0 
            ORDER BY thumbsup_number DESC, crazily_number DESC 
            LIMIT v_offset, p_page_size;
        ELSEIF p_order_by = 'latest' THEN
            SELECT id, addtime, title, content, parentid, userid, username, 
                   avatarurl, isdone, is_top, top_time, type_name, cover, 
                   is_anonymous, thumbsup_number, crazily_number 
            FROM forum 
            WHERE is_del = 0 
            ORDER BY addtime DESC 
            LIMIT v_offset, p_page_size;
        ELSE
            SELECT id, addtime, title, content, parentid, userid, username, 
                   avatarurl, isdone, is_top, top_time, type_name, cover, 
                   is_anonymous, thumbsup_number, crazily_number 
            FROM forum 
            WHERE is_del = 0 
            ORDER BY is_top DESC, addtime DESC 
            LIMIT v_offset, p_page_size;
        END IF;
    ELSE
        -- 查询指定分类
        IF p_order_by = 'hot' THEN
            SELECT id, addtime, title, content, parentid, userid, username, 
                   avatarurl, isdone, is_top, top_time, type_name, cover, 
                   is_anonymous, thumbsup_number, crazily_number 
            FROM forum 
            WHERE is_del = 0 AND type_name = p_type_name
            ORDER BY thumbsup_number DESC, crazily_number DESC 
            LIMIT v_offset, p_page_size;
        ELSEIF p_order_by = 'latest' THEN
            SELECT id, addtime, title, content, parentid, userid, username, 
                   avatarurl, isdone, is_top, top_time, type_name, cover, 
                   is_anonymous, thumbsup_number, crazily_number 
            FROM forum 
            WHERE is_del = 0 AND type_name = p_type_name
            ORDER BY addtime DESC 
            LIMIT v_offset, p_page_size;
        ELSE
            SELECT id, addtime, title, content, parentid, userid, username, 
                   avatarurl, isdone, is_top, top_time, type_name, cover, 
                   is_anonymous, thumbsup_number, crazily_number 
            FROM forum 
            WHERE is_del = 0 AND type_name = p_type_name
            ORDER BY is_top DESC, addtime DESC 
            LIMIT v_offset, p_page_size;
        END IF;
    END IF;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for sp_test_simple
-- ----------------------------
DROP PROCEDURE IF EXISTS `sp_test_simple`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `sp_test_simple`(
    IN p_test VARCHAR(100),
    OUT p_result INT,
    OUT p_message VARCHAR(500)
)
BEGIN
    SET p_result = 1;
    SET p_message = CONCAT('测试成功，输入：', p_test);
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for sp_thumbsup_post
-- ----------------------------
DROP PROCEDURE IF EXISTS `sp_thumbsup_post`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `sp_thumbsup_post`(
    IN p_id BIGINT,
    IN p_userid BIGINT,
    OUT p_result INT,
    OUT p_message VARCHAR(500)
)
BEGIN
    DECLARE v_post_count INT;
    DECLARE v_current_thumbsup INT;
    
    DECLARE EXIT HANDLER FOR SQLEXCEPTION
    BEGIN
        ROLLBACK;
        SET p_result = -1;
        SET p_message = '数据库错误，点赞操作失败';
    END;
    
    START TRANSACTION;
    
    -- 验证帖子是否存在
    SELECT COUNT(*) INTO v_post_count FROM forum WHERE id = p_id AND is_del = 0;
    
    IF v_post_count = 0 THEN
        SET p_result = -2;
        SET p_message = '帖子不存在或已删除';
        ROLLBACK;
    ELSE
        -- 获取当前点赞数
        SELECT thumbsup_number INTO v_current_thumbsup FROM forum WHERE id = p_id;
        
        -- 更新点赞数
        UPDATE forum SET thumbsup_number = thumbsup_number + 1 WHERE id = p_id;
        
        SET p_result = 1;
        SET p_message = CONCAT('点赞成功，当前点赞数：', v_current_thumbsup + 1);
        COMMIT;
    END IF;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for sp_top_post
-- ----------------------------
DROP PROCEDURE IF EXISTS `sp_top_post`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `sp_top_post`(
    IN p_id BIGINT,
    IN p_is_top INT,
    OUT p_result INT,
    OUT p_message VARCHAR(500)
)
BEGIN
    DECLARE v_post_count INT;
    
    DECLARE EXIT HANDLER FOR SQLEXCEPTION
    BEGIN
        ROLLBACK;
        SET p_result = -1;
        SET p_message = '数据库错误，置顶操作失败';
    END;
    
    START TRANSACTION;
    
    -- 验证帖子是否存在
    SELECT COUNT(*) INTO v_post_count FROM forum WHERE id = p_id AND is_del = 0;
    
    IF v_post_count = 0 THEN
        SET p_result = -2;
        SET p_message = '帖子不存在或已删除';
        ROLLBACK;
    ELSE
        -- 更新置顶状态
        IF p_is_top = 1 THEN
            UPDATE forum SET
                is_top = 1,
                top_time = CURRENT_TIMESTAMP
            WHERE id = p_id AND is_del = 0;
            
            SET p_result = 1;
            SET p_message = CONCAT('帖子置顶成功，ID：', p_id);
        ELSE
            UPDATE forum SET
                is_top = 0,
                top_time = NULL
            WHERE id = p_id AND is_del = 0;
            
            SET p_result = 1;
            SET p_message = CONCAT('帖子取消置顶成功，ID：', p_id);
        END IF;
        
        COMMIT;
    END IF;
END
;;
delimiter ;

-- ----------------------------
-- Procedure structure for sp_validate_post
-- ----------------------------
DROP PROCEDURE IF EXISTS `sp_validate_post`;
delimiter ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `sp_validate_post`(
    IN p_id BIGINT,
    OUT p_result INT,
    OUT p_message VARCHAR(500)
)
BEGIN
    DECLARE v_post_count INT;
    DECLARE v_user_count INT;
    DECLARE v_type_count INT;
    
    DECLARE EXIT HANDLER FOR SQLEXCEPTION
    BEGIN
        SET p_result = -1;
        SET p_message = '数据库错误，验证失败';
    END;
    
    -- 验证帖子是否存在
    SELECT COUNT(*) INTO v_post_count FROM forum WHERE id = p_id;
    
    IF v_post_count = 0 THEN
        SET p_result = -2;
        SET p_message = '帖子不存在';
    ELSE
        -- 验证用户是否存在
        SELECT COUNT(*) INTO v_user_count FROM cansaixuesheng WHERE id = (SELECT userid FROM forum WHERE id = p_id);
        
        IF v_user_count = 0 THEN
            SET p_result = -3;
            SET p_message = '用户不存在';
        ELSE
            -- 验证分类是否存在
            SELECT COUNT(*) INTO v_type_count FROM forum_type WHERE type_name = (SELECT type_name FROM forum WHERE id = p_id);
            
            IF v_type_count = 0 THEN
                SET p_result = -4;
                SET p_message = '分类不存在';
            ELSE
                SET p_result = 1;
                SET p_message = '数据验证通过';
            END IF;
        END IF;
    END IF;
END
;;
delimiter ;

SET FOREIGN_KEY_CHECKS = 1;
